{
    "-dxG-aEe4w": "Se ha alcanzado el número máximo de códigos de verificación por SMS enviados hoy.",
    "4sQWoTgfr": "El código de verificación ha caducado. Actualiza la página e inténtalo de nuevo.",
    "4sdQWoTgfr": "El código de verificación ha caducado, actualice la página e inténtelo de nuevo.",
    "8s1R5nChx": "El código de invitación está vacío, esta comunidad no está abierta al público sino limitada a usuarios invitados.",
    "8s1dX": "El código de invitación no existe en el sistema; verifique si hay un problema que distingue entre mayúsculas y minúsculas.",
    "8sVG1RXhx": "la contraseña debe tener al menos 6 caracteres",
    "8sVG1RdXhx": "El ID de usuario ya existe",
    "8sVG1kqXhx": "El ID de usuario debe tener al menos 2 caracteres",
    "8sVGdXhx": "La identificación de usuario solo debe contener letras y números.",
    "8saIR-LCjyChx": "El código de invitación ha caducado",
    "8saIt5r5nGxwwChx": "El código de invitación se ha agotado.",
    "CuHqw9m": "{0} no es un número de teléfono válido; actualmente el sistema acepta solo números de teléfono de 11 dígitos.",
    "D_9sNBiZj": "Lo intentaste demasiadas veces, inténtalo de nuevo más tarde.",
    "HZEGO_YeW": "Esta es una cadena de prueba para decir Hola mundo, ¿está bien?",
    "HaU4NMabv": "El código de verificación es incorrecto. Vuelva a ingresar o actualice la imagen.",
    "K2UEY4ddl": "El ID de usuario contiene palabras no válidas; evite utilizar {0}",
    "RYlJHHwg3": "El código SMS no es correcto.",
    "TXdh_K": "Contraseña",
    "TdXddh_wK": "Número de teléfono",
    "Te3h_wK": "Número de teléfono",
    "TqXdd3h_wK": "Número de teléfono",
    "TqXddh_K": "Código de verificación",
    "TqXdh_K": "confirmar Contraseña",
    "Xddh_wK": "código de invitación",
    "Y-svpKvUz": "dos contraseñas no coinciden",
    "dsdfqw": "el usuario no existe",
    "eqwee": "La contraseña no es correcta",
    "m1932": "{0} es tu código de verificación",
    "m2308": "Si no solicitó este código, puede ignorar este correo electrónico con seguridad.",
    "m23091": "Gracias por utilizar LafTools. Para completar su solicitud, ingrese el siguiente código de verificación en la solicitud:",
    "oHQNQ4mRw": "ID de usuario",
    "wCcPJZK": "{0} no es un correo electrónico válido",
    "wCctGPJZK": "{0} no debe estar vacío"
}