{
    "-dxG-aEe4w": "O número máximo de códigos de verificação SMS enviados hoje foi atingido.",
    "4sQWoTgfr": "O código de verificação expirou. Atualize a página e tente novamente",
    "4sdQWoTgfr": "O código de verificação expirou. Atualize a página e tente novamente.",
    "8s1R5nChx": "O código de convite está vazio, esta comunidade não está aberta ao público, mas limitada a usuários convidados.",
    "8s1dX": "O código de convite não existe no sistema. Verifique se há algum problema com distinção entre maiúsculas e minúsculas.",
    "8sVG1RXhx": "a senha deve ter pelo menos 6 caracteres",
    "8sVG1RdXhx": "O ID do usuário já existe",
    "8sVG1kqXhx": "O ID do usuário deve ter pelo menos 2 caracteres",
    "8sVGdXhx": "O ID do usuário deve conter apenas letras e números",
    "8saIR-LCjyChx": "O código de convite expirou",
    "8saIt5r5nGxwwChx": "O código de convite foi usado",
    "CuHqw9m": "{0} não é um número de telefone válido. Atualmente o sistema aceita apenas números de telefone de 11 dígitos.",
    "D_9sNBiZj": "Você tentou muitas vezes. Tente novamente mais tarde.",
    "HZEGO_YeW": "Esta é uma string de teste para dizer Olá, mundo, está tudo bem?",
    "HaU4NMabv": "O código de verificação está incorreto. Insira novamente ou atualize a imagem.",
    "K2UEY4ddl": "O ID do usuário contém palavras inválidas. Evite usar {0}",
    "RYlJHHwg3": "O código SMS não está correto.",
    "TXdh_K": "Senha",
    "TdXddh_wK": "Número de telefone",
    "Te3h_wK": "Número de telefone",
    "TqXdd3h_wK": "Número de telefone",
    "TqXddh_K": "Código de verificação",
    "TqXdh_K": "Confirme sua senha",
    "Xddh_wK": "Código de Convite",
    "Y-svpKvUz": "duas senhas não coincidem",
    "dsdfqw": "Usuário não existe",
    "eqwee": "A senha não está correta",
    "m1932": "{0} é o seu código de verificação",
    "m2308": "Se você não solicitou este código, pode ignorar este e-mail com segurança.",
    "m23091": "Obrigado por usar o LafTools. Para concluir sua solicitação, insira o seguinte código de verificação no aplicativo:",
    "oHQNQ4mRw": "ID do usuário",
    "wCcPJZK": "{0} não é um e-mail válido",
    "wCctGPJZK": "{0} não deve estar vazio"
}