{
    "Diff-XML-JSON-Article": "Verschil tussen XML en JSON",
    "MDN-XML-Syntax": "MDN-webdocumenten - XML-syntaxis",
    "W3Schools-XML-Validation": "W3Schools - XML-validatie",
    "XML-Advantage-Readable-018": "Het door mensen leesbare karakter maakt eenvoudige inspectie en foutopsporing mogelijk, en de mogelijkheid om aangepaste structuren te definiëren maakt het flexibel voor meerdere gebruiksscenario's.",
    "XML-Advantage-Standardized-017": "XML is een algemeen aanvaarde standaard, waardoor deze compatibel is met verschillende platforms en systemen, wat de interoperabiliteit en gegevensuitwisseling bevordert.",
    "XML-Advantages-016": "Wat zijn de voordelen van het gebruik van XML?",
    "XML-Attributes-006": "Elementen kunnen attributen hebben die aanvullende informatie geven over het element binnen de openingstag, zoals {0}",
    "XML-Basics-001": "Wat is XML?",
    "XML-Def-002": "XML (eXtensible Markup Language) is een opmaaktaal die een reeks regels definieert voor het coderen van documenten in een formaat dat zowel door mensen als door machines leesbaar is.",
    "XML-Disadvantage-Size-020": "XML kan relatief uitgebreid zijn, wat resulteert in grotere bestandsgroottes vergeleken met alternatieven zoals JSON, wat van invloed is op de transmissiesnelheid en opslagvereisten.",
    "XML-Disadvantages-019": "Wat zijn enkele nadelen van het gebruik van XML?",
    "XML-JSON-Diff-Structure-014": "XML gebruikt uitgebreide, hiërarchische tags voor de structuur, terwijl JSON afhankelijk is van sleutel-waardeparen en arrays. Voorbeeld: XML {0} versus JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML heeft een striktere syntaxis met afsluitende tags en attributen, terwijl de syntaxis van JSON lichter is en dichter bij de JavaScript-objectnotatie ligt. JSON wordt over het algemeen beschouwd als gemakkelijker te parseren en via internet te verzenden.",
    "XML-JSON-Difference-013": "Wat is het verschil tussen XML en JSON?",
    "XML-Nesting-007": "Hoe werkt nesten in XML?",
    "XML-Nesting-Example-009": "'<boek><titel>Mijn boektitel</title><auteur>John Doe</author></book>` vertegenwoordigt bijvoorbeeld een boek met de titel en auteur als geneste elementen.",
    "XML-Nesting-Explanation-008": "In XML kunnen elementen in elkaar worden genest om hiërarchische relaties weer te geven. De onderliggende elementen worden tussen de openings- en sluitingstags van hun bovenliggende element geplaatst.",
    "XML-Processing-Speed-021": "Het parseren en genereren van XML kan langzamer zijn vanwege de strikte syntaxis en de noodzaak van validatie, vooral als het om complexe documenten gaat.",
    "XML-Purpose-003": "Het is ontworpen om gegevens over te dragen in plaats van gegevens zoals HTML weer te geven, waardoor het kan worden gebruikt als een algemeen formaat voor het delen van gestructureerde informatie tussen verschillende platforms en applicaties.",
    "XML-Syntax-004": "Wat is de basissyntaxis van XML?",
    "XML-Syntax-Example-005": "Een eenvoudig XML-document bestaat uit elementen in een boomachtige structuur. Elk element begint met een tag tussen punthaken (<element>) en eindigt met een afsluitende tag (</element>).",
    "XML-Validation-010": "Wat is XML-validatie en hoe werkt het?",
    "XML-Validation-Def-011": "XML-validatie zorgt ervoor dat een XML-document voldoet aan een specifieke set regels die zijn gedefinieerd in een Document Type Definition (DTD) of een XML Schema (XSD).",
    "XML-Validation-Process-012": "Validators controleren of alle vereiste elementen en attributen aanwezig zijn, valideren de gegevenstypen en handhaven eventuele beperkingen die in het schema zijn gespecificeerd voordat het document wordt verwerkt."
}