{
    "md5-cpp-install-openssl-0002": "Установите OpenSSL в своей системе и свяжите его с библиотеками libssl и libcrypto при создании приложения на C++.",
    "md5-cpp-openssl-0001": "C++ использует библиотеку OpenSSL для генерации хэшей MD5. Вам необходимо установить OpenSSL и связать его с ним в своем проекте.",
    "md5-cpp-use-openssl-0003": "Фрагмент создает функцию getMD5, которая принимает входную строку, вычисляет ее хэш MD5 с помощью API MD5 OpenSSL и возвращает хэш в виде шестнадцатеричной строки. Вставьте этот код в свою программу на C++ и вызовите функцию getMD5 с нужным вводом.",
    "md5-csharp-built-in-0001": "В C# класс System.Security.Cryptography.MD5 используется для генерации хешей MD5.",
    "md5-csharp-no-install-0002": "Установка внешней библиотеки не требуется, поскольку она является частью .NET Framework/Core.",
    "md5-csharp-use-0003": "Этот фрагмент создает экземпляр MD5, преобразует входную строку в байты, вычисляет хеш и, наконец, кодирует хэш в формате Base64. Поместите этот код в точку входа вашего приложения C# и запустите его, чтобы получить хэш MD5 в кодировке Base64.",
    "md5-java-built-in-0001": "Java использует класс java.security.MessageDigest для генерации хешей MD5.",
    "md5-java-imports-0002": "Вам необходимо импортировать «java.security.MessageDigest» и «java.util.Base64» для хеширования и кодирования результата.",
    "md5-java-use-0003": "Фрагмент получает экземпляр алгоритма дайджеста MD5, обновляет его байтами входной строки, а затем кодирует полученный хэш в строку Base64. Скопируйте этот код в класс Java и выполните его основной метод, чтобы получить хэш MD5 в кодировке Base64.",
    "md5-nodejs-built-in-0001": "В Node.js встроенный модуль «crypto» используется для генерации хешей MD5.",
    "md5-nodejs-no-install-0002": "Установка внешней библиотеки не требуется, поскольку «crypto» предустановлено в Node.js.",
    "md5-nodejs-use-0003": "Фрагмент создает хеш-объект с помощью createHash('md5')`, обновляет его входной строкой, а затем преобразует дайджест в шестнадцатеричный формат с помощью `.digest('hex')`. Вставьте этот код в свой скрипт Node.js и выполните его, чтобы получить хэш MD5 входного значения.",
    "md5-php-built-in-0001": "PHP имеет встроенную функцию md5() для генерации хэшей MD5.",
    "md5-php-no-install-0002": "Никакой установки внешней библиотеки не требуется, поскольку md5() предустановлен в PHP.",
    "md5-php-use-0003": "В этом простом примере определяется функция getMD5, которая вызывает функцию PHP md5() для предоставленной входной строки. Скопируйте этот код в файл PHP, сохраните его с расширением .php и запустите на веб-сервере или через командную строку, чтобы увидеть MD5-хеш входного значения.",
    "md5-python-built-in-0001": "Python использует встроенную библиотеку hashlib для генерации хэшей MD5.",
    "md5-python-no-install-0002": "Никакой дополнительной установки не требуется, поскольку hashlib входит в стандартную комплектацию Python.",
    "md5-python-use-0003": "Предоставленный шаблон кодирует входную строку в байты перед созданием хеш-объекта MD5. Затем для хэш-объекта вызывается метод .hexdigest() для получения хеша MD5 в шестнадцатеричной форме. Скопируйте этот код в скрипт Python и запустите его, чтобы получить хэш MD5."
}