{
    "c1p4b": "Cada número decimal é então convertido em uma sequência exclusiva de cinco caracteres Base85. Se houver menos de quatro bytes restantes no final, o preenchimento poderá ser aplicado.",
    "d7w2e": "Base85 funciona dividindo os dados de entrada em grupos de quatro bytes e convertendo cada grupo em um número decimal entre 0 e 2^32-1.",
    "f9t1z": "Base85 foi inicialmente desenvolvido para representar eficientemente dados binários em documentos PostScript para melhores taxas de compactação.",
    "g3h5s": "Como funciona o Base85?",
    "j5s7r": "Como codifico/decodifico com Base85 em JavaScript?",
    "k2em5e": "Isto resulta em cadeias de saída mais curtas para a mesma quantidade de dados de entrada, o que pode ser benéfico em cenários onde a minimização do tamanho é crítica.",
    "p8eq9n": "Você pode usar bibliotecas como 'base85' ou 'ascii85' para codificação e decodificação Base85 em JavaScript.",
    "q2n3r": "Hoje, é usado em diversas aplicações onde a eficiência de espaço e a legibilidade são cruciais, como documentos PDF e determinados protocolos de rede.",
    "r9qn8v": "A principal vantagem do Base85 é sua maior eficiência de espaço devido a um conjunto maior de caracteres (85 vs. 64 em Base64 ou 32 em Base32).",
    "u1i2b": "Quais são as vantagens de usar Base85 em vez de Base64 ou Base32?",
    "v4k6r": "Ele codifica dados em um formato mais compacto em comparação com Base64 ou Base32 usando um conjunto de caracteres maior.",
    "w1x4k": "Sim, existem diversas variantes, incluindo Ascii85 (usado em PostScript e PDF), Z85 (ZeroMQ) e UUencode (um formato mais antigo). Cada um tem um conjunto de caracteres e regras ligeiramente diferentes.",
    "x9n1b": "Base85 é um esquema de codificação que representa dados binários usando um conjunto de 85 caracteres ASCII imprimíveis.",
    "y6m8k": "Por que o Base85 foi criado?",
    "z2t7m": "O que é Base85?",
    "z5m6t": "Exemplo de uso: `const base85 = require('base85'); const codificado = base85.encode('seus dados'); const decodificado = base85.decode(codificado);`",
    "z9t7p": "Existem variantes específicas do Base85?"
}