{
    "123e4567": "Hvad er Base64?",
    "1a2b3c4d": "Hvorfor bruge Base64?",
    "23fgh456": "Historien om Base64",
    "2bcde3fg": "Ulemper ved Base64",
    "34wxyz56": "Hvordan koder/afkoder jeg Base64 i JavaScript?",
    "4hijk5lm": "Størrelsesforøgelse: Kodede data er omtrent 33 % større end de originale binære data.",
    "5e6f7g8h": "Base64 bruges, når binære data skal transmitteres gennem tekstbaserede protokoller som e-mail eller JSON, eller indlejret på steder, hvor kun tekst er tilladt.",
    "6nopqrst": "Ingen kryptering: Base64 er ikke en krypteringsmetode; det er nemt at afkode og giver ingen sikkerhed.",
    "78abcdef": "JavaScript tilbyder indbyggede funktioner såsom btoa() og atob() til henholdsvis Base64-kodning og -afkodning.",
    "78ijk9lm": "Base64 blev først defineret i RFC 1421 (1993) og senere standardiseret i RFC 4648 (2006).",
    "9i0j1k2l": "Det bruges også til at indlejre små billeder direkte i HTML eller CSS som data-URL'er.",
    "ab9c0d1e": "De primære operationer inkluderer kodning (konvertering af binær til Base64) og afkodning (konvertering af Base64 tilbage til binær).",
    "abc12345": "Base64 er et kodningsskema, der repræsenterer binære data som en sekvens af ASCII-tegn.",
    "abcdef12": "Hvordan virker Base64?",
    "bcdef01a": "Base64 fungerer ved at opdele binære data i grupper på 6 bit og kortlægge hver gruppe til et specifikt tegn fra et alfabet på 64 tegn (A-Za-z0-9+/).",
    "cbaq54321": "Nej, Base64 er ikke en komprimeringsteknik, den ændrer kun repræsentationen af ​​data, ikke dens størrelse.",
    "cdefg234": "Udfyldningstegn (=) tilføjes i slutningen for at sikre, at den kodede datalængde er et multiplum af 4 tegn.",
    "efg45678": "Sammenligning med Base32",
    "efghi678": "Denne variant bruges ofte til filnavne, URL'er eller situationer, hvor specialtegn skal undgås.",
    "fghi6789": "Det bruges til at overføre eller gemme binære filer i tekstbaserede formater, hvilket sikrer kompatibilitet på tværs af forskellige systemer.",
    "hij90klm": "Base32 bruger et mindre alfabet (A-Z2-7), hvilket resulterer i længere, men mere læselige strenge.",
    "mno34567": "Fordele ved Base64",
    "mnoijklm": "Er der andre BaseXX-kodninger?",
    "n0pqrstu": "Eksempel på brug af Base64",
    "nopqrs01": "Mens Base64 optimerer for kompakthed, vælges Base32, når det er afgørende at minimere inputfejl, såsom manuel indtastning.",
    "pqrs890t": "Universal kompatibilitet: Base64 er bredt anerkendt og understøttet i alle større programmeringssprog.",
    "qrstuvwx": "Ja, bortset fra Base64 og Base32 er der også Base16 (hexadecimal), Base58 og Base85, som hver er designet til forskellige scenarier.",
    "tuv23456": "Base64 URL sikker variant",
    "u7vwx8yz": "Almindelige Base64-operationer",
    "uvwxyza1": "Intet datatab: Da det er en reversibel proces, resulterer Base64-kodning ikke i noget tab af information.",
    "vwx1yza2": "Et eksempel er kodning af en billedfil for at indlejre den i et HTML <img>-tag:",
    "wxyzabcd": "Der er en URL-sikker version af Base64, der erstatter '+' med '-' og '/' med '_' og udelader udfyldning af '=', hvilket gør den velegnet til web-URL'er.",
    "zyx98765": "Kan Base64 bruges til komprimering?"
}