{
    "123e4567": "Mi az a Base64?",
    "1a2b3c4d": "Miért használja a Base64-et?",
    "23fgh456": "A Base64 története",
    "2bcde3fg": "A Base64 hátrányai",
    "34wxyz56": "Hogyan lehet kódolni/dekódolni a Base64-et JavaScriptben?",
    "4hijk5lm": "Méretnövekedés: A kódolt adat nagyjából 33%-kal nagyobb, mint az eredeti bináris adat.",
    "5e6f7g8h": "A Base64 akkor használatos, ha a bináris adatokat szövegalapú protokollokon, például e-mailen vagy JSON-on keresztül kell továbbítani, vagy olyan helyekre kell beágyazni, ahol csak szöveg megengedett.",
    "6nopqrst": "Nincs titkosítás: A Base64 nem titkosítási módszer; könnyen dekódolható és nem nyújt biztonságot.",
    "78abcdef": "A JavaScript olyan beépített funkciókat kínál, mint a btoa() és az atob() a Base64 kódolásához és dekódolásához.",
    "78ijk9lm": "A Base64-et először az RFC 1421 (1993), majd az RFC 4648 (2006) szabványosították.",
    "9i0j1k2l": "Kis képek közvetlenül HTML- vagy CSS-be ágyazására is használható adat-URL-ként.",
    "ab9c0d1e": "Az elsődleges műveletek közé tartozik a kódolás (bináris konvertálása Base64-re) és a dekódolás (a Base64 visszaállítása binárissá).",
    "abc12345": "A Base64 egy olyan kódolási séma, amely a bináris adatokat ASCII-karakterek sorozataként jeleníti meg.",
    "abcdef12": "Hogyan működik a Base64?",
    "bcdef01a": "A Base64 úgy működik, hogy a bináris adatokat 6 bites csoportokra osztja, és minden csoportot leképez egy 64 karakteres ábécé egy adott karakterére (A-Za-z0-9+/).",
    "cbaq54321": "Nem, a Base64 nem egy tömörítési technika, csak az adatok megjelenítését változtatja meg, a méretét nem.",
    "cdefg234": "Kitöltő karakterek (=) kerülnek a végére annak biztosítására, hogy a kódolt adathossz 4 karakter többszöröse legyen.",
    "efg45678": "Összehasonlítás a Base32-vel",
    "efghi678": "Ezt a változatot gyakran használják fájlnevekhez, URL-ekhez vagy olyan helyzetekhez, amikor kerülni kell a speciális karaktereket.",
    "fghi6789": "Bináris fájlok szövegalapú formátumban történő továbbítására vagy tárolására szolgál, biztosítva a kompatibilitást a különböző rendszerek között.",
    "hij90klm": "A Base32 kisebb ábécét (A-Z2-7) használ, ami hosszabb, de ember által olvashatóbb karakterláncokat eredményez.",
    "mno34567": "A Base64 előnyei",
    "mnoijklm": "Vannak más BaseXX kódolások?",
    "n0pqrstu": "Példa a Base64 használatára",
    "nopqrs01": "Míg a Base64 a kompaktságra optimalizál, a Base32-t akkor választják, amikor a beviteli hibák minimalizálása, például a kézi bevitel kulcsfontosságú.",
    "pqrs890t": "Univerzális kompatibilitás: A Base64 széles körben elismert és támogatott az összes főbb programozási nyelven.",
    "qrstuvwx": "Igen, a Base64-en és a Base32-n kívül létezik még a Base16 (hexadecimális), a Base58 és a Base85, amelyek mindegyike különböző forgatókönyvekhez készült.",
    "tuv23456": "Base64 URL biztonságos változat",
    "u7vwx8yz": "Common Base64 műveletek",
    "uvwxyza1": "Nincs adatvesztés: Mivel ez egy visszafordítható folyamat, a Base64 kódolás nem okoz információvesztést.",
    "vwx1yza2": "Példa erre egy képfájl kódolása HTML <img> címkébe való beágyazásához:",
    "wxyzabcd": "Létezik a Base64 URL-biztos verziója, amely a „+”-t „-”-ra, a „/”-t pedig „_”-ra cseréli, és kihagyja a „=” kitöltést, így alkalmas webes URL-címekre.",
    "zyx98765": "A Base64 használható tömörítésre?"
}