{
    "123e4567": "Hva er Base64?",
    "1a2b3c4d": "Hvorfor bruke Base64?",
    "23fgh456": "Historien til Base64",
    "2bcde3fg": "Ulemper med Base64",
    "34wxyz56": "Hvordan kode/dekode Base64 i JavaScript?",
    "4hijk5lm": "Størrelsesøkning: Kodede data er omtrent 33 % større enn de originale binære dataene.",
    "5e6f7g8h": "Base64 brukes når binære data må overføres gjennom tekstbaserte protokoller som e-post eller JSON, eller bygges inn på steder der bare tekst er tillatt.",
    "6nopqrst": "Ingen kryptering: Base64 er ikke en krypteringsmetode; det er enkelt å dekode og gir ingen sikkerhet.",
    "78abcdef": "JavaScript tilbyr innebygde funksjoner som btoa() og atob() for henholdsvis Base64-koding og dekoding.",
    "78ijk9lm": "Base64 ble først definert i RFC 1421 (1993) og senere standardisert i RFC 4648 (2006).",
    "9i0j1k2l": "Den brukes også til å bygge inn små bilder direkte i HTML eller CSS som data-URLer.",
    "ab9c0d1e": "De primære operasjonene inkluderer koding (konvertering av binær til Base64) og dekoding (konvertering av Base64 tilbake til binær).",
    "abc12345": "Base64 er et kodingsskjema som representerer binære data som en sekvens av ASCII-tegn.",
    "abcdef12": "Hvordan fungerer Base64?",
    "bcdef01a": "Base64 fungerer ved å dele binære data inn i grupper på 6 biter og kartlegge hver gruppe til et spesifikt tegn fra et alfabet på 64 tegn (A-Za-z0-9+/).",
    "cbaq54321": "Nei, Base64 er ikke en komprimeringsteknikk, den endrer bare representasjonen av data, ikke størrelsen.",
    "cdefg234": "Utfyllingstegn (=) legges til på slutten for å sikre at den kodede datalengden er et multiplum av 4 tegn.",
    "efg45678": "Sammenligning med Base32",
    "efghi678": "Denne varianten brukes ofte for filnavn, URL-er eller situasjoner der spesialtegn må unngås.",
    "fghi6789": "Den brukes til å overføre eller lagre binære filer i tekstbaserte formater, noe som sikrer kompatibilitet på tvers av ulike systemer.",
    "hij90klm": "Base32 bruker et mindre alfabet (A-Z2-7), noe som resulterer i lengre, men mer lesbare strenger.",
    "mno34567": "Fordeler med Base64",
    "mnoijklm": "Finnes det andre BaseXX-kodinger?",
    "n0pqrstu": "Eksempel på bruk av Base64",
    "nopqrs01": "Mens Base64 optimerer for kompakthet, velges Base32 når minimering av inndatafeil, som manuell inntasting, er avgjørende.",
    "pqrs890t": "Universell kompatibilitet: Base64 er allment anerkjent og støttet i alle store programmeringsspråk.",
    "qrstuvwx": "Ja, bortsett fra Base64 og Base32, er det også Base16 (heksadesimal), Base58 og Base85, hver designet for forskjellige scenarier.",
    "tuv23456": "Base64 URL sikker variant",
    "u7vwx8yz": "Vanlige Base64-operasjoner",
    "uvwxyza1": "Ingen datatap: Siden det er en reversibel prosess, resulterer ikke Base64-koding i tap av informasjon.",
    "vwx1yza2": "Et eksempel er å kode en bildefil for å bygge den inn i en HTML-kode <img>:",
    "wxyzabcd": "Det er en URL-sikker versjon av Base64 som erstatter '+' med '-' og '/' med '_', og utelater utfylling av '=', noe som gjør den egnet for nettadresser.",
    "zyx98765": "Kan Base64 brukes til komprimering?"
}