{
    "MySQL-Performance-Tuning": "Conseils d'optimisation des performances MySQL",
    "OWASP-SQL-Injection": "Guide d'injection SQL OWASP",
    "SQL-Basics-001": "Qu’est-ce que SQL ?",
    "SQL-Beautifier-Example": "Formateur SQL en ligne",
    "SQL-Beautify-006": "Qu’est-ce que l’embellissement SQL ?",
    "SQL-Beautify-Def-007": "L'embellissement SQL est le processus de formatage du code SQL pour améliorer la lisibilité en appliquant des conventions cohérentes d'indentation, d'espacement et de casse.",
    "SQL-Beautify-Purpose-008": "Tout comme les embellisseurs de code génériques, il aide les développeurs à comprendre plus facilement les requêtes complexes et à maintenir la cohérence entre leurs scripts ou projets SQL.",
    "SQL-Commands-005": "SQL comprend plusieurs types de commandes : DDL (Data Definition Language - CREATE, ALTER, DROP), DML (Data Manipulation Language - SELECT, INSERT, UPDATE, DELETE) et DCL (Data Control Language - GRANT, REVOKE).",
    "SQL-Components-004": "Quels sont les principaux composants de SQL ?",
    "SQL-Components-Wikipedia": "Composants SQL sur Wikipédia",
    "SQL-Def-002": "SQL (Structured Query Language) est un langage de programmation standard permettant de gérer et d'interroger des bases de données relationnelles.",
    "SQL-Indexing-016": "Que sont les index dans SQL et pourquoi sont-ils importants ?",
    "SQL-Indexing-Benefit-018": "La création d'un index sur les colonnes fréquemment utilisées pour les conditions de la clause WHERE accélère considérablement les requêtes SELECT mais peut ralentir les opérations INSERT, UPDATE et DELETE en raison de la nécessité de conserver la structure de l'index.",
    "SQL-Indexing-Explanation-017": "Les index sont des structures de données (par exemple, des arbres B) qui améliorent la vitesse des opérations de récupération de données dans une table en permettant au moteur de base de données de localiser rapidement les lignes en fonction de valeurs de colonne spécifiques.",
    "SQL-Indexing-MDN": "Documents Web MDN sur les index",
    "SQL-Injection-019": "Qu’est-ce que l’injection SQL et comment peut-elle être évitée ?",
    "SQL-Injection-Def-020": "SQL Injection est une vulnérabilité de sécurité dans laquelle un attaquant peut insérer du code SQL malveillant dans des champs de saisie pour manipuler ou extraire des données d'une base de données.",
    "SQL-Injection-Prevention-021": "Les méthodes de prévention incluent l'utilisation de requêtes paramétrées, d'instructions préparées ou de bibliothèques ORM qui échappent automatiquement aux entrées de l'utilisateur, ainsi que la limitation des autorisations de base de données et l'application des principes du moindre privilège.",
    "SQL-Joins-011": "Que sont les JOIN en SQL ?",
    "SQL-Joins-Explanation-012": "Les JOIN sont utilisés pour combiner des lignes de deux ou plusieurs tables en fonction d'une colonne liée entre elles. Par exemple, INNER JOIN, LEFT JOIN, RIGHT JOIN et FULL JOIN.",
    "SQL-Joins-Tutorial": "Didacticiel sur les jointures SQL",
    "SQL-Perf-Tuning-Methods-024": "D'autres techniques incluent le partitionnement de grandes tables, l'utilisation de types de données appropriés et la mise en cache des résultats lorsque cela est possible.",
    "SQL-Perf-Tuning-Overview-023": "L'optimisation des performances des requêtes SQL implique d'analyser les plans d'exécution, d'indexer de manière appropriée, de minimiser les jointures et sous-requêtes inutiles et d'écrire des clauses WHERE efficaces.",
    "SQL-Performance-Tuning-022": "Comment optimiser les performances des requêtes SQL ?",
    "SQL-Purpose-003": "Il est utilisé pour créer, lire, mettre à jour, supprimer et interroger des données dans des tables, ainsi que pour gérer la structure et les autorisations de la base de données.",
    "SQL-Select-009": "Comment écrire une instruction SELECT de base ?",
    "SQL-Select-Example-0210": "Une simple instruction SELECT récupère les données d'une table. Par exemple : {0}', 'SELECT colonne1, colonne2 FROM ma_table ;",
    "SQL-Transactions-013": "Que sont les transactions en SQL ?",
    "SQL-Transactions-Def-014": "Une transaction est une unité de travail logique qui contient une ou plusieurs instructions SQL. Il garantit que toutes les opérations qu'il contient sont terminées avec succès (atomicité), isolées des autres transactions et durables même en cas de panne du système.",
    "SQL-Transactions-Example-015": "Pour démarrer une transaction, utilisez la commande START TRANSACTION ; validez les modifications avec COMMIT ou revenez à l’état précédent avec ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transactions SQL sur W3Schools"
}