{
    "MySQL-Performance-Tuning": "Wskazówki dotyczące dostrajania wydajności MySQL",
    "OWASP-SQL-Injection": "Przewodnik po wstrzykiwaniu SQL OWASP",
    "SQL-Basics-001": "Co to jest SQL?",
    "SQL-Beautifier-Example": "Internetowy formater SQL",
    "SQL-Beautify-006": "Co to jest upiększanie SQL?",
    "SQL-Beautify-Def-007": "Upiększanie SQL to proces formatowania kodu SQL w celu poprawy czytelności poprzez zastosowanie spójnych konwencji wcięć, odstępów i wielkości liter.",
    "SQL-Beautify-Purpose-008": "Podobnie jak ogólne upiększacze kodu, pomaga programistom łatwiej zrozumieć złożone zapytania i zachować spójność między skryptami lub projektami SQL.",
    "SQL-Commands-005": "SQL zawiera kilka typów poleceń: DDL (język definicji danych - CREATE, ALTER, DROP), DML (język manipulacji danymi - SELECT, INSERT, UPDATE, DELETE) i DCL (język kontroli danych - GRANT, REVOKE).",
    "SQL-Components-004": "Jakie są główne komponenty SQL?",
    "SQL-Components-Wikipedia": "Komponenty SQL w Wikipedii",
    "SQL-Def-002": "SQL (Structured Query Language) to standardowy język programowania służący do zarządzania relacyjnymi bazami danych i wykonywania zapytań.",
    "SQL-Indexing-016": "Czym są indeksy w SQL i dlaczego są ważne?",
    "SQL-Indexing-Benefit-018": "Utworzenie indeksu dla często używanych kolumn dla warunków klauzuli WHERE znacznie przyspiesza zapytania SELECT, ale może spowolnić operacje INSERT, UPDATE i DELETE ze względu na konieczność zachowania struktury indeksu.",
    "SQL-Indexing-Explanation-017": "Indeksy to struktury danych (np. drzewa B), które zwiększają szybkość operacji wyszukiwania danych w tabeli, umożliwiając silnikowi bazy danych szybkie lokalizowanie wierszy na podstawie określonych wartości kolumn.",
    "SQL-Indexing-MDN": "Dokumenty internetowe MDN dotyczące indeksów",
    "SQL-Injection-019": "Co to jest wstrzykiwanie SQL i jak można temu zapobiec?",
    "SQL-Injection-Def-020": "Wstrzykiwanie SQL to luka w zabezpieczeniach, w wyniku której osoba atakująca może wstawić złośliwy kod SQL do pól wejściowych w celu manipulowania danymi lub wyodrębnienia danych z bazy danych.",
    "SQL-Injection-Prevention-021": "Metody zapobiegania obejmują używanie sparametryzowanych zapytań, przygotowanych instrukcji lub bibliotek ORM, które automatycznie wymykają się wprowadzaniu danych przez użytkownika, a także ograniczanie uprawnień do baz danych i stosowanie zasad najmniejszych uprawnień.",
    "SQL-Joins-011": "Co to są JOIN w SQL?",
    "SQL-Joins-Explanation-012": "JOIN służy do łączenia wierszy z dwóch lub więcej tabel w oparciu o powiązaną kolumnę między nimi. Np. POŁĄCZENIE WEWNĘTRZNE, POŁĄCZENIE LEWE, POŁĄCZENIE PRAWYM i POŁĄCZENIE PEŁNE.",
    "SQL-Joins-Tutorial": "Samouczek dotyczący łączenia SQL",
    "SQL-Perf-Tuning-Methods-024": "Inne techniki obejmują partycjonowanie dużych tabel, używanie odpowiednich typów danych i buforowanie wyników, jeśli jest to możliwe.",
    "SQL-Perf-Tuning-Overview-023": "Optymalizacja wydajności zapytań SQL obejmuje analizę planów wykonania, odpowiednie indeksowanie, minimalizację niepotrzebnych złączeń i podzapytań oraz pisanie wydajnych klauzul WHERE.",
    "SQL-Performance-Tuning-022": "Jak zoptymalizować wydajność zapytań SQL?",
    "SQL-Purpose-003": "Służy do tworzenia, odczytywania, aktualizowania, usuwania i wykonywania zapytań o dane w tabelach, a także do zarządzania strukturą bazy danych i uprawnieniami.",
    "SQL-Select-009": "Jak napisać podstawową instrukcję SELECT?",
    "SQL-Select-Example-0210": "Prosta instrukcja SELECT pobiera dane z tabeli. Na przykład: {0}', 'WYBIERZ kolumnę1, kolumnę2 Z moja_tabela;",
    "SQL-Transactions-013": "Czym są transakcje w SQL?",
    "SQL-Transactions-Def-014": "Transakcja to logiczna jednostka pracy zawierająca jedną lub więcej instrukcji SQL. Zapewnia, że ​​wszystkie operacje w jego obrębie zostaną zakończone pomyślnie (atomowość), odizolowane od innych transakcji i trwałe nawet w przypadku awarii systemu.",
    "SQL-Transactions-Example-015": "Aby rozpocząć transakcję użyj komendy ROZPOCZNIJ TRANSAKCJĘ; zatwierdź zmiany za pomocą COMMIT lub przywróć poprzedni stan za pomocą ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transakcje SQL w W3Schools"
}