{
    "CSS-Advantages-010": "Mitä etuja CSS:n käytöstä on?",
    "CSS-Advantages-Customization-012": "Toinen etu on sen kyky mukauttaa useiden sivujen ulkoasua ja tuntumaa kerralla, mikä säästää aikaa ja vaivaa päivitettäessä koko sivuston laajuisia tyylejä.",
    "CSS-Advantages-Separation-011": "Yksi etu on sisällön ja esityksen erotteleminen, mikä parantaa verkkosivustojen ylläpidettävyyttä ja skaalautuvuutta.",
    "CSS-Animations-Transitions-019": "CSS-animaatiot ja siirtymät mahdollistavat sujuvat visuaaliset tehosteet ilman JavaScriptiä.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) on tyylitaulukkokieli, jota käytetään kuvaamaan HTML- tai XML-muodossa kirjoitetun asiakirjan esitystapaa.",
    "CSS-Disadvantages-013": "Mitä haittoja CSS:llä on?",
    "CSS-Disadvantages-Browser-Compat-015": "Toinen ongelma on selainten välinen yhteensopivuus, koska eri selaimet voivat tulkita CSS-sääntöjä eri tavalla. Tämä edellyttää, että kehittäjät käyttävät toimittajan etuliitteitä tai ominaisuuksien tunnistustekniikoita yhdenmukaisen renderöinnin varmistamiseksi kaikissa selaimissa.",
    "CSS-Disadvantages-Cascade-014": "Yksi haaste on tyylien peräkkäisen luonteen hallinta, mikä voi joskus johtaa odottamattomiin perinnöllisiin ja spesifisyysongelmiin.",
    "CSS-Evolution-006": "Siitä lähtien se on kehittynyt CSS2:n (1998), CSS2.1:n (2007), CSS3:n (ja käynnissä) kautta, ja se on tuonut mukanaan ominaisuuksia, kuten valitsimia, animaatioita, reagoivaa suunnittelua ja paljon muuta.",
    "CSS-Future-020": "Mikä on CSS-tekniikan tulevaisuus?",
    "CSS-Future-Houdini-022": "Esimerkiksi Houdini pyrkii tarjoamaan matalan tason sovellusliittymiä selaimen renderöintiprosessin mukauttamiseen, mikä antaa kehittäjille mahdollisuuden hallita tyyliä ja asettelua ennennäkemättömällä tavalla.",
    "CSS-Future-Progress-021": "CSS-työryhmä jatkaa työskentelyä uusien moduulien, kuten CSS-muuttujien (Custom Properties), Houdini- ja Container Queries -moduulien parissa.",
    "CSS-Hist-Origin-005": "Håkon Wium Lie ehdotti CSS:ää ensimmäisen kerran lokakuussa 1994, ja siitä tuli virallinen W3C-suositus joulukuussa 1996 CSS1:n kanssa.",
    "CSS-History-004": "Mikä on CSS:n historia?",
    "CSS-History-W3C": "W3C CSS:n suositusten aikajana",
    "CSS-Key-Features-016": "Mitkä ovat CSS:n tärkeimmät ominaisuudet?",
    "CSS-Layouts-018": "Flexbox- ja Grid-asettelujärjestelmät tarjoavat tehokkaita työkaluja reagoivien ja joustavien sivuasettelujen luomiseen.",
    "CSS-MDN-Animations": "MDN-opas CSS-animaatioihin",
    "CSS-MDN-Flexbox": "MDN-opas Flexboxiin",
    "CSS-MDN-Grid": "MDN-opas CSS Gridiin",
    "CSS-MDN-Houdini": "MDN:n johdatus Houdiniin",
    "CSS-Purpose-003": "Sen avulla kehittäjät voivat erottaa sisällön esityksestä määrittämällä tyylit, kuten asettelun, värit ja fontit, mikä tekee verkkosivuista visuaalisesti houkuttelevia ja yhdenmukaisia ​​eri laitteilla ja näytöillä.",
    "CSS-Selectors-017": "Valitsimet mahdollistavat kohdistamisen tiettyihin HTML-elementteihin niiden tyypin, luokan, tunnuksen, attribuuttien ja muiden perusteella.",
    "CSS-Tech-History-001": "Mikä on CSS?",
    "CSS-Usage-007": "Kuinka käytän CSS:ää verkkoprojekteissani?",
    "CSS-Usage-Basics-008": "Käyttääksesi CSS:ää luot erillisen tiedoston (esim. style.css), joka sisältää tyylisi, ja linkitä se sitten HTML-tiedostoosi käyttämällä <link>-elementtiä <head>-osiossa.",
    "CSS-Usage-Inline-009": "Vaihtoehtoisesti voit sisällyttää upotettuja tyylejä suoraan HTML-elementteihin käyttämällä style-attribuuttia tai upottaa CSS:n <style>-tunnisteeseen <head>-osion sisällä.",
    "CSS-Vendor-Prefixes": "MDN-opas toimittajan etuliitteistä",
    "CSS-W3C-Selectors": "W3C-valitsimet Taso 4 Spec",
    "CSS-WG-Future-Modules": "W3C CSS Nykyinen työ"
}