{
    "MySQL-Performance-Tuning": "MySQL:n suorituskyvyn viritysvinkkejä",
    "OWASP-SQL-Injection": "OWASP SQL Injection Guide",
    "SQL-Basics-001": "Mikä on SQL?",
    "SQL-Beautifier-Example": "Online SQL Formatter",
    "SQL-Beautify-006": "Mikä on SQL Beautification?",
    "SQL-Beautify-Def-007": "SQL:n kaunistaminen on prosessi, jossa muotoillaan SQL-koodia luettavuuden parantamiseksi käyttämällä johdonmukaisia ​​sisennysten, välilyöntien ja kirjainkoot.",
    "SQL-Beautify-Purpose-008": "Aivan kuten yleiset koodin kaunistajat, se auttaa kehittäjiä ymmärtämään monimutkaisia ​​kyselyitä helpommin ja ylläpitämään johdonmukaisuutta SQL-skriptien tai -projektien välillä.",
    "SQL-Commands-005": "SQL sisältää useita komentotyyppejä: DDL (Data Definition Language - CREATE, ALTER, DROP), DML (Data Manipulation Language - SELECT, INSERT, UPDATE, DELETE) ja DCL (Data Control Language - GRANT, REVOKE).",
    "SQL-Components-004": "Mitkä ovat SQL:n pääkomponentit?",
    "SQL-Components-Wikipedia": "SQL-komponentit Wikipediassa",
    "SQL-Def-002": "SQL (Structured Query Language) on vakioohjelmointikieli relaatiotietokantojen hallintaan ja kyselyihin.",
    "SQL-Indexing-016": "Mitä indeksit ovat SQL:ssä ja miksi ne ovat tärkeitä?",
    "SQL-Indexing-Benefit-018": "Indeksin luominen usein käytetyille sarakkeille WHERE-lauseehdoille nopeuttaa merkittävästi SELECT-kyselyitä, mutta voi hidastaa INSERT-, UPDATE- ja DELETE-toimintoja, koska indeksirakennetta on ylläpidettävä.",
    "SQL-Indexing-Explanation-017": "Indeksit ovat tietorakenteita (esim. B-puita), jotka parantavat tietojen hakutoimintojen nopeutta taulukossa sallimalla tietokantakoneen paikantaa rivejä nopeasti tiettyjen sarakearvojen perusteella.",
    "SQL-Indexing-MDN": "MDN Web Docs hakemistoissa",
    "SQL-Injection-019": "Mikä on SQL-injektio ja miten se voidaan estää?",
    "SQL-Injection-Def-020": "SQL Injection on tietoturvahaavoittuvuus, jossa hyökkääjä voi lisätä haitallista SQL-koodia syöttökenttiin manipuloidakseen tai poimiakseen tietoja tietokannasta.",
    "SQL-Injection-Prevention-021": "Ehkäisymenetelmiin kuuluu parametroitujen kyselyjen, valmisteltujen lausekkeiden tai ORM-kirjastojen käyttäminen, jotka pakenevat automaattisesti käyttäjän syötteitä, sekä tietokannan käyttöoikeuksien rajoittaminen ja vähiten etuoikeuksien periaatteiden soveltaminen.",
    "SQL-Joins-011": "Mitä ovat JOIN:t SQL:ssä?",
    "SQL-Joins-Explanation-012": "JOIN-koodeja käytetään yhdistämään rivejä kahdesta tai useammasta taulukosta niiden välisen toisiinsa liittyvän sarakkeen perusteella. Esim. SISÄLIITTYMINEN, VASEMMALLE LIITTYMINEN, OIKEA LIITTYMINEN ja TÄYSI LIITTYMINEN.",
    "SQL-Joins-Tutorial": "SQL-liittymien opetusohjelma",
    "SQL-Perf-Tuning-Methods-024": "Muita tekniikoita ovat suurten taulukoiden osiointi, asianmukaisten tietotyyppien käyttö ja tulosten välimuisti, kun se on mahdollista.",
    "SQL-Perf-Tuning-Overview-023": "SQL-kyselyn suorituskyvyn optimointi sisältää suoritussuunnitelmien analysoinnin, asianmukaisen indeksoinnin, tarpeettomien liitosten ja alikyselyjen minimoimisen sekä tehokkaiden WHERE-lausekkeiden kirjoittamisen.",
    "SQL-Performance-Tuning-022": "Kuinka optimoin SQL-kyselyn suorituskyvyn?",
    "SQL-Purpose-003": "Sitä käytetään taulukoiden tietojen luomiseen, lukemiseen, päivittämiseen, poistamiseen ja kyselyihin sekä tietokantarakenteen ja käyttöoikeuksien hallintaan.",
    "SQL-Select-009": "Kuinka kirjoitan perus SELECT-käskyn?",
    "SQL-Select-Example-0210": "Yksinkertainen SELECT-käsky hakee tiedot taulukosta. Esimerkiksi: {0}', 'SELECT sarake1, sarake2 FROM omasta_taulukosta;",
    "SQL-Transactions-013": "Mitä ovat transaktiot SQL:ssä?",
    "SQL-Transactions-Def-014": "Tapahtuma on looginen työyksikkö, joka sisältää yhden tai useamman SQL-käskyn. Se varmistaa, että kaikki sen sisällä olevat toiminnot suoritetaan onnistuneesti (atomicity), erillään muista tapahtumista ja kestävät jopa järjestelmävian sattuessa.",
    "SQL-Transactions-Example-015": "Aloita tapahtuma käyttämällä START TRANSACTION -komentoa; vahvista muutokset komennolla COMMIT tai palauta edelliseen tilaan ROLLBACK-toiminnolla.",
    "SQL-Transactions-W3Schools": "SQL-tapahtumat W3Schoolsissa"
}