{
    "MySQL-Performance-Tuning": "MySQL teljesítményhangolási tippek",
    "OWASP-SQL-Injection": "OWASP SQL Injection Guide",
    "SQL-Basics-001": "Mi az SQL?",
    "SQL-Beautifier-Example": "Online SQL formázó",
    "SQL-Beautify-006": "Mi az SQL Beautification?",
    "SQL-Beautify-Def-007": "Az SQL-szépítés az SQL-kód formázásának folyamata az olvashatóság javítása érdekében, következetes behúzás-, térköz- és kis- és nagybetű-konvenciók alkalmazásával.",
    "SQL-Beautify-Purpose-008": "Csakúgy, mint az általános kódszépítők, ez is segít a fejlesztőknek az összetett lekérdezések könnyebb megértésében és az SQL-szkriptek vagy projektek közötti konzisztencia fenntartásában.",
    "SQL-Commands-005": "Az SQL többféle parancsot tartalmaz: DDL (adatmeghatározási nyelv - CREATE, ALTER, DROP), DML (adatkezelési nyelv - SELECT, INSERT, UPDATE, DELETE) és DCL (adatvezérlő nyelv - GRANT, REVOKE).",
    "SQL-Components-004": "Melyek az SQL fő összetevői?",
    "SQL-Components-Wikipedia": "SQL-összetevők a Wikipédián",
    "SQL-Def-002": "Az SQL (Structured Query Language) egy szabványos programozási nyelv relációs adatbázisok kezelésére és lekérdezésére.",
    "SQL-Indexing-016": "Mik azok az indexek az SQL-ben, és miért fontosak?",
    "SQL-Indexing-Benefit-018": "Ha a WHERE záradékfeltételekhez gyakran használt oszlopokon indexet hoz létre, az jelentősen felgyorsítja a SELECT lekérdezéseket, de lelassíthatja az INSERT, UPDATE és DELETE műveleteket az indexstruktúra karbantartásának szükségessége miatt.",
    "SQL-Indexing-Explanation-017": "Az indexek olyan adatstruktúrák (például B-fák), amelyek javítják az adatlekérési műveletek sebességét egy táblában azáltal, hogy lehetővé teszik az adatbázismotor számára, hogy gyorsan megtalálja a sorokat meghatározott oszlopértékek alapján.",
    "SQL-Indexing-MDN": "MDN webdokumentumok az indexeken",
    "SQL-Injection-019": "Mi az SQL Injection és hogyan előzhető meg?",
    "SQL-Injection-Def-020": "Az SQL Injection egy biztonsági rés, ahol a támadó rosszindulatú SQL-kódot szúrhat be a beviteli mezőkbe, hogy adatokat manipuláljon vagy kinyerjen az adatbázisból.",
    "SQL-Injection-Prevention-021": "A megelőzési módszerek közé tartozik a paraméterezett lekérdezések, előkészített utasítások vagy ORM-könyvtárak használata, amelyek automatikusan elkerülik a felhasználói bevitelt, valamint az adatbázis-engedélyek korlátozása és a legkisebb jogosultság elveinek alkalmazása.",
    "SQL-Joins-011": "Mik azok a JOIN-ok az SQL-ben?",
    "SQL-Joins-Explanation-012": "A JOIN-ok két vagy több tábla sorainak egyesítésére szolgálnak a közöttük lévő kapcsolódó oszlopok alapján. Pl. BELSŐ CSATLAKOZÁS, BAL CSATLAKOZÁS, JOBB CSATLAKOZÁS és TELJES CSATLAKOZÁS.",
    "SQL-Joins-Tutorial": "SQL csatlakozási útmutató",
    "SQL-Perf-Tuning-Methods-024": "Más technikák közé tartozik a nagy táblák particionálása, a megfelelő adattípusok használata és az eredmények gyorsítótárazása, ha lehetséges.",
    "SQL-Perf-Tuning-Overview-023": "Az SQL-lekérdezések teljesítményének optimalizálása magában foglalja a végrehajtási tervek elemzését, a megfelelő indexelést, a szükségtelen csatlakozások és részlekérdezések minimalizálását, valamint hatékony WHERE záradékok írását.",
    "SQL-Performance-Tuning-022": "Hogyan optimalizálhatom az SQL lekérdezés teljesítményét?",
    "SQL-Purpose-003": "A táblázatokban lévő adatok létrehozására, olvasására, frissítésére, törlésére és lekérdezésére, valamint az adatbázis-struktúra és az engedélyek kezelésére szolgál.",
    "SQL-Select-009": "Hogyan írhatok egy alapvető SELECT utasítást?",
    "SQL-Select-Example-0210": "Egy egyszerű SELECT utasítás adatokat kér le egy táblából. Például: {0}', 'SELECT oszlop1, oszlop 2 FROM my_table;",
    "SQL-Transactions-013": "Mik azok a tranzakciók az SQL-ben?",
    "SQL-Transactions-Def-014": "A tranzakció egy logikai munkaegység, amely egy vagy több SQL utasítást tartalmaz. Gondoskodik arról, hogy a benne lévő összes művelet sikeresen befejeződjön (atomitás), elkülönüljön a többi tranzakciótól, és rendszerhiba esetén is tartós legyen.",
    "SQL-Transactions-Example-015": "Tranzakció indításához használja a TRANSACTION INDÍTÁSA parancsot; a változtatások véglegesítése a COMMIT gombbal, vagy visszaállítás az előző állapotba a ROLLBACK funkcióval.",
    "SQL-Transactions-W3Schools": "SQL-tranzakciók a W3Schools-on"
}