{
    "MySQL-Performance-Tuning": "เคล็ดลับการปรับแต่งประสิทธิภาพ MySQL",
    "OWASP-SQL-Injection": "คู่มือการแทรก OWASP SQL",
    "SQL-Basics-001": "SQL คืออะไร?",
    "SQL-Beautifier-Example": "ตัวจัดรูปแบบ SQL ออนไลน์",
    "SQL-Beautify-006": "SQL Beautification คืออะไร",
    "SQL-Beautify-Def-007": "การทำให้สวยงามของ SQL เป็นกระบวนการของการจัดรูปแบบโค้ด SQL เพื่อปรับปรุงความสามารถในการอ่านโดยใช้การเยื้อง ระยะห่าง และแบบแผนตัวพิมพ์ที่สอดคล้องกัน",
    "SQL-Beautify-Purpose-008": "เช่นเดียวกับเครื่องมือตกแต่งโค้ดทั่วไป ช่วยให้นักพัฒนาเข้าใจการสืบค้นที่ซับซ้อนได้ง่ายขึ้น และรักษาความสอดคล้องกันในสคริปต์หรือโปรเจ็กต์ SQL ของตน",
    "SQL-Commands-005": "SQL มีคำสั่งหลายประเภท: DDL (ภาษาคำจำกัดความข้อมูล - CREATE, ALTER, DROP), DML (ภาษาการจัดการข้อมูล - SELECT, INSERT, UPDATE, DELETE) และ DCL (ภาษาควบคุมข้อมูล - GRANT, REVOKE)",
    "SQL-Components-004": "องค์ประกอบหลักของ SQL คืออะไร?",
    "SQL-Components-Wikipedia": "ส่วนประกอบ SQL บนวิกิพีเดีย",
    "SQL-Def-002": "SQL (Structured Query Language) เป็นภาษาโปรแกรมมาตรฐานสำหรับการจัดการและการสืบค้นฐานข้อมูลเชิงสัมพันธ์",
    "SQL-Indexing-016": "ดัชนีใน SQL คืออะไรและเหตุใดจึงมีความสำคัญ",
    "SQL-Indexing-Benefit-018": "การสร้างดัชนีบนคอลัมน์ที่ใช้บ่อยสำหรับเงื่อนไขคำสั่งย่อย WHERE จะช่วยเร่งความเร็วในการสืบค้น SELECT ได้อย่างมาก แต่อาจทำให้การดำเนินการ INSERT, UPDATE และ DELETE ช้าลงได้ เนื่องจากจำเป็นต้องรักษาโครงสร้างดัชนีไว้",
    "SQL-Indexing-Explanation-017": "ดัชนีคือโครงสร้างข้อมูล (เช่น B-tree) ที่ปรับปรุงความเร็วของการดำเนินการดึงข้อมูลในตารางโดยอนุญาตให้กลไกฐานข้อมูลค้นหาแถวได้อย่างรวดเร็วตามค่าคอลัมน์ที่ระบุ",
    "SQL-Indexing-MDN": "MDN Web Docs เกี่ยวกับดัชนี",
    "SQL-Injection-019": "SQL Injection คืออะไร และจะป้องกันได้อย่างไร?",
    "SQL-Injection-Def-020": "SQL Injection เป็นช่องโหว่ด้านความปลอดภัยที่ผู้โจมตีสามารถแทรกโค้ด SQL ที่เป็นอันตรายลงในช่องป้อนข้อมูลเพื่อจัดการหรือดึงข้อมูลจากฐานข้อมูล",
    "SQL-Injection-Prevention-021": "วิธีการป้องกันประกอบด้วยการใช้การสืบค้นแบบกำหนดพารามิเตอร์ คำสั่งที่เตรียมไว้ หรือไลบรารี ORM ที่หลีกเลี่ยงอินพุตของผู้ใช้โดยอัตโนมัติ รวมถึงการจำกัดสิทธิ์ของฐานข้อมูลและใช้หลักการสิทธิ์ขั้นต่ำสุด",
    "SQL-Joins-011": "JOIN ใน SQL คืออะไร",
    "SQL-Joins-Explanation-012": "JOIN ใช้เพื่อรวมแถวจากสองตารางขึ้นไปโดยยึดตามคอลัมน์ที่เกี่ยวข้องระหว่างตารางเหล่านั้น เช่น INNER JOIN, LEFT JOIN, RIGHT JOIN และ FULL JOIN",
    "SQL-Joins-Tutorial": "SQL เข้าร่วมการสอน",
    "SQL-Perf-Tuning-Methods-024": "เทคนิคอื่นๆ ได้แก่ การแบ่งพาร์ติชันตารางขนาดใหญ่ การใช้ประเภทข้อมูลที่เหมาะสม และผลลัพธ์แคชเมื่อเป็นไปได้",
    "SQL-Perf-Tuning-Overview-023": "การปรับประสิทธิภาพคิวรี SQL ให้เหมาะสมเกี่ยวข้องกับการวิเคราะห์แผนการดำเนินการ การสร้างดัชนีอย่างเหมาะสม การลดการรวมและคิวรีย่อยที่ไม่จำเป็น และการเขียนส่วนคำสั่ง WHERE ที่มีประสิทธิภาพ",
    "SQL-Performance-Tuning-022": "ฉันจะปรับประสิทธิภาพการสืบค้น SQL ให้เหมาะสมได้อย่างไร",
    "SQL-Purpose-003": "ใช้เพื่อสร้าง อ่าน อัปเดต ลบ และสืบค้นข้อมูลในตาราง รวมถึงจัดการโครงสร้างฐานข้อมูลและการอนุญาต",
    "SQL-Select-009": "ฉันจะเขียนคำสั่ง SELECT พื้นฐานได้อย่างไร",
    "SQL-Select-Example-0210": "คำสั่ง SELECT แบบง่ายจะดึงข้อมูลจากตาราง ตัวอย่างเช่น: {0}', 'เลือก column1, column2 จาก my_table;",
    "SQL-Transactions-013": "ธุรกรรมใน SQL คืออะไร?",
    "SQL-Transactions-Def-014": "ธุรกรรมเป็นหน่วยลอจิคัลของงานที่มีคำสั่ง SQL ตั้งแต่หนึ่งคำสั่งขึ้นไป ช่วยให้มั่นใจได้ว่าการดำเนินงานทั้งหมดภายในระบบจะเสร็จสมบูรณ์ได้สำเร็จ (ความเป็นอะตอมมิก) แยกออกจากธุรกรรมอื่นๆ และมีความคงทนแม้ในกรณีที่ระบบล้มเหลว",
    "SQL-Transactions-Example-015": "ในการเริ่มต้นการทำธุรกรรมให้ใช้คำสั่ง START TRANSACTION ยอมรับการเปลี่ยนแปลงด้วย COMMIT หรือย้อนกลับไปยังสถานะก่อนหน้าด้วย ROLLBACK",
    "SQL-Transactions-W3Schools": "ธุรกรรม SQL บน W3Schools"
}