{
    "JSON-Advantages-011": "JSON je obecně menší a rychleji se analyzuje než XML, takže je ideální pro komunikaci klient-server, kde je rozhodující šířka pásma a rychlost.",
    "JSON-Basics-001": "Co je JSON?",
    "JSON-Beautify-007": "Co je zkrášlování JSON?",
    "JSON-Beautify-Def-008": "Zkrášlení JSON se týká procesu formátování dat JSON do podoby lépe čitelné pro člověka se správným odsazením a zalomením řádků, což usnadňuje analýzu a ladění.",
    "JSON-Beautify-Example-009": "Před: '{\\\"klíč\\\":\\\"hodnota\\\",\\\"pole\\\":[1,2,3]}', za: '{\\n \\\"klíč\\\": \\\"hodnota\\\", \\n \\\"pole\\\": [\\n 1,\\n 2,\\n 3\\n ]\\n}'",
    "JSON-Def-002": "JSON (JavaScript Object Notation) je odlehčený textový formát pro výměnu dat, který lidé snadno čte a zapisují a stroje jej snadno analyzují a generují.",
    "JSON-JavaScript-Support-020": "JSON je nativně podporován JavaScriptem prostřednictvím globálních objektů `JSON.parse()` a `JSON.stringify()`. Jakýkoli platný JSON je také platným objektem nebo polem JavaScriptu, což umožňuje bezproblémovou konverzi mezi těmito dvěma formáty.",
    "JSON-JavaScript-Usage-021": "Při vývoji webu se JSON běžně používá pro požadavky AJAX, vykreslování na straně serveru a ukládání dat (např. místní úložiště nebo IndexedDB).",
    "JSON-Linting-022": "Co je to JSON linting a proč je důležité?",
    "JSON-Linting-Benefit-024": "Linters mohou zabránit chybám za běhu kvůli neplatnému JSON, zajistit hladkou výměnu dat a ušetřit čas při ladění potenciálních problémů.",
    "JSON-Linting-Explanation-023": "Linting JSON je proces kontroly, zda dokument JSON dodržuje specifikaci JSON. Pomáhá identifikovat chyby syntaxe před pokusem o analýzu dat.",
    "JSON-Path-013": "Co je cesta JSON?",
    "JSON-Path-Example-015": "$.store.book[0].title vybere název první knihy v objektu JSON s obchodem, který obsahuje pole knih.",
    "JSON-Path-Explanation-014": "JSON Path je dotazovací jazyk podobný XPath pro XML, který vám umožňuje extrahovat data z dokumentů JSON pomocí notace podobné cestě.",
    "JSON-Path-Guide": "JSONPath – XPath pro JSON",
    "JSON-Purpose-003": "Primárně se používá k přenosu dat mezi serverem a webovou aplikací jako alternativa k XML, s nativní podporou v JavaScriptu prostřednictvím metod `JSON.parse()` a `JSON.stringify()`.",
    "JSON-Scope-in-JavaScript-019": "Jak JSON zapadá do JavaScriptu?",
    "JSON-Security-025": "Jaké jsou některé bezpečnostní problémy při práci s JSON?",
    "JSON-Security-Impact-026": "Potenciální bezpečnostní rizika zahrnují útoky JSON injection, kdy jsou odesílána škodlivá data, která by při analýze/spouštění mohla způsobit nezamýšlené chování.",
    "JSON-Security-Prevention-027": "Ke zmírnění těchto rizik vždy dezinfikujte uživatelský vstup a používejte knihovny, které bezpečně analyzují JSON, aniž by spouštěly jeho obsah (jako je vestavěná JSON.parse() v JavaScriptu). Také se vyhněte použití eval() pro analýzu JSON.",
    "JSON-Serialization-016": "Co je serializace a deserializace JSON?",
    "JSON-Serialization-Def-017": "Serializace JSON je proces převodu objektu JavaScriptu na řetězec JSON, zatímco deseralizace je opačný – přeměna řetězce JSON zpět na objekt JavaScriptu.",
    "JSON-Serialization-W3Schools": "Serializace JSON na W3Schools",
    "JSON-Syntax-004": "Jaká je základní syntaxe JSON?",
    "JSON-Syntax-Example-f005": "Objekt JSON se skládá z párů klíč–hodnota uzavřených ve složených závorkách {0}. Každý klíč musí být řetězec uzavřený do dvojitých uvozovek, za ním následuje dvojtečka a poté jeho hodnota.",
    "JSON-Syntax-Reference": "Webové dokumenty MDN na JSON",
    "JSON-Value-Types-006": "Hodnoty mohou být řetězce, čísla, booleovské hodnoty, pole (uzavřené v hranatých závorkách",
    "JSON-vs-XML-010": "Jak si stojí JSON ve srovnání s XML?",
    "JSON-vs-XML-Article": "Porovnání JSON a XML",
    "MDN-JSON-in-JavaScript": "MDN Web Docs – Práce s JSON",
    "OWASP-JSON-Injection": "OWASP - JSON Injection",
    "XML-Advantages-012": "XML poskytuje větší flexibilitu struktury a podporuje jmenné prostory, což může být výhodné pro složité struktury dokumentů a interoperabilitu napříč systémy."
}