{
    "15424": "To je celý problém vědy. Máte spoustu empiriků, kteří se snaží popsat věci nepředstavitelného zázraku. – Bill Watterson",
    "15999": "Inovace je proces provádění změn v něčem zavedeném. - Tým pro definici inovací",
    "16987": "Někdy se vyplatí zůstat v pondělí v posteli, než strávit zbytek týdne laděním pondělního kódu. – Dan Salomon",
    "19775": "Věda je způsob života. Je to perspektiva. Věda je proces, který nás vede od zmatku k porozumění způsobem, který je přesný, prediktivní a spolehlivý – transformace, pro ty, kteří ji mají to štěstí zažít, posilující a emocionální. – Brian Greene",
    "38127": "Testování je proces pokusu o prolomení kódu – Anonymní",
    "42641": "Vývoj webu je obtížný, teprve potom je to zábava. Stačí si nastavit své standardy. Kdyby to mělo být snadné, udělal by to někdo? – Olawale Daniel",
    "46367": "Inovace jsou klíčem k uvolnění růstového potenciálu. -Omar Ishrak",
    "57225": "Inovace jsou mízou prosperujícího podnikání. -Michael Dell",
    "63470": "Skutečný vědec problémy řeší, ne naříká, že jsou neřešitelné. – Anne McCaffreyová",
    "66187": "Mluvení je levné. Ukaž mi kód. – Linus Torvalds",
    "68518": "Software a katedrály jsou v podstatě stejné – nejprve je postavíme, pak se modlíme.",
    "77528": "Inovace jsou hnací silou pokroku. -John F. Kennedy",
    "80972": "Špatný kód lze samozřejmě vyčistit. Ale je to velmi drahé. — Robert C. Martin",
    "85805": "Odborník je člověk, který se dopustil všech chyb, kterých se lze ve velmi úzkém oboru dopustit. – Neils Bohr",
    "92941": "Ve skutečném světě existuje skutečná poezie. Věda je poezie reality. – Richard Dawkins",
    "-wHWkv2OC": "Proč se nemohu přihlásit?",
    "-wdkeq": "Je tato komunita nezisková?",
    "00d36": "Nejlepší způsob, jak předpovědět budoucnost, je vymyslet si ji. -Alan Kay",
    "09m6vG51A": "ve vývoji",
    "0a310": "Neexistuje žádná královská cesta k vědě a jen ten, kdo se nebojí únavného stoupání po jeho strmých stezkách, má šanci získat jeho světelné vrcholy. – Karla Marxe",
    "0a710": "Inovace jsou mízou každé organizace. -Dr. R. L. Bhatia",
    "0ba15": "Úspěšná inovace vyžaduje kalkulovaná rizika. -Harvard Pruden",
    "0e299": "Všechno je teoreticky nemožné, dokud se to neudělá. – Robert A. Heinlein",
    "114ee": "Kódování jako poezie by mělo být krátké a výstižné. – Santosh Kalwar",
    "13pmE": "Podpoř nás",
    "149c0": "V otázkách vědy nestojí autorita tisíce lidí za skromné ​​uvažování jediného jednotlivce. – Galileo Galilei",
    "1883d": "Věda mnohem více stimuluje představivost než klasika. – J. B. S. Haldane",
    "188cd": "Programování se učí psaním programů. – Brian Kernighan",
    "18f46": "Rakety jsou cool. To se nedá obejít. – Elon Musk",
    "1a8b9": "Vědec není člověk, který dává správné odpovědi, je ten, kdo klade správné otázky. – Claude Levi-Strauss",
    "1d71a": "Narodili jsme se v daném okamžiku, na daném místě a jako ročníky vína máme vlastnosti roku a ročního období, do kterého jsme se narodili. Astrologie si nečiní nárok na nic víc. – Carl Jung",
    "1da5a": "Inovace jsou základem pokroku a úspěchu v moderním obchodním světě. -Larry Page",
    "1ff27": "Věda je to, čemu rozumíme natolik dobře, abychom to mohli vysvětlit počítači; umění je všechno ostatní. – Donald E. Knuth",
    "22f3a": "Inovace jsou ústředním tématem hospodářské prosperity. – Michael Porter",
    "23f61": "Inovace neznamená jen mít dobrý nápad; jde o to, aby se tato myšlenka stala skutečností. -Erik Qualman",
    "277a9": "Věda nemůže vyřešit poslední záhadu přírody. A to proto, že v poslední analýze jsme my sami součástí záhady, kterou se snažíme vyřešit. – Max Planck",
    "27ef9": "Inovace je schopnost převádět nápady na faktury. -L. Duncane",
    "2S_7EVIsK": "Validátor JSON",
    "2b7f7": "Jsem si jistý, že vesmír je plný inteligentního života. Bylo to příliš inteligentní na to, aby sem přišel. – Arthur C. Clarke",
    "321e0": "Ladění je dvakrát tak těžké než psaní kódu na prvním místě. Pokud tedy napíšete kód tak chytře, jak je to jen možné, z definice nejste dost chytří, abyste jej odladili - Brian W. Kernighan",
    "32c8d": "Pokud je ladění procesem odstraňování chyb, pak programování musí být procesem jejich vkládání. – Sam Redwine",
    "33aa4": "Věda je jen čistý empirismus a na základě své metody vylučuje metafyziku. – Steve Martin",
    "380da": "Programování je dnes závodem mezi softwarovými inženýry, kteří se snaží vytvořit větší a lepší programy odolné proti idiotům, a vesmírem, který se snaží produkovat větší a lepší idioty. Vesmír zatím vítězí. – Rick Cook",
    "394b6": "Pokud jste si mysleli, že věda je jistá? no, to je jen chyba na vaší straně. – Richard Feynman",
    "398cc": "Zdá se, že programátoři mění svět. Bylo by úlevou pro ně i pro nás všechny, kdyby o tom něco věděli. – Ellen Ullmanová",
    "3I-dkqkwr": "Upozorňujeme, že na tomto webu NEPOSKYTUJEME žádné komerční kurzy ke zkouškám z angličtiny nebo k zkouškám z jiných předmětů a ani to v budoucnu neplánujeme.",
    "3d297": "Na vědě miluji to, že když se učíte, ve skutečnosti nedostáváte odpovědi. Jen dostáváte lepší otázky. – John Green",
    "40b7f": "Inovace je jediný způsob, jak z dlouhodobého hlediska vyhrát. -Jeff Immelt",
    "420b0": "Úspěšná inovace vyžaduje závazek ke spolupráci a otevřené komunikaci. -Rachel D. Ellisonová",
    "43be5": "Deník",
    "43e45": "Neexistuje žádný zákon kromě zákona, že neexistuje žádný zákon. – John Archibald Wheeler",
    "45cb0": "Inovace nejsou jen o vytváření nových nápadů, ale také o jejich úspěšné realizaci. -Arun Pandit",
    "4N79HNWiA": "Abychom zajistili, že se jedná o neziskovou komunitu, otevíráme také celý její zdrojový kód na GitHubu, který najdete v patičce této stránky.",
    "4PIqD": "Kontrola kódu",
    "4cf03": "Vlastně všechno, co lze poznat jako číslo; neboť bez toho je nemožné cokoli uchopit nebo rozpoznat. – Filolaos",
    "4d389": "Inovace je způsob života úspěšného podnikatele. -John Rampton",
    "4da84": "Možná si nemyslíte, že programátoři jsou umělci, ale programování je nesmírně kreativní povolání. Je to kreativita založená na logice. – John Romero",
    "4sQWoTgfr": "Platnost ověřovacího kódu vypršela, obnovte stránku a zkuste to znovu",
    "4sdQWoTgfr": "Platnost ověřovacího kódu vypršela, obnovte stránku a zkuste to znovu.",
    "4vdfwf": "OK",
    "532fd": "Inovace je schopnost vidět změnu jako příležitost, nikoli hrozbu. -Steve Jobs",
    "57eaa": "Jsme jen pokročilé plemeno opic na malé planetě velmi průměrné hvězdy. Ale můžeme pochopit Vesmír. To z nás dělá něco velmi výjimečného. – Stephen Hawking",
    "58c03": "Inovace jsou klíčovým faktorem úspěchu každého podnikání. -Ravi Venkatesan",
    "58c5f": "Pokud se vám to zpočátku nepodaří, nazvěte ji verze 1.0. – Khayri R. R. Woulfe",
    "59f7d": "Inovace jsou katalyzátorem pokroku a růstu. -John Donahoe",
    "5a8a1": "Inovace je proces převzetí myšlenky a její přeměna ve skutečnost. - Kevin O'Leary",
    "5db54": "Věda je skvělým lékem na jed nadšení a pověr. – Adam Smith",
    "5qPOJL": "Chcete-li podporovat LafTools, zvažte buď udělení hvězdičky našemu úložišti na GitHubu, nebo upgrade na naši profesionální verzi prostřednictvím měsíčního předplatného. Velmi bychom ocenili vaši pomoc a slibujeme, že LafTools bude díky získaným prostředkům ještě lepší.",
    "626bf": "Kdybychom věděli, co děláme, nenazývalo by se to výzkumem, že? - Albert Einstein",
    "63d47": "Kvalita je výsledkem konfliktu mezi programátory a testery. – Jegor Bugayenk",
    "662f9": "Žiješ jen jednou, ale když žiješ správně, jednou to stačí. — Mae West",
    "66ef1": "Dobrý kód je jeho vlastní nejlepší dokumentací. Když se chystáte přidat komentář, zeptejte se sami sebe: ‚Jak mohu zlepšit kód, aby tento komentář nebyl potřeba? “ – Steve McConnell",
    "66f12": "Věda je organizované vědění. Moudrost je organizovaný život. – Will Durant",
    "6a0da": "Umění a věda klást otázky je zdrojem veškerého poznání. – Thomas Berger",
    "6hsnqWe": "Přestože je LafTools bezplatný a otevřený zdroj, jeho údržba stále vyžaduje značné množství času a energie. Potřebujeme zejména finanční prostředky na zaplacení určitých cloudových API. Pokud oceňujete LafTools, zvažte prosím podporu.",
    "71L3OI9T7": "Prozkoumat mír, podporovat spolupráci a usilovat o rozvoj se stalo tématem současné doby.",
    "72bee": "Nejsem skvělý programátor; Jsem jen dobrý programátor se skvělými návyky. – Kent Beck",
    "74a91": "Testování vede k selhání a selhání vede k pochopení - Burt Rutan",
    "74f90": "Dnešní věda je technologií zítřka. – Edward Teller",
    "7714b": "Inovace jsou klíčem k otevření nových příležitostí a podpoře růstu.",
    "79f2d": "Většina dobrých programátorů nedělá programování proto, že očekávají, že dostanou zaplaceno nebo že budou obdivováni veřejností, ale protože je programování baví. – Linus Torvalds",
    "7affb": "Svět na nás nebude čekat. Technologická revoluce nás nechá za sebou, pokud ji nedoženeme. – Kofi Annan",
    "7c59e": "Zkušenost je jméno, které každý dává svým chybám. – Oscar Wilde",
    "7d4e4": "Inovace je o hledání nových a lepších způsobů, jak dělat věci. -Jim Rohn",
    "7e19d": "Zmatek je součástí programování. – Felienne Hermansová",
    "7flKa": "LafTools - Všemocný pro všechny profesionály a inženýry",
    "7zqdufsdddJ": "Ano, jistě. Webové stránky ELB3.com jsou odvozeny od neziskové chatovací skupiny WeChat, {0}, jejímž cílem je vytvořit přátelskou a pohodlnou atmosféru pro výuku angličtiny bez reklam.",
    "8259a": "Programátor: Stroj, který mění kávu na kód. – Anonymní",
    "850c1": "Vědec vnucuje pouze dvě věci, totiž pravdu a upřímnost, vnucuje je sobě i ostatním vědcům. - Erwin Schrödinger",
    "8582b": "Pokud chceme, aby se uživatelům náš software líbil, měli bychom jej navrhnout tak, aby se choval jako sympatický člověk. – Alan Cooper",
    "8692e": "Existuje mnoho blábolů, zcela neznalých matematiky, kteří se odvažují mou hypotézu odsoudit na základě autority nějaké části Bible překroucené tak, aby vyhovovala jejich účelu. Nevážím si jich a pohrdám jejich nepodloženým úsudkem. – Mikuláš Koperník",
    "886d1": "Cítíme, že i kdyby byly zodpovězeny všechny možné vědecké otázky, problémů života se stále vůbec nedotklo. – Ludwig Wittgenstein",
    "8HcQxKgho": "Rychlý přístup",
    "8c224": "Bez ohledu na to, v jakém oboru chcete pracovat, je velmi důležité naučit se alespoň jeden programovací jazyk. – Ram Ray",
    "8e5d0": "Inovace je voláním budoucnosti. – Kofi Annan",
    "90b5e": "Není to chyba; je to nezdokumentovaná funkce. – Anonymní",
    "91f08": "Nejlepší na technologii je to, že vám umožňuje soustředit se na svou vizi a zapomenout na stroje. – John Landis",
    "9251d": "Inovace jsou klíčovým faktorem schopnosti každé společnosti dlouhodobě uspět. -Elon Musk",
    "92b29": "Inovace je proces převzetí kreativní myšlenky a její přeměna v komerční úspěch. -Richard Branson",
    "9334e": "Největší sláva v životě nespočívá v tom, že nikdy nepadneme, ale v tom, že vstaneme pokaždé, když padneme. - Nelson Mandela",
    "9412b": "Nejprve vyřešte problém. Poté napište kód. – John Johnson",
    "9469a": "Každý by se měl naučit programovat počítač, protože vás to naučí myslet. - Steve Jobs",
    "98d3f": "Věda je kouzlo, které funguje. – Kurt Vonnegut",
    "9YPgsPid2M": "SMS kód",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64 kodér",
    "9b_7a0sdf": "Base64 dekodér",
    "9cb71": "Inovace je o vytváření hodnoty pro zákazníky a zlepšování jejich života. -Reed Hastings",
    "9d18a": "Software přichází z nebe, když máte dobrý hardware. – Ken Olsen",
    "Abi2k2cP7": "Omlouváme se, ale tato stránka ještě není dokončena.",
    "BP2jBlIE0": "Některé odkazy jsou stále nedostupné, protože LafTools je stále ve vývoji, dejte nám hvězdičku k odběru nejnovější aktualizace na GitHubu.",
    "BQs6go-dk": "Stáhněte si zdarma LafTools pro Windows, Linux a macOS.",
    "Bz_WdwvAPn": "Zkontrolujte, zda je správně zadán CAPTCHA.",
    "C_qzLO7yw": "Pro nejlepší zážitek použijte Chrome, Firefox nebo Edge.",
    "CidOqAZ": "Jako tvůrce LafTools jsem tak dojatý, že jste ochotni nás podpořit. V našem týmu máme dobré lidi, kteří tvrdě pracují na neustálém zlepšování LafTools.",
    "CqFdiBu6M": "Pohled",
    "CuHqw9m": "{0} není platné telefonní číslo, v současné době systém přijímá pouze 11místné telefonní číslo.",
    "Ezsn81tfc": "Pohled",
    "GaySMPQHo": "Trendy",
    "H39ddc0df": "Pokuste se přihlásit později, pokud se nezdařilo příliš mnohokrát.",
    "HaU4NMabv": "Ověřovací kód je nesprávný, zadejte prosím znovu nebo obnovte obrázek.",
    "HckK__LH2": "Více",
    "Ibzs2-Ho1": "Nástroje CSV",
    "IugAFc4OT": "Při odesílání vašich dat došlo k problému.",
    "Jbor69IBw": "Formátovače",
    "N9bCERU1Q": "Interní provozní stránka pro LafTools",
    "NdqZcRL2QN": "V případě, že jste zapomněli své heslo, můžete je resetovat kliknutím na odkaz 'Zapomenuté heslo'.",
    "OBjaZqTvx": "Domov",
    "OQWm4": "Nahlásit chybu",
    "TET4xnxBT": "Velikonoční vajíčko",
    "TmvHUnZzQ": "Adresa URL stránky byla zkopírována do schránky",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Domov",
    "V6U_f": "Podmínky služby",
    "WKG7e": "Pravidla",
    "ZCzH8": "Nejnovější",
    "ZaS8MP8cr": "Poznámka: Ověřovací kód je obnoven, upravte prosím hodnoty formuláře a znovu zadejte kód, abyste mohli pokračovat.",
    "ZbD3F": "{0}, vytvořený týmem LafTools",
    "a0ab0": "Umění je strom života. Věda je strom smrti. – William Blake",
    "a2849": "Věda je přijímání toho, co funguje, a odmítání toho, co nefunguje. Chce to víc odvahy, než si myslíme. – Jacob Bronowski",
    "a3508": "Člověk, vybavený svými pěti smysly, zkoumá vesmír kolem sebe a dobrodružství nazývá vědou. – Edwin Hubble",
    "a5354": "Je zvláštní, že jen mimořádné objevy způsobené člověkem se později zdají být tak snadné a jednoduché. – George C. Lichtenberg",
    "a7062": "Inovace je jiskra, která podněcuje pokrok. - Robyn M. D'Angelo",
    "a8a34": "Inovace jsou vizitkou budoucnosti. -Anna Eshoo",
    "a8dd9": "Život nemůže mít náhodný začátek... problém je v tom, že existuje asi 2000 enzymů a šance získat je všechny náhodným pokusem je jen jedna část ku 40 000, což je neuvěřitelně malá pravděpodobnost, které by nebylo možné čelit, i kdyby celý vesmír sestával z bio polévky. – Fred Hoyle",
    "aUdtds_qwY": "Normálně se můžete úspěšně přihlásit pomocí svého uživatelského ID nebo telefonního čísla, i když jste porušili pravidla v této komunitě.",
    "aa2f1": "Průzkum je to, co děláte, když nevíte, co děláte. To vědci dělají každý den. Kdyby už vědec věděl, co dělají, nic by neobjevil, protože už věděl, co dělá. – Neil deGrasse Tyson",
    "aa3a4": "Kód je jako humor. Když to musíte vysvětlit, je to špatné. – Cory House",
    "ab5f7": "Nejsmutnějším aspektem současného života je, že věda shromažďuje znalosti rychleji než společnost shromažďuje moudrost. – Isaac Asimov",
    "ac615": "Ať to funguje, napravte to, udělejte to rychle. – Kent Beck",
    "adcca": "Každý blázen dokáže napsat kód, kterému počítač rozumí. Dobří programátoři píší kód, kterému lidé rozumí. – Martin Fowler",
    "af3158": "Všechno je určováno... silami, nad kterými nemáme žádnou kontrolu. -Albert Einstein",
    "afcb9": "Nic nemá takovou sílu rozšířit mysl jako schopnost systematicky a pravdivě zkoumat vše, co v životě spadá pod tvé pozorování. – Marcus Aurelius",
    "afe52": "Vždy je potřeba opravit ještě jednu chybu. – Ellen Ullmanová",
    "announcement": "Oznámení",
    "b194e": "Inovace přichází od výrobce, nikoli od zákazníka. -W. Edwards Deming",
    "b19bb": "V den, kdy věda začne studovat nefyzikální jevy, udělá za jednu dekádu větší pokrok než za všechna předchozí staletí své existence. – Nikola Tesla",
    "b2724": "Programování je umění říkat druhému člověku, co chce, aby počítač dělal. – Donald Ervin Knuth",
    "b4603": "Život je to, co se stane, když jste zaneprázdněni vytvářením jiných plánů. - John Lennon",
    "b5014": "Mnoho životních neúspěchů jsou lidé, kteří si neuvědomili, jak blízko byli úspěchu, když se vzdali. – Thomas A. Edison",
    "b7wgrhuXl": "Tech",
    "bc574": "Inovace jsou mízou zdravého podnikání. -Marek Kubán",
    "bc92f": "Úspěšná inovace začíná potřebou zákazníka. -Michael Dell",
    "beb6e": "Nápady jsou snadné. Implementace je náročná. -Guy Kawasaki",
    "bfb8e": "Inovace jsou klíčem k udržení relevantní a konkurenceschopnosti na trhu. -Mark Zuckerberg",
    "bjaEuT-cU": "Hostováno na {0}",
    "c7cfc": "Dobrý test je ten, který má vysokou pravděpodobnost prolomení kódu, pokud se vyskytne problém - Michael Bolton",
    "cae2c": "Inovace je proces přijímání nápadů a jejich přeměny ve skutečnost. -Neil Lawrence",
    "cd4d1": "Inovace jsou klíčem k růstu podnikání. -Andrew R. Steinberg",
    "d0624": "Inovace nejsou jen o přicházení s novými nápady, ale o jejich efektivní realizaci. -Jeff Bezos",
    "d10c9": "Inovace jsou klíčem k odemknutí nového potenciálu a odemknutí nových trhů. -Tim Cook",
    "d1820": "Dokud člověk nezduplikuje stéblo trávy, může se příroda smát jeho takzvaným vědeckým poznatkům. - Thomas Edison",
    "d366a": "Inovace jsou klíčem k odemknutí nového růstu. - Filip Kotler",
    "d5LAU": "Licencováno pod AGPLv3",
    "d7dc4": "Testování je proces hodnocení systému nebo jeho komponent (komponent) se záměrem zjistit, zda splňují zadané požadavky nebo ne - Anonymní",
    "dO6b2Tkqwe": "Nedávno použité nástroje",
    "da74c": "Spekulace a zkoumání myšlenek nad rámec toho, co s jistotou známe, jsou tím, co vede k pokroku. – Lisa Randall",
    "dc662": "Jedinou skutečnou chybou je ta, ze které se nic nepoučíme – John Powell",
    "dcebe": "Pokud je ladění procesem odstraňování softwarových chyb, pak programování musí být procesem jejich vkládání - Edsger Dijkstra",
    "ddcc7": "Inovace jsou klíčem k úspěchu v moderní ekonomice. -Satja Nadella",
    "ddsdf3159": "Fyzika ve skutečnosti není nic jiného než hledání maximální jednoduchosti, ale zatím máme jen jakýsi elegantní nepořádek. -Bill Bryson",
    "de47c": "Testování je umění najít černou skříňku a přimět ji zpívat - James Bach",
    "dldeoeqwc": "Přátelské připomenutí",
    "dnsz7fwNx": "ID uživatele rozlišuje malá a velká písmena.",
    "e097e": "Inovace znamená vytvářet nové možnosti, nejen nové produkty. -Tony Robbins",
    "e2379": "Žijeme ve společnosti znamenitě závislé na vědě a technice, ve které o vědě a technice téměř nikdo nic neví. – Carl Sagan",
    "e984f": "Čistý kód vždy vypadá, jako by ho napsal někdo, koho to zajímá. — Robert C. Martin",
    "ea227": "Nejlepší způsob, jak předpovědět budoucnost, je vytvořit ji. -Petr Drucker",
    "ee7d0": "Pocit úžasu, který nám věda může poskytnout, je jedním z nejvyšších zážitků, kterých je lidská psychika schopna. – Richard Dawkins",
    "englishcorner": "Angličtina",
    "f0d15": "Počítače jsou rychlé; vývojáři je udržují pomalé. – Anonymní",
    "f12bb": "Inovace jsou hnací silou pokroku v obchodním světě. Je to proces generování nových nápadů a jejich přeměny na hmatatelné produkty, služby nebo procesy, které přinášejí hodnotu zákazníkům.",
    "f23c2": "Inovace rozlišuje mezi vůdcem a následovníkem. -Steve Jobs",
    "f29b1": "Pokroku se dosahuje zkouškami a neúspěchy; neúspěchy jsou obecně stokrát četnější než úspěchy, ale většinou zůstávají bez chronizace. – William Ramsay",
    "f3151": "Největší riziko je nepodstupovat žádné riziko. -Mark Zuckerberg",
    "f3159": "Matematika je hra hraná podle určitých jednoduchých pravidel s nesmyslnými značkami na papíře. -David Hilbert",
    "f315e7": "Matematika nezná rasy ani geografické hranice. -David Hilbert",
    "f3160": "Matematika je nejvyšším soudcem; proti jejím rozhodnutím není odvolání. -Tobias Dantzig",
    "f3161": "V matematice musí mít umění navrhnout otázku vyšší hodnotu než ji vyřešit. -Georg Cantor",
    "f3162": "Matematika je místo, kde můžete dělat věci, které v reálném světě dělat nemůžete. -Marcus du Sautoy",
    "f3163": "Pokrok a dokonalost matematiky jsou úzce spjaty s prosperitou státu. -Napoleon Bonaparte",
    "f3164": "Podstata matematiky spočívá v její svobodě. -Georg Cantor",
    "f3165": "Matematika je věda o tom, co je jasné samo o sobě. - Carl Jacobi",
    "f3166": "Matematika, správně viděná, má nejen pravdu, ale také nejvyšší krásu. -Bertrand Russell",
    "f3167": "Matematika je nástroj speciálně vhodný pro práci s abstraktními pojmy jakéhokoli druhu. -P. Dirac",
    "f3168": "Matematika odhaluje svá tajemství jen tomu, kdo k ní přistupuje s čistou láskou, pro její vlastní krásu. -Archimedes",
    "f3169": "Matematika je nejkrásnější a nejmocnější výtvor lidského ducha. -Stefan Banach",
    "f3170": "Matematik nestuduje čistou matematiku, protože je užitečná; studuje to, protože ho to baví, a baví ho to, protože je to krásné. -Henri Poincaré",
    "f3171": "Studium matematiky, stejně jako Nil, začíná v maličkosti, ale končí ve velkoleposti. -Charles Caleb Colton",
    "f318e4": "Biologie je nejvýkonnější technologie, která kdy byla vytvořena. DNA je software, protein je hardware, buňky jsou továrny. - Arvind Gupta",
    "f31d71": "Fyzika je, doufejme, jednoduchá. Fyzici nejsou. -Edward Teller",
    "f31d75": "Fyzika ve skutečnosti není nic jiného než hledání maximální jednoduchosti, ale zatím máme jen jakýsi elegantní nepořádek. -Bill Bryson",
    "f31e53": "Matematika je královnou věd. -Carl Friedrich Gauss",
    "f31q52": "Čistá matematika je svým způsobem poezií logických myšlenek. -Albert Einstein",
    "f31q54": "Kniha přírody je psána jazykem matematiky. -Galileo Galilei",
    "f31q56": "Matematika je hudba rozumu. -James Joseph Sylvester",
    "f31q58": "Matematika není o číslech, rovnicích, výpočtech nebo algoritmech: je o porozumění. -William Paul Thurston",
    "f31q70": "Biologie je věda. Evoluce je koncept, který dělá biologii jedinečnou. -Jared Diamond",
    "f31q72": "Biologie je poezií fyzického světa a biologie člověka je poezií našeho vesmíru. - Julian Casablancas",
    "f31q74": "Biologie je jen fyzika, která začala zapáchat. -Nigel Calder",
    "f31q81": "Fyzika je věda o pohybech a akcích fyzických těl pojatá jako příčina a následek. - Arthur Compton",
    "f31qe82": "Biologie je softwarový proces. Naše těla se skládají z bilionů buněk, z nichž každá je řízena tímto procesem. Vy a já chodíme se zastaralým softwarem běžícím v našich tělech, který se vyvinul ve velmi odlišné době. -Ray Kurzweil",
    "f31r83": "Fyzika se pro fyziky stává příliš obtížnou. -David Hilbert",
    "f31sq66": "Biologie je opravdu chemie, chemie je opravdu fyzika, fyzika je opravdu matematika. -Matt Ridley",
    "f31x76": "Biologie je studiem složitých věcí ve vesmíru. Fyzika je studium těch jednoduchých. -Richard Dawkins",
    "f31x77": "Fyzika je zkušenost, uspořádaná v ekonomickém pořádku. -Ernst Mach",
    "f3d169": "Fyzika je jediná skutečná věda. Zbytek je jen sbírání známek. -Ernest Rutherford",
    "f3d179": "Fyzika se stává tak neuvěřitelně složitou, že vycvičit fyzika trvá stále déle. Vyškolit fyzika na místo, kde rozumí povaze fyzických problémů, ve skutečnosti trvá tak dlouho, že je již příliš starý na to, aby je řešil. -Eugene Wigner",
    "f3d180": "Biologie je věda o životě, přesto mnozí z nás nerozumí základům vlastního těla. -Kathy Reichsová",
    "f3e155": "Matematika je dveřmi a klíčem k vědám. - Roger Bacon",
    "f3q178": "Biologie není osud. Nikdy to nebylo víc než tendence. Byl to prostě první rychlý a špinavý způsob, jak příroda počítat s masem. Čipy jsou osud. -Bart Kosko",
    "f3sd162": "Biologie je studium komplikovaných věcí, které vypadají, jako by byly navrženy s určitým účelem. -Richard Dawkins",
    "f3sd164": "Biologie vám dá mozek. Život to promění v mysl. -Jeffrey Eugenides",
    "f3sd165": "Ve fyzice nemusíte chodit a dělat problémy sami sobě – příroda to udělá za vás. -Frank Wilczek",
    "f3sq167": "Na vědě je dobré, že je pravdivá, ať už v ni věříte nebo ne. -Neil deGrasse Tyson",
    "f477b": "Programování je umění návrhu algoritmu a umění ladění chybného kódu. – Ellen Ullmanová",
    "f7cf7": "Ve skutečnosti existují dvě věci, věda a názor; to první plodí vědění, to druhé nevědomost. – Hippokrates",
    "f814a": "Když jsem napsal tento kód, jen Bůh a já jsme pochopili, co jsem udělal. Teď jen bůh knotools. – Anonymní",
    "f96ff": "Inovace jsou motorem pokroku a úspěchu v podnikání. -Satja Nadella",
    "fa94e": "Inovace je klíčem k udržení náskoku v konkurenčním závodě. -Paul Sloane",
    "fc805": "Inovace je kreativita s úkolem. – Tom Peters.",
    "fd3173": "Fyzika je představivost v rovném kabátku. -John Moffat",
    "fdd2b": "Věda je organizované vědění. Moudrost je organizovaný život. – Immanuel Kant",
    "forever-foss": "Navždy FOSS!",
    "giveas3tar": "Pokud máte rádi LafTools, dejte nám hvězdičku na GitHubu.",
    "groupnote": "Memo",
    "hbvxdivMHi": "celkem {0} nástrojů",
    "iZXig7E2JF": "LafTools nabízí komplexní sadu vývojových nástrojů včetně kodeků, formátovačů, nástrojů pro zpracování obrazu a řešení správy počítačových zdrojů. LafTools, navržený tak, aby zefektivnil a zlepšil váš vývojový pracovní postup, je vaším hlavním zdrojem pro efektivní a vysoce kvalitní vývoj softwaru.",
    "jRFk519Bj-": "Tato komunita je poháněna plně mezinárodním bezplatným projektem s otevřeným zdrojovým kódem.",
    "jr_7Y98yZ": "LafTools",
    "kUSuP_S-Y": "Zkuste to pomocí klientského uživatelského rozhraní",
    "lWqYc": "Tento web poskytuje nástroje JSON včetně JSON do XML, JSON do CSV, JSON do YAML.",
    "laftoolstitle": "LafTools online zdarma",
    "lu2T6idPY": "Pokud si myslíte, že je problém s vaším účtem, kontaktujte prosím webmastera.",
    "nh1W-": "Testování může prokázat pouze přítomnost chyb, nikoli jejich nepřítomnost - Edsger Dijkstra",
    "nncQE": "Život",
    "o1ikM3T4c": "Pomocníci programátora",
    "ob1q-I7s-": "O LafTools",
    "pNwe3": "jiný",
    "q0zA1kML_": "Online Toolbox",
    "q3VjkLMsP": "Přátelství, výměna, spolupráce a rozvoj",
    "qHoktx": "Děkuji!",
    "qWemXE4": "1. ledna 2024",
    "quality-first": "Kvalita na prvním místě",
    "rK6cx": "{0}, navržený a vyvinutý týmem LafTools",
    "rzoFmjStq": "Příslušné nástroje",
    "sdf3160": "Úkolem teoretiků, zejména v biologii, je navrhovat nové experimenty. Dobrá teorie přináší nejen předpovědi, ale i překvapivé předpovědi, které se pak ukáží jako pravdivé. - Francis Crick",
    "t8DUz20a-": "Formát JSON",
    "title-laftools": "LafTools – Přední All-In-One ToolBox pro programátory",
    "wCcPJZK": "{0} není platný e-mail",
    "wCctGPJZK": "{0} by nemělo být prázdné",
    "wYsKTq7nK": "Kliknutím na mě zobrazíte zdrojový kód",
    "wi28h5_S2": "Kodeky",
    "yCsTC": "Kořenem všeho zla je předčasná optimalizace.",
    "zmDWx": "Kontaktujte nás",
    "zuxd0y-kmA": "ID uživatele nebo telefonní číslo neobsahuje žádné mezery."
}