{
    "15424": "Det er hele problemet med vitenskap. Du har en haug med empirikere som prøver å beskrive ting av ufattelig undring. – Bill Watterson",
    "15999": "Innovasjon er prosessen med å gjøre endringer i noe etablert. -Innovasjonsdefinisjonsteam",
    "16987": "Noen ganger lønner det seg å ligge i sengen på mandag, i stedet for å bruke resten av uken på å feilsøke mandagens kode. – Dan Salomon",
    "19775": "Vitenskap er en livsstil. Det er et perspektiv. Vitenskap er prosessen som tar oss fra forvirring til forståelse på en måte som er presis, prediktiv og pålitelig – en transformasjon, for de som er heldige nok til å oppleve den, som er styrkende og emosjonell. – Brian Greene",
    "38127": "Testing er prosessen med å prøve å bryte koden – Anonym",
    "42641": "Nettutvikling er vanskelig, bare da er det morsomt å gjøre. Du må bare sette dine standarder. Hvis det skulle være enkelt, ville noen gjort det? - Olawale Daniel",
    "46367": "Innovasjon er nøkkelen til å frigjøre vekstpotensial. -Omar Ishrak",
    "57225": "Innovasjon er livsnerven i en blomstrende virksomhet. -Michael Dell",
    "63470": "En ekte vitenskapsmann løser problemer, ikke klager over at de er uløselige. – Anne McCaffrey",
    "66187": "Snakk er billig. Vis meg koden. ― Linus Torvalds",
    "68518": "Programvare og katedraler er mye det samme - først bygger vi dem, så ber vi.",
    "77528": "Innovasjon er drivkraften bak fremgang. -John F. Kennedy",
    "80972": "Selvfølgelig kan dårlig kode ryddes opp. Men det er veldig dyrt. — Robert C. Martin",
    "85805": "En ekspert er en person som har gjort alle feilene som kan gjøres på et veldig snevert felt. – Neils Bohr",
    "92941": "Det er ekte poesi i den virkelige verden. Vitenskap er virkelighetens poesi. – Richard Dawkins",
    "-wHWkv2OC": "Hvorfor kan jeg ikke logge på?",
    "-wdkeq": "Er dette fellesskapet non-profit?",
    "00d36": "Den beste måten å forutsi fremtiden er å finne den opp. -Alan Kay",
    "09m6vG51A": "under utvikling",
    "0a310": "Det er ingen kongevei til vitenskapen, og bare de som ikke gruer seg til den slitsomme stigningen på de bratte stiene har en sjanse til å nå de lysende toppene. – Karl Marx",
    "0a710": "Innovasjon er livsnerven i enhver organisasjon. -Dr. R.L. Bhatia",
    "0ba15": "Vellykket innovasjon krever å ta kalkulerte risikoer. -Harvard Pruden",
    "0e299": "Alt er teoretisk umulig før det er gjort. – Robert A. Heinlein",
    "114ee": "Koding som poesi bør være kort og konsist. - Santosh Kalwar",
    "13pmE": "Støtt oss",
    "149c0": "Når det gjelder vitenskapelige spørsmål, er autoriteten til tusen ikke verdt det ydmyke resonnementet til et enkelt individ. – Galileo Galilei",
    "1883d": "Vitenskap er mye mer stimulerende for fantasien enn klassikerne. – J. B. S. Haldane",
    "188cd": "Programmering læres ved å skrive programmer. – Brian Kernighan",
    "18f46": "Raketter er kult. Det er ingen vei utenom det. – Elon Musk",
    "1a8b9": "Vitenskapsmannen er ikke en person som gir de riktige svarene, han er en som stiller de riktige spørsmålene. – Claude Levi-Strauss",
    "1d71a": "Vi er født i et gitt øyeblikk, på et gitt sted, og som årgangsår med vin, har vi kvalitetene til året og sesongen vi er født av. Astrologi gjør ikke krav på noe mer. – Carl Jung",
    "1da5a": "Innovasjon er grunnlaget for fremgang og suksess i den moderne forretningsverden. -Larry Page",
    "1ff27": "Vitenskap er det vi forstår godt nok til å forklare for en datamaskin; kunst er alt annet. – Donald E. Knuth",
    "22f3a": "Innovasjon er det sentrale spørsmålet i økonomisk velstand. – Michael Porter",
    "23f61": "Innovasjon handler ikke bare om å ha en god idé; det handler om å gjøre den ideen til virkelighet. -Erik Qualman",
    "277a9": "Vitenskapen kan ikke løse naturens ultimate mysterium. Og det er fordi vi i siste instans selv er en del av mysteriet som vi prøver å løse. – Max Planck",
    "27ef9": "Innovasjon er evnen til å konvertere ideer til fakturaer. -L. Duncan",
    "2S_7EVIsK": "JSON Validator",
    "2b7f7": "Jeg er sikker på at universet er fullt av intelligent liv. Det har bare vært for intelligent å komme hit. – Arthur C. Clarke",
    "321e0": "Feilsøking er dobbelt så vanskelig som å skrive koden i utgangspunktet. Derfor, hvis du skriver koden så smart som mulig, er du per definisjon ikke smart nok til å feilsøke den - Brian W. Kernighan",
    "32c8d": "Hvis feilsøking er prosessen med å fjerne feil, må programmering være prosessen med å sette dem inn. – Sam Redwine",
    "33aa4": "Vitenskap er bare ren empirisme, og i kraft av sin metode utelukker den metafysikk. – Steve Martin",
    "380da": "Programmering i dag er et kappløp mellom programvareingeniører som streber etter å bygge større og bedre idiotsikre programmer og universet som prøver å produsere større og bedre idioter. Så langt vinner universet. – Rick Cook",
    "394b6": "Hvis du trodde at vitenskapen var sikker? vel, det er bare en feil fra din side. – Richard Feynman",
    "398cc": "Programmerere ser ut til å forandre verden. Det ville vært en lettelse, for dem og for oss alle, hvis de visste noe om det. – Ellen Ullman",
    "3I-dkqkwr": "Merk at vi IKKE tilbyr noen kommersielle opplæringskurs for engelskeksamener eller andre fageksamener på denne nettsiden, og vi planlegger ikke å gjøre det i fremtiden.",
    "3d297": "Det jeg elsker med vitenskap er at når du lærer, får du egentlig ikke svar. Du får bare bedre spørsmål. – John Green",
    "40b7f": "Innovasjon er den eneste måten å vinne på i det lange løp. -Jeff Immelt",
    "420b0": "Vellykket innovasjon krever forpliktelse til samarbeid og åpen kommunikasjon. -Rachel D. Ellison",
    "43be5": "Dagbok",
    "43e45": "Det er ingen lov bortsett fra loven at det ikke er noen lov. – John Archibald Wheeler",
    "45cb0": "Innovasjon handler ikke bare om å skape nye ideer, men det handler også om å gjennomføre dem med suksess. -Arun Pandit",
    "4N79HNWiA": "For å sikre at det er et non-profit fellesskap, åpner vi også hele kildekoden på GitHub, som du finner nederst på denne siden.",
    "4PIqD": "Kode anmeldelse",
    "4cf03": "Egentlig alt som kan kalles et tall; for det er umulig å fatte noe med sinnet eller å gjenkjenne det uten dette. – Philolaus",
    "4d389": "Innovasjon er en livsstil for den suksessrike gründeren. -John Rampton",
    "4da84": "Du tror kanskje ikke at programmerere er kunstnere, men programmering er et ekstremt kreativt yrke. Det er logikkbasert kreativitet. – John Romero",
    "4sQWoTgfr": "Bekreftelseskoden er utløpt. Last inn siden på nytt og prøv igjen",
    "4sdQWoTgfr": "Bekreftelseskoden er utløpt. Last inn siden på nytt og prøv igjen.",
    "4vdfwf": "OK",
    "532fd": "Innovasjon er evnen til å se endring som en mulighet, ikke en trussel. -Steve Jobs",
    "57eaa": "Vi er bare en avansert rase av aper på en mindre planet av en veldig gjennomsnittlig stjerne. Men vi kan forstå universet. Det gjør oss til noe helt spesielt. – Stephen Hawking",
    "58c03": "Innovasjon er en nøkkelfaktor for suksess for enhver bedrift. -Ravi Venkatesan",
    "58c5f": "Hvis du først ikke lykkes, kall det versjon 1.0. – Khayri R.R. Woulfe",
    "59f7d": "Innovasjon er katalysatoren for fremgang og vekst. -John Donahoe",
    "5a8a1": "Innovasjon er prosessen med å ta en idé og gjøre den til virkelighet. -Kevin O'Leary",
    "5db54": "Vitenskapen er den store motgiften mot giften av entusiasme og overtro. – Adam Smith",
    "5qPOJL": "For å støtte LafTools, vurder enten å gi en stjerne til vårt lager på GitHub eller å oppgradere til vår profesjonelle versjon gjennom et månedlig abonnement. Vi vil sette stor pris på din hjelp, og vi lover at LafTools vil bli enda bedre med de innsamlede midlene.",
    "626bf": "Hvis vi visste hva det var vi gjorde, ville det vel ikke blitt kalt forskning? - Albert Einstein",
    "63d47": "Kvalitet er et produkt av en konflikt mellom programmerere og testere. – Yegor Bugayenk",
    "662f9": "Du lever bare en gang men hvis du gjør det riktig er en gang nok. — Mae West",
    "66ef1": "God kode er sin egen beste dokumentasjon. Når du skal legge til en kommentar, spør deg selv: 'Hvordan kan jeg forbedre koden slik at denne kommentaren ikke er nødvendig? ' - Steve McConnell",
    "66f12": "Vitenskap er organisert kunnskap. Visdom er organisert liv. – Will Durant",
    "6a0da": "Kunsten og vitenskapen med å stille spørsmål er kilden til all kunnskap. – Thomas Berger",
    "6hsnqWe": "Selv om LafTools er gratis og åpen kildekode, krever det fortsatt en betydelig mengde tid og energi å vedlikeholde det. Spesielt trenger vi midler for å betale for visse cloud APIer. Hvis du setter pris på LafTools, kan du vurdere å støtte oss.",
    "71L3OI9T7": "Å granske fred, fremme samarbeid og søke utvikling har blitt temaet for den nåværende æra.",
    "72bee": "Jeg er ikke en god programmerer; Jeg er bare en god programmerer med gode vaner. – Kent Beck",
    "74a91": "Testing fører til fiasko, og fiasko fører til forståelse - Burt Rutan",
    "74f90": "Vitenskapen i dag er fremtidens teknologi. – Edward Teller",
    "7714b": "Innovasjon er nøkkelen til å frigjøre nye muligheter og drive vekst.",
    "79f2d": "De fleste gode programmerere programmerer ikke fordi de forventer å få betalt eller bli beundret av publikum, men fordi det er morsomt å programmere. – Linus Torvalds",
    "7affb": "Verden vil ikke vente på oss. Den teknologiske revolusjonen vil etterlate oss hvis vi ikke tar igjen. – Kofi Annan",
    "7c59e": "Erfaring er navnet alle gir til sine feil. - Oscar Wilde",
    "7d4e4": "Innovasjon handler om å finne nye og bedre måter å gjøre ting på. -Jim Rohn",
    "7e19d": "Forvirring er en del av programmering. - Felienne Hermans",
    "7flKa": "LafTools - Den allmektige for alle profesjonelle og ingeniører",
    "7zqdufsdddJ": "Ja, helt klart. Nettstedet ELB3.com er avledet fra den ideelle WeChat chat-gruppen, {0}, som tar sikte på å skape en vennlig, ads-fri og komfortabel atmosfære for engelsk læring.",
    "8259a": "Programmerer: En maskin som gjør kaffe om til kode. – Anonym",
    "850c1": "Vitenskapsmannen påtvinger bare to ting, nemlig sannhet og oppriktighet, påtvinger dem seg selv og andre vitenskapsmenn. - Erwin Schrödinger",
    "8582b": "Hvis vi vil at brukerne skal like programvaren vår, bør vi designe den slik at den oppfører seg som en sympatisk person. – Alan Cooper",
    "8692e": "Det er mange bablerer, fullstendig uvitende om matematikk, som våger å fordømme hypotesen min, på autoritet fra en del av Bibelen som er vridd for å passe deres hensikt. Jeg verdsetter dem ikke og forakter deres grunnløse dom. – Nicholas Copernicus",
    "886d1": "Vi føler at selv om alle mulige vitenskapelige spørsmål blir besvart, har livets problemer fortsatt ikke blitt berørt i det hele tatt. – Ludwig Wittgenstein",
    "8HcQxKgho": "Rask tilgang",
    "8c224": "Uansett hvilket arbeidsfelt du ønsker å gå i, er det av stor betydning å lære minst ett programmeringsspråk. – Ram Ray",
    "8e5d0": "Innovasjon er fremtidens kall. – Kofi Annan",
    "90b5e": "Det er ikke en feil; det er en udokumentert funksjon. – Anonym",
    "91f08": "Det beste med teknologi er at den lar deg konsentrere deg om synet ditt og glemme maskineriet. – John Landis",
    "9251d": "Innovasjon er en nøkkelfaktor for enhver bedrifts evne til å lykkes på lang sikt. - Elon Musk",
    "92b29": "Innovasjon er prosessen med å ta en kreativ idé og gjøre den til en kommersiell suksess. -Richard Branson",
    "9334e": "Den største herligheten i å leve ligger ikke i å aldri falle, men i å reise oss hver gang vi faller. - Nelson Mandela",
    "9412b": "Først må du løse problemet. Deretter skriver du koden. – John Johnson",
    "9469a": "Alle bør lære å programmere en datamaskin fordi den lærer deg hvordan du tenker. – Steve Jobs",
    "98d3f": "Vitenskap er magi som fungerer. – Kurt Vonnegut",
    "9YPgsPid2M": "SMS kode",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64-koder",
    "9b_7a0sdf": "Base64 dekoder",
    "9cb71": "Innovasjon handler om å skape verdier for kundene og forbedre deres liv. -Reed Hastings",
    "9d18a": "Programvare kommer fra himmelen når du har god maskinvare. – Ken Olsen",
    "Abi2k2cP7": "Beklager, denne siden er ikke ferdig så langt.",
    "BP2jBlIE0": "Noen lenker er fortsatt utilgjengelige siden LafTools fortsatt er under utvikling, vennligst gi oss en stjerne for å abonnere på siste oppdatering på GitHub.",
    "BQs6go-dk": "Gratis nedlasting LafTools for Windows, Linux og macOS.",
    "Bz_WdwvAPn": "Sjekk om CAPTCHA er gitt riktig.",
    "C_qzLO7yw": "Bruk Chrome, Firefox eller Edge for den beste opplevelsen.",
    "CidOqAZ": "Som skaperen av LafTools er jeg så rørt over at du er villig til å støtte oss. Vi har flinke folk på laget vårt som jobber hardt for å kontinuerlig forbedre LafTools.",
    "CqFdiBu6M": "Utsikt",
    "CuHqw9m": "{0} er ikke et gyldig telefonnummer. Systemet godtar for øyeblikket kun 11-sifrede telefonnummer.",
    "Ezsn81tfc": "Utsikt",
    "GaySMPQHo": "Trender",
    "H39ddc0df": "Prøv å logge på senere hvis det mislyktes for mange ganger.",
    "HaU4NMabv": "Bekreftelseskoden er feil, vennligst skriv inn eller oppdater bildet.",
    "HckK__LH2": "Mer",
    "Ibzs2-Ho1": "CSV-verktøy",
    "IugAFc4OT": "Det har oppstått et problem under innsending av dataene dine.",
    "Jbor69IBw": "Formatere",
    "N9bCERU1Q": "Intern driftsside for LafTools",
    "NdqZcRL2QN": "Hvis du har glemt passordet ditt, kan du tilbakestille det ved å klikke på koblingen \"Glemt passord\".",
    "OBjaZqTvx": "Hjem",
    "OQWm4": "Rapporter en feil",
    "TET4xnxBT": "Påskeegg",
    "TmvHUnZzQ": "Kopierte sidens URL til utklippstavlen",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Hjem",
    "V6U_f": "Vilkår for bruk",
    "WKG7e": "Regler",
    "ZCzH8": "Nyeste",
    "ZaS8MP8cr": "Merk: Bekreftelseskoden er oppdatert. Juster skjemaverdiene og skriv inn koden på nytt for å fortsette med.",
    "ZbD3F": "{0}, laget av LafTools-teamet",
    "a0ab0": "Kunst er livets tre. Vitenskapen er dødens tre. – William Blake",
    "a2849": "Vitenskap er aksept av det som fungerer og avvisning av det som ikke gjør det. Det krever mer mot enn vi kanskje tror. – Jacob Bronowski",
    "a3508": "Utstyrt med sine fem sanser utforsker mennesket universet rundt seg og kaller eventyret Science. – Edwin Hubble",
    "a5354": "Det er rart at bare ekstraordinære menneskeskapte funn som rykker senere fremstår så enkle og enkle. – George C. Lichtenberg",
    "a7062": "Innovasjon er gnisten som tenner fremgang. -Robyn M. D'Angelo",
    "a8a34": "Innovasjon er fremtidens visittkort. -Anna Eshoo",
    "a8dd9": "Livet kan ikke ha en tilfeldig begynnelse ... problemet er at det er omtrent 2000 enzymer, og sjansen for å få dem alle i en tilfeldig prøve er bare en del av 10^40 000, en uhyrlig liten sannsynlighet som ikke kan møtes selv om hele universet besto av økologisk suppe. – Fred Hoyle",
    "aUdtds_qwY": "Vanligvis kan du logge på med bruker-ID eller telefonnummer selv om du har brutt reglene i dette fellesskapet.",
    "aa2f1": "Utforskning er det du gjør når du ikke vet hva du gjør. Det er det forskere gjør hver dag. Hvis en forsker allerede visste hva de gjorde, ville de ikke oppdaget noe, fordi de allerede visste hva de gjorde. – Neil deGrasse Tyson",
    "aa3a4": "Kode er som humor. Når du må forklare det, er det ille. – Cory House",
    "ab5f7": "Det tristeste ved livet akkurat nå er at vitenskapen samler kunnskap raskere enn samfunnet samler visdom. – Isaac Asimov",
    "ac615": "Få det til å fungere, gjør det riktig, gjør det raskt. – Kent Beck",
    "adcca": "Enhver idiot kan skrive kode som en datamaskin kan forstå. Gode ​​programmerere skriver kode som mennesker kan forstå. – Martin Fowler",
    "af3158": "Alt bestemmes... av krefter som vi ikke har kontroll over. -Albert Einstein",
    "afcb9": "Ingenting har en slik kraft til å utvide sinnet som evnen til å undersøke systematisk og virkelig alt som kommer under din observasjon i livet. – Marcus Aurelius",
    "afe52": "Det er alltid en feil til å fikse. – Ellen Ullman",
    "announcement": "Kunngjøring",
    "b194e": "Innovasjon kommer fra produsenten – ikke fra kunden. -W. Edwards Deming",
    "b19bb": "Den dagen vitenskapen begynner å studere ikke-fysiske fenomener, vil den gjøre mer fremgang i løpet av ett tiår enn i alle de foregående århundrene av sin eksistens. – Nikola Tesla",
    "b2724": "Programmering er kunsten å fortelle et annet menneske hva man vil at datamaskinen skal gjøre. ― Donald Ervin Knuth",
    "b4603": "Livet er det som skjer når du er opptatt med å legge andre planer. - John Lennon",
    "b5014": "Mange av livets fiaskoer er mennesker som ikke skjønte hvor nær de var suksess da de ga opp.– Thomas A. Edison",
    "b7wgrhuXl": "Tech",
    "bc574": "Innovasjon er livsnerven i en sunn virksomhet. - Mark Cuban",
    "bc92f": "Vellykket innovasjon starter med et kundebehov. -Michael Dell",
    "beb6e": "Ideer er enkle. Implementering er vanskelig. -Guy Kawasaki",
    "bfb8e": "Innovasjon er nøkkelen til å forbli relevant og konkurransedyktig i markedet. -Mark Zuckerberg",
    "bjaEuT-cU": "Vert på {0}",
    "c7cfc": "En god test er en som har stor sannsynlighet for å knekke koden hvis det er et problem - Michael Bolton",
    "cae2c": "Innovasjon er prosessen med å ta ideer og gjøre dem til virkelighet. - Neil Lawrence",
    "cd4d1": "Innovasjon er nøkkelen til forretningsvekst. -Andrew R. Steinberg",
    "d0624": "Innovasjon handler ikke bare om å komme opp med nye ideer, men det handler om å gjennomføre dem effektivt. -Jeff Bezos",
    "d10c9": "Innovasjon er nøkkelen til å låse opp nytt potensial og låse opp nye markeder. -Tim Cook",
    "d1820": "Inntil mennesket dupliserer et gresstrå, kan naturen le av hans såkalte vitenskapelige kunnskap. - Thomas Edison",
    "d366a": "Innovasjon er nøkkelen til å låse opp ny vekst. -Philip Kotler",
    "d5LAU": "Lisensiert under AGPLv3",
    "d7dc4": "Testing er prosessen med å evaluere et system eller dets komponent(er) med den hensikt å finne ut om det tilfredsstiller de spesifiserte kravene eller ikke - Anonym",
    "dO6b2Tkqwe": "Nylig brukte verktøy",
    "da74c": "Spekulasjoner og utforskning av ideer utover det vi vet med sikkerhet er det som fører til fremgang. – Lisa Randall",
    "dc662": "Den eneste virkelige feilen er den vi ikke lærer noe av - John Powell",
    "dcebe": "Hvis feilsøking er prosessen med å fjerne programvarefeil, må programmering være prosessen med å sette dem inn - Edsger Dijkstra",
    "ddcc7": "Innovasjon er nøkkelen til suksess i den moderne økonomien. - Satya Nadella",
    "ddsdf3159": "Fysikk er egentlig ikke noe mer enn et søk etter ultimat enkelhet, men så langt er alt vi har en slags elegant rotete. -Bill Bryson",
    "de47c": "Testing er kunsten å finne en svart boks og få den til å synge - James Bach",
    "dldeoeqwc": "Vennlige påminnelser",
    "dnsz7fwNx": "User ID skiller mellom store og små bokstaver.",
    "e097e": "Innovasjon handler om å skape nye muligheter, ikke bare nye produkter. -Tony Robbins",
    "e2379": "Vi lever i et samfunn som er utsøkt avhengig av vitenskap og teknologi, hvor knapt noen vet noe om vitenskap og teknologi. – Carl Sagan",
    "e984f": "Ren kode ser alltid ut som den er skrevet av noen som bryr seg. — Robert C. Martin",
    "ea227": "Den beste måten å forutsi fremtiden er å skape den. -Peter Drucker",
    "ee7d0": "Følelsen av ærefrykt som vitenskapen kan gi oss er en av de høyeste opplevelsene som menneskets psyke er i stand til. – Richard Dawkins",
    "englishcorner": "Engelsk",
    "f0d15": "Datamaskiner er raske; utviklere holder dem trege. – Anonym",
    "f12bb": "Innovasjon er drivkraften bak fremgang i næringslivet. Det er prosessen med å generere nye ideer og gjøre dem om til konkrete produkter, tjenester eller prosesser som gir verdi til kundene.",
    "f23c2": "Innovasjon skiller mellom en leder og en følger. -Steve Jobs",
    "f29b1": "Fremskritt gjøres ved prøving og fiasko; fiaskoene er vanligvis hundre ganger flere enn suksessene, men de blir vanligvis stående ukronisert. – William Ramsay",
    "f3151": "Den største risikoen er å ikke ta noen risiko. -Mark Zuckerberg",
    "f3159": "Matematikk er et spill som spilles etter visse enkle regler med meningsløse merker på papir. -David Hilbert",
    "f315e7": "Matematikk kjenner ingen raser eller geografiske grenser. -David Hilbert",
    "f3160": "Matematikk er øverste dommer; fra dens avgjørelser er det ingen klage. -Tobias Dantzig",
    "f3161": "I matematikk må kunsten å stille et spørsmål ha høyere verdi enn å løse det. -Georg Cantor",
    "f3162": "Matematikk er et sted hvor du kan gjøre ting du ikke kan gjøre i den virkelige verden. - Marcus du Sautoy",
    "f3163": "Matematikkens fremgang og perfeksjon er nært forbundet med statens velstand. -Napoleon Bonaparte",
    "f3164": "Essensen av matematikk ligger i dens frihet. -Georg Cantor",
    "f3165": "Matematikk er vitenskapen om det som er klart i seg selv. -Carl Jacobi",
    "f3166": "Matematikk, rett sett, besitter ikke bare sannhet, men suveren skjønnhet. - Bertrand Russell",
    "f3167": "Matematikk er verktøyet spesielt egnet for å håndtere abstrakte begreper av alle slag. -P. Dirac",
    "f3168": "Matematikk avslører sine hemmeligheter bare for de som nærmer seg den med ren kjærlighet, for sin egen skjønnhet. -Arkimedes",
    "f3169": "Matematikk er den vakreste og mektigste skapelsen av den menneskelige ånd. -Stefan Banach",
    "f3170": "Matematikeren studerer ikke ren matematikk fordi det er nyttig; han studerer det fordi han liker det, og han gleder seg over det fordi det er vakkert. -Henri Poincaré",
    "f3171": "Studiet av matematikk, som Nilen, begynner i minuttet, men ender i storhet. -Charles Caleb Colton",
    "f318e4": "Biologi er den kraftigste teknologien som noen gang er laget. DNA er programvare, protein er maskinvare, celler er fabrikker. -Arvind Gupta",
    "f31d71": "Fysikken er forhåpentligvis enkel. Fysikere er ikke det. -Edward Teller",
    "f31d75": "Fysikk er egentlig ikke noe mer enn et søk etter ultimat enkelhet, men så langt er alt vi har en slags elegant rotete. -Bill Bryson",
    "f31e53": "Matematikk er dronningen av vitenskapene. -Carl Friedrich Gauss",
    "f31q52": "Ren matematikk er på sin måte poesi av logiske ideer. -Albert Einstein",
    "f31q54": "Naturens bok er skrevet på matematikkens språk. -Galileo Galilei",
    "f31q56": "Matematikk er fornuftens musikk. -James Joseph Sylvester",
    "f31q58": "Matematikk handler ikke om tall, ligninger, beregninger eller algoritmer: det handler om forståelse. -William Paul Thurston",
    "f31q70": "Biologi er vitenskapen. Evolusjon er konseptet som gjør biologi unik. - Jared Diamond",
    "f31q72": "Biologi er poesi av den fysiske verden, og menneskelig biologi er poesi av vårt univers. -Julian Casablancas",
    "f31q74": "Biologi er bare fysikk som har begynt å lukte vondt. - Nigel Calder",
    "f31q81": "Fysikk er vitenskapen om bevegelser og handlinger til fysiske kropper unnfanget i form av årsak og virkning. - Arthur Compton",
    "f31qe82": "Biologi er en programvareprosess. Kroppene våre består av billioner av celler, hver styrt av denne prosessen. Du og jeg går rundt med utdatert programvare i kroppen vår, som utviklet seg i en helt annen tid. -Ray Kurzweil",
    "f31r83": "Fysikken blir for vanskelig for fysikerne. -David Hilbert",
    "f31sq66": "Biologi er egentlig kjemi, kjemi er egentlig fysikk, fysikk er egentlig matematikk. - Matt Ridley",
    "f31x76": "Biologi er studiet av de komplekse tingene i universet. Fysikk er studiet av de enkle. -Richard Dawkins",
    "f31x77": "Fysikk er erfaring, ordnet i økonomisk rekkefølge. -Ernst Mach",
    "f3d169": "Fysikk er den eneste virkelige vitenskapen. Resten er bare frimerkeinnsamling. -Ernest Rutherford",
    "f3d179": "Fysikken er i ferd med å bli så utrolig kompleks at det tar lengre og lengre tid å utdanne en fysiker. Det tar faktisk så lang tid å lære opp en fysiker til stedet der han forstår naturen til fysiske problemer at han allerede er for gammel til å løse dem. -Eugene Wigner",
    "f3d180": "Biologi er vitenskapen om livet, men mange av oss forstår ikke det grunnleggende om vår egen kropp. - Kathy Reichs",
    "f3e155": "Matematikk er døren og nøkkelen til realfagene. - Roger Bacon",
    "f3q178": "Biologi er ikke skjebne. Det var aldri mer enn tendens. Det var bare naturens første raske og skitne måte å regne med kjøtt på. Chips er skjebne. -Bart Kosko",
    "f3sd162": "Biologi er studiet av kompliserte ting som ser ut til å være designet med en hensikt. -Richard Dawkins",
    "f3sd164": "Biologi gir deg en hjerne. Livet gjør det til et sinn. -Jeffrey Eugenides",
    "f3sd165": "I fysikk trenger du ikke gå rundt og lage trøbbel for deg selv – naturen gjør det for deg. -Frank Wilczek",
    "f3sq167": "Det som er bra med vitenskap er at det er sant uansett om du tror på det eller ikke. -Neil deGrasse Tyson",
    "f477b": "Programmering er kunsten å algoritmedesign og håndverket å feilsøke feilkode. – Ellen Ullman",
    "f7cf7": "Det er faktisk to ting, vitenskap og mening; den første avler kunnskap, den siste uvitenhet. – Hippokrates",
    "f814a": "Da jeg skrev denne koden, var det bare Gud og jeg som forsto hva jeg gjorde. Nå er det bare Gud som knuter. – Anonym",
    "f96ff": "Innovasjon er driveren for fremgang og suksess i virksomheten. - Satya Nadella",
    "fa94e": "Innovasjon er nøkkelen til å ligge i forkant i konkurranseløpet. -Paul Sloane",
    "fc805": "Innovasjon er kreativitet med en jobb å gjøre. – Tom Peters.",
    "fd3173": "Fysikk er fantasi i en rett jakke. -John Moffat",
    "fdd2b": "Vitenskap er organisert kunnskap. Visdom er organisert liv. – Immanuel Kant",
    "forever-foss": "For alltid FOSS!",
    "giveas3tar": "Gi oss en stjerne på GitHub hvis du liker LafTools.",
    "groupnote": "Memo",
    "hbvxdivMHi": "{0} verktøy totalt",
    "iZXig7E2JF": "LafTools tilbyr en omfattende pakke med utviklingsverktøy, inkludert kodeker, formatere, bildebehandlingsverktøy og datamaskinressursadministrasjonsløsninger. LafTools er designet for å strømlinjeforme og forbedre utviklingsarbeidsflyten din, og er din viktigste ressurs for effektiv programvareutvikling av høy kvalitet.",
    "jRFk519Bj-": "Dette fellesskapet er drevet av et fullstendig internasjonalt gratis åpen kildekodeprosjekt.",
    "jr_7Y98yZ": "LafTools",
    "kUSuP_S-Y": "Prøv med klientgrensesnittet",
    "lWqYc": "Dette nettstedet tilbyr JSON-verktøy inkludert JSON til XML, JSON til CSV, JSON til YAML.",
    "laftoolstitle": "Gratis Online LafTools",
    "lu2T6idPY": "Hvis du tror det er et problem med kontoen din, vennligst kontakt nettredaktøren.",
    "nh1W-": "Testing kan bare bevise tilstedeværelsen av feil, ikke deres fravær - Edsger Dijkstra",
    "nncQE": "Liv",
    "o1ikM3T4c": "Programmerers hjelpere",
    "ob1q-I7s-": "Om LafTools",
    "pNwe3": "Annen",
    "q0zA1kML_": "Online verktøykasse",
    "q3VjkLMsP": "Vennskap, utveksling, samarbeid og utvikling",
    "qHoktx": "Takk skal du ha!",
    "qWemXE4": "1. januar 2024",
    "quality-first": "Kvalitet først",
    "rK6cx": "{0}, designet og utviklet av LafTools-teamet",
    "rzoFmjStq": "Relevante verktøy",
    "sdf3160": "Jobben til teoretikere, spesielt innen biologi, er å foreslå nye eksperimenter. En god teori gir ikke bare spådommer, men overraskende spådommer som så viser seg å være sanne. - Francis Crick",
    "t8DUz20a-": "JSON-formater",
    "title-laftools": "LafTools - Den ledende alt-i-ett-verktøykassen for programmerere",
    "wCcPJZK": "{0} er ikke en gyldig e-post",
    "wCctGPJZK": "{0} skal ikke være tom",
    "wYsKTq7nK": "Klikk meg for å se kildekoden",
    "wi28h5_S2": "kodeker",
    "yCsTC": "For tidlig optimalisering er roten til alt ondt.",
    "zmDWx": "Kontakt oss",
    "zuxd0y-kmA": "Bruker-ID eller PhoneNumber har ingen mellomrom."
}