{
    "123e4567": "Vad är Base64?",
    "1a2b3c4d": "Varför använda Base64?",
    "23fgh456": "Historien om Base64",
    "2bcde3fg": "Nackdelar med Base64",
    "34wxyz56": "Hur man kodar/avkodar Base64 i JavaScript?",
    "4hijk5lm": "Storleksökning: Koddata är ungefär 33 % större än den ursprungliga binära datan.",
    "5e6f7g8h": "Base64 används när binär data behöver överföras genom textbaserade protokoll som e-post eller JSON, eller bäddas in på platser där endast text är tillåten.",
    "6nopqrst": "Ingen kryptering: Base64 är inte en krypteringsmetod; det är lätt att avkoda och ger ingen säkerhet.",
    "78abcdef": "JavaScript erbjuder inbyggda funktioner som btoa() och atob() för Base64-kodning respektive avkodning.",
    "78ijk9lm": "Base64 definierades först i RFC 1421 (1993) och standardiserades senare i RFC 4648 (2006).",
    "9i0j1k2l": "Det används också för att bädda in små bilder direkt i HTML eller CSS som datawebbadresser.",
    "ab9c0d1e": "De primära operationerna inkluderar kodning (konvertera binär till Base64) och avkodning (konvertering av Base64 tillbaka till binär).",
    "abc12345": "Base64 är ett kodningsschema som representerar binär data som en sekvens av ASCII-tecken.",
    "abcdef12": "Hur fungerar Base64?",
    "bcdef01a": "Base64 fungerar genom att dela upp binära data i grupper om 6 bitar och mappa varje grupp till ett specifikt tecken från ett alfabet på 64 tecken (A-Za-z0-9+/).",
    "cbaq54321": "Nej, Base64 är inte en komprimeringsteknik, den ändrar bara representationen av data inte dess storlek.",
    "cdefg234": "Utfyllnadstecken (=) läggs till i slutet för att säkerställa att den kodade datalängden är en multipel av 4 tecken.",
    "efg45678": "Jämförelse med Base32",
    "efghi678": "Denna variant används ofta för filnamn, URL:er eller situationer där specialtecken måste undvikas.",
    "fghi6789": "Den används för att överföra eller lagra binära filer i textbaserade format, vilket säkerställer kompatibilitet mellan olika system.",
    "hij90klm": "Base32 använder ett mindre alfabet (A-Z2-7), vilket resulterar i längre men mer läsbara strängar.",
    "mno34567": "Fördelar med Base64",
    "mnoijklm": "Finns det andra BaseXX-kodningar?",
    "n0pqrstu": "Exempel på användning av Base64",
    "nopqrs01": "Medan Base64 optimerar för kompakthet, väljs Base32 när minimering av inmatningsfel, som manuell inmatning, är avgörande.",
    "pqrs890t": "Universell kompatibilitet: Base64 är allmänt erkänd och stöds i alla större programmeringsspråk.",
    "qrstuvwx": "Ja, förutom Base64 och Base32 finns det också Base16 (hexadecimal), Base58 och Base85, var och en designad för olika scenarier.",
    "tuv23456": "Base64 URL säker variant",
    "u7vwx8yz": "Vanliga Base64-operationer",
    "uvwxyza1": "Ingen dataförlust: Eftersom det är en reversibel process, resulterar Base64-kodning inte i någon förlust av information.",
    "vwx1yza2": "Ett exempel är att koda en bildfil för att bädda in den i en HTML-tagg <img>:",
    "wxyzabcd": "Det finns en URL-säker version av Base64 som ersätter '+' med '-' och '/' med '_' och utelämnar utfyllnad av '=', vilket gör den lämplig för webbadresser.",
    "zyx98765": "Kan Base64 användas för komprimering?"
}