{
    "123e4567": "Base64 nedir?",
    "1a2b3c4d": "Base64'ü neden kullanmalısınız?",
    "23fgh456": "Base64'ün Tarihçesi",
    "2bcde3fg": "Base64'ün dezavantajları",
    "34wxyz56": "Base64'ü JavaScript'te nasıl kodlayabilirim/kodunu çözebilirim?",
    "4hijk5lm": "Boyut Artışı: Kodlanmış veriler, orijinal ikili verilerden yaklaşık %33 daha büyüktür.",
    "5e6f7g8h": "Base64, ikili verilerin e-posta veya JSON gibi metin tabanlı protokoller aracılığıyla iletilmesi veya yalnızca metnin izin verildiği yerlere yerleştirilmesi gerektiğinde kullanılır.",
    "6nopqrst": "Şifreleme Yok: Base64 bir şifreleme yöntemi değildir; kodu kolayca çözülür ve hiçbir güvenlik sağlamaz.",
    "78abcdef": "JavaScript, Base64 kodlama ve kod çözme için sırasıyla btoa() ve atob() gibi yerleşik işlevler sunar.",
    "78ijk9lm": "Base64 ilk olarak RFC 1421'de (1993) tanımlanmış ve daha sonra RFC 4648'de (2006) standartlaştırılmıştır.",
    "9i0j1k2l": "Ayrıca küçük resimleri doğrudan HTML veya CSS'ye veri URL'leri olarak gömmek için de kullanılır.",
    "ab9c0d1e": "Birincil işlemler arasında kodlama (ikiliyi Base64'e dönüştürme) ve kod çözme (Base64'ü tekrar ikiliye dönüştürme) bulunur.",
    "abc12345": "Base64, ikili verileri ASCII karakter dizisi olarak temsil eden bir kodlama şemasıdır.",
    "abcdef12": "Base64 nasıl çalışır?",
    "bcdef01a": "Base64, ikili verileri 6 bitlik gruplara bölerek ve her grubu 64 karakterlik bir alfabeden (A-Za-z0-9+/) belirli bir karakterle eşleştirerek çalışır.",
    "cbaq54321": "Hayır, Base64 bir sıkıştırma tekniği değildir; verinin boyutunu değil yalnızca temsilini değiştirir.",
    "cdefg234": "Kodlanmış veri uzunluğunun 4 karakterin katı olmasını sağlamak için sonuna dolgu karakterleri (=) eklenir.",
    "efg45678": "Base32 ile Karşılaştırma",
    "efghi678": "Bu değişken genellikle dosya adları, URL'ler veya özel karakterlerden kaçınılması gereken durumlar için kullanılır.",
    "fghi6789": "Çeşitli sistemler arasında uyumluluk sağlayarak ikili dosyaları metin tabanlı formatlarda iletmek veya depolamak için kullanılır.",
    "hij90klm": "Base32 daha küçük bir alfabe (A-Z2-7) kullanır, bu da daha uzun ancak insan tarafından daha okunabilir dizelerle sonuçlanır.",
    "mno34567": "Base64'ün Avantajları",
    "mnoijklm": "Başka BaseXX kodlamaları var mı?",
    "n0pqrstu": "Base64'ün örnek kullanımı",
    "nopqrs01": "Base64 kompaktlık için optimize ederken, manuel giriş gibi giriş hatalarının en aza indirilmesi kritik öneme sahip olduğunda Base32 seçilir.",
    "pqrs890t": "Evrensel Uyumluluk: Base64, tüm önemli programlama dillerinde yaygın olarak tanınmakta ve desteklenmektedir.",
    "qrstuvwx": "Evet, Base64 ve Base32'nin yanı sıra her biri farklı senaryolara göre tasarlanmış Base16 (Hexadecimal), Base58 ve Base85 de mevcut.",
    "tuv23456": "Base64 URL güvenli varyantı",
    "u7vwx8yz": "Ortak Base64 işlemleri",
    "uvwxyza1": "Veri Kaybı Yok: Base64 kodlaması geri dönüşümlü bir işlem olduğundan herhangi bir bilgi kaybına neden olmaz.",
    "vwx1yza2": "Bir örnek, bir görüntü dosyasını bir HTML <img> etiketine gömmek için kodlamaktır:",
    "wxyzabcd": "Base64'ün, '+' yerine '-' ve '/' yerine '_' koyan ve '=' dolgusunu atlayarak onu web URL'leri için uygun hale getiren URL güvenli bir sürümü vardır.",
    "zyx98765": "Base64 sıkıştırma için kullanılabilir mi?"
}