{
    "15424": "Det er hele problemet med videnskab. Du har en flok empirister, der forsøger at beskrive ting af ufattelig undren. – Bill Watterson",
    "15999": "Innovation er processen med at lave ændringer i noget etableret. -Innovationsdefinitionsteam",
    "16987": "Nogle gange kan det betale sig at blive i sengen om mandagen i stedet for at bruge resten af ​​ugen på at fejlsøge mandagens kode. – Dan Salomon",
    "19775": "Videnskab er en livsstil. Det er et perspektiv. Videnskab er den proces, der tager os fra forvirring til forståelse på en måde, der er præcis, forudsigelig og pålidelig - en transformation, for dem, der er heldige nok til at opleve den, som er bemyndigende og følelsesmæssig. – Brian Greene",
    "38127": "Test er processen med at forsøge at bryde koden - Anonym",
    "42641": "Webudvikling er svært, kun da er det sjovt at lave. Du skal bare sætte dine standarder. Hvis det skulle være nemt, ville nogen gøre det? - Olawale Daniel",
    "46367": "Innovation er nøglen til at frigøre vækstpotentiale. -Omar Ishrak",
    "57225": "Innovation er livsnerven i en blomstrende virksomhed. -Michael Dell",
    "63470": "En rigtig videnskabsmand løser problemer, ikke jamrer over, at de er uløselige. – Anne McCaffrey",
    "66187": "Snak er billigt. Vis mig koden. — Linus Torvalds",
    "68518": "Software og katedraler er meget det samme - først bygger vi dem, så beder vi.",
    "77528": "Innovation er drivkraften bag fremskridt. -John F. Kennedy",
    "80972": "Selvfølgelig kan dårlig kode ryddes op. Men det er meget dyrt. — Robert C. Martin",
    "85805": "En ekspert er en person, der har begået alle de fejl, der kan begås på et meget snævert felt. – Neils Bohr",
    "92941": "Der er ægte poesi i den virkelige verden. Videnskab er virkelighedens poesi. – Richard Dawkins",
    "-wHWkv2OC": "Hvorfor kan jeg ikke logge ind?",
    "-wdkeq": "Er dette fællesskab non-profit?",
    "00d36": "Den bedste måde at forudsige fremtiden er at opfinde den. -Alan Kay",
    "09m6vG51A": "under udvikling",
    "0a310": "Der er ingen kongevej til videnskaben, og kun dem, der ikke frygter den trættende stigning på dens stejle stier, har en chance for at nå dens lysende toppe. – Karl Marx",
    "0a710": "Innovation er livsnerven i enhver organisation. - Dr. R. L. Bhatia",
    "0ba15": "Succesfuld innovation kræver at tage kalkulerede risici. - Harvard Pruden",
    "0e299": "Alt er teoretisk umuligt, før det er gjort. – Robert A. Heinlein",
    "114ee": "Kodning som poesi skal være kort og koncis. - Santosh Kalwar",
    "13pmE": "Støt os",
    "149c0": "I videnskabsspørgsmål er tusindvis af autoritet ikke værd for et enkelt individs ydmyge ræsonnement. – Galileo Galilei",
    "1883d": "Videnskab er langt mere stimulerende for fantasien end klassikerne. – J. B. S. Haldane",
    "188cd": "Programmering læres ved at skrive programmer. - Brian Kernighan",
    "18f46": "Raketter er seje. Det er der ingen udenom. – Elon Musk",
    "1a8b9": "Videnskabsmanden er ikke en person, der giver de rigtige svar, han er en, der stiller de rigtige spørgsmål. – Claude Levi-Strauss",
    "1d71a": "Vi er født på et givet tidspunkt, på et givet sted, og ligesom årgangsår med vin har vi kvaliteterne fra det år og den årstid, vi er født af. Astrologi gør ikke krav på noget mere. – Carl Jung",
    "1da5a": "Innovation er grundlaget for fremskridt og succes i den moderne forretningsverden. -Larry Page",
    "1ff27": "Videnskab er det, vi forstår godt nok til at forklare til en computer; kunst er alt andet. – Donald E. Knuth",
    "22f3a": "Innovation er det centrale spørgsmål i økonomisk velstand. – Michael Porter",
    "23f61": "Innovation handler ikke kun om at have en god idé; det handler om at gøre den idé til virkelighed. - Erik Qualman",
    "277a9": "Videnskaben kan ikke løse naturens ultimative mysterium. Og det er, fordi vi i sidste ende selv er en del af mysteriet, som vi forsøger at løse. – Max Planck",
    "27ef9": "Innovation er evnen til at konvertere ideer til fakturaer. -L. Duncan",
    "2S_7EVIsK": "JSON Validator",
    "2b7f7": "Jeg er sikker på, at universet er fuld af intelligent liv. Det har bare været for intelligent at komme her. – Arthur C. Clarke",
    "321e0": "Debugging er dobbelt så svært som at skrive koden i første omgang. Derfor, hvis du skriver koden så smart som muligt, er du per definition ikke klog nok til at debugge den - Brian W. Kernighan",
    "32c8d": "Hvis fejlretning er processen med at fjerne fejl, så skal programmering være processen med at sætte dem ind. – Sam Redwine",
    "33aa4": "Videnskab er blot ren empiri, og i kraft af sin metode udelukker den metafysik. – Steve Martin",
    "380da": "Programmering i dag er et kapløb mellem softwareingeniører, der stræber efter at bygge større og bedre idiotsikre programmer, og universet, der forsøger at producere større og bedre idioter. Indtil videre vinder universet. - Rick Cook",
    "394b6": "Hvis du troede, at videnskaben var sikker? godt, det er bare en fejl fra din side. – Richard Feynman",
    "398cc": "Programmører ser ud til at ændre verden. Det ville være en lettelse, for dem og for os alle, hvis de vidste noget om det. – Ellen Ullman",
    "3I-dkqkwr": "Bemærk, at vi IKKE tilbyder kommercielle træningskurser til engelskeksamener eller andre fageksamener på denne hjemmeside, og vi planlægger ikke at gøre det i fremtiden.",
    "3d297": "Det, jeg elsker ved videnskab, er, at når du lærer, får du ikke rigtig svar. Du får bare bedre spørgsmål. – John Green",
    "40b7f": "Innovation er den eneste måde at vinde på i det lange løb. -Jeff Immelt",
    "420b0": "Succesfuld innovation kræver en forpligtelse til samarbejde og åben kommunikation. -Rachel D. Ellison",
    "43be5": "Dagbog",
    "43e45": "Der er ingen lov undtagen loven, der er ingen lov. – John Archibald Wheeler",
    "45cb0": "Innovation handler ikke kun om at skabe nye ideer, men det handler også om at eksekvere dem med succes. -Arun Pandit",
    "4N79HNWiA": "For at sikre, at det er et non-profit-fællesskab, åbner vi også hele kildekoden på GitHub, som kan findes nederst på denne side.",
    "4PIqD": "Kodegennemgang",
    "4cf03": "Faktisk alt, hvad der kan kendes som et tal; for det er umuligt at fatte noget med sindet eller at erkende det uden dette. – Philolaus",
    "4d389": "Innovation er en livsstil for den succesrige iværksætter. - John Rampton",
    "4da84": "Du tror måske ikke, at programmører er kunstnere, men programmering er et ekstremt kreativt erhverv. Det er logikbaseret kreativitet. – John Romero",
    "4sQWoTgfr": "Bekræftelseskoden er udløbet. Opdater siden og prøv igen",
    "4sdQWoTgfr": "Bekræftelseskoden er udløbet. Opdater siden og prøv igen.",
    "4vdfwf": "Okay",
    "532fd": "Innovation er evnen til at se forandring som en mulighed, ikke en trussel. -Steve Jobs",
    "57eaa": "Vi er bare en avanceret race af aber på en mindre planet af en meget gennemsnitlig stjerne. Men vi kan forstå universet. Det gør os til noget helt særligt. – Stephen Hawking",
    "58c03": "Innovation er en nøglefaktor for enhver virksomheds succes. -Ravi Venkatesan",
    "58c5f": "Hvis det i første omgang ikke lykkes, så kald det version 1.0. - Khayri R.R. Woulfe",
    "59f7d": "Innovation er katalysatoren for fremskridt og vækst. - John Donahoe",
    "5a8a1": "Innovation er processen med at tage en idé og omsætte den til virkelighed. -Kevin O'Leary",
    "5db54": "Videnskaben er den store modgift mod giften af ​​entusiasme og overtro. – Adam Smith",
    "5qPOJL": "For at understøtte LafTools kan du overveje enten at give en stjerne til vores lager på GitHub eller at opgradere til vores professionelle version gennem et månedligt abonnement. Vi ville sætte stor pris på din hjælp, og vi lover, at LafTools bliver endnu bedre med de indsamlede midler.",
    "626bf": "Hvis vi vidste, hvad det var, vi lavede, ville det ikke blive kaldt forskning, vel? - Albert Einstein",
    "63d47": "Kvalitet er et produkt af en konflikt mellem programmører og testere. - Yegor Bugayenk",
    "662f9": "Du lever kun en gang men hvis du gør det korrekt er en gang nok. — Mae West",
    "66ef1": "God kode er dens egen bedste dokumentation. Mens du er ved at tilføje en kommentar, så spørg dig selv: 'Hvordan kan jeg forbedre koden, så denne kommentar ikke er nødvendig? ' - Steve McConnell",
    "66f12": "Videnskab er organiseret viden. Visdom er organiseret liv. – Will Durant",
    "6a0da": "Kunsten og videnskaben at stille spørgsmål er kilden til al viden. – Thomas Berger",
    "6hsnqWe": "Selvom LafTools er gratis og open source, kræver det stadig en betydelig mængde tid og energi at vedligeholde det. Især har vi brug for midler til at betale for visse cloud API'er. Hvis du sætter pris på LafTools, kan du overveje at støtte os.",
    "71L3OI9T7": "At gennemskue fred, fremme samarbejde og søge udvikling er blevet temaet for den nuværende æra.",
    "72bee": "Jeg er ikke en stor programmør; Jeg er bare en god programmør med gode vaner. - Kent Beck",
    "74a91": "Test fører til fiasko, og fiasko fører til forståelse - Burt Rutan",
    "74f90": "Videnskaben i dag er fremtidens teknologi. – Edward Teller",
    "7714b": "Innovation er nøglen til at frigøre nye muligheder og drive vækst.",
    "79f2d": "De fleste gode programmører programmerer ikke, fordi de forventer at blive betalt eller blive beæret af offentligheden, men fordi det er sjovt at programmere. – Linus Torvalds",
    "7affb": "Verden vil ikke vente på os. Den teknologiske revolution vil efterlade os, hvis vi ikke indhenter det. – Kofi Annan",
    "7c59e": "Erfaring er det navn, alle giver til deres fejl. – Oscar Wilde",
    "7d4e4": "Innovation handler om at finde nye og bedre måder at gøre tingene på. -Jim Rohn",
    "7e19d": "Forvirring er en del af programmering. - Felienne Hermans",
    "7flKa": "LafTools - Den almægtige for alle fagfolk og ingeniører",
    "7zqdufsdddJ": "Ja helt sikkert. Hjemmesiden ELB3.com er afledt af den almennyttige WeChat-chatgruppe, {0}, som har til formål at skabe en venlig, ads-fri og behagelig atmosfære for engelsk læring.",
    "8259a": "Programmer: En maskine, der forvandler kaffe til kode. – Anonym",
    "850c1": "Videnskabsmanden påtvinger kun to ting, nemlig sandhed og oprigtighed, påtvinger dem sig selv og andre videnskabsmænd. - Erwin Schrödinger",
    "8582b": "Hvis vi ønsker, at brugerne kan lide vores software, bør vi designe den, så den opfører sig som en sympatisk person. – Alan Cooper",
    "8692e": "Der er mange pludrere, fuldstændig uvidende om matematik, som vover at fordømme min hypotese på autoritet fra en eller anden del af Bibelen, der er fordrejet for at passe til deres formål. Jeg værdsætter dem ikke og foragter deres ubegrundede dom. – Nicholas Copernicus",
    "886d1": "Vi føler, at selvom alle mulige videnskabelige spørgsmål bliver besvaret, er livets problemer stadig ikke blevet berørt overhovedet. – Ludwig Wittgenstein",
    "8HcQxKgho": "Hurtig adgang",
    "8c224": "Uanset hvilket arbejdsområde du ønsker at gå i, er det af stor betydning at lære mindst ét ​​programmeringssprog. - Ram Ray",
    "8e5d0": "Innovation er fremtidens opfordring. – Kofi Annan",
    "90b5e": "Det er ikke en fejl; det er en udokumenteret funktion. - Anonym",
    "91f08": "Det bedste ved teknologi er, at det giver dig mulighed for at koncentrere dig om dit syn og glemme maskineriet. – John Landis",
    "9251d": "Innovation er en nøglefaktor i enhver virksomheds evne til at få succes på lang sigt. - Elon Musk",
    "92b29": "Innovation er processen med at tage en kreativ idé og gøre den til en kommerciel succes. -Richard Branson",
    "9334e": "Den største herlighed ved at leve ligger ikke i aldrig at falde, men i at rejse os hver gang vi falder. - Nelson Mandela",
    "9412b": "Først skal du løse problemet. Skriv derefter koden. – John Johnson",
    "9469a": "Alle burde lære at programmere en computer, fordi den lærer dig at tænke. - Steve Jobs",
    "98d3f": "Videnskab er magi, der virker. – Kurt Vonnegut",
    "9YPgsPid2M": "SMS kode",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Base64 Encoder",
    "9b_7a0sdf": "Base64 dekoder",
    "9cb71": "Innovation handler om at skabe værdi for kunderne og forbedre deres liv. -Reed Hastings",
    "9d18a": "Software kommer fra himlen, når du har god hardware. – Ken Olsen",
    "Abi2k2cP7": "Beklager, denne side er endnu ikke færdig.",
    "BP2jBlIE0": "Nogle links er stadig utilgængelige, da LafTools stadig er under udvikling, giv os venligst en stjerne for at abonnere på den seneste opdatering på GitHub.",
    "BQs6go-dk": "Gratis download LafTools til Windows, Linux og macOS.",
    "Bz_WdwvAPn": "Tjek, om CAPTCHA er angivet korrekt.",
    "C_qzLO7yw": "Brug venligst Chrome, Firefox eller Edge for den bedste oplevelse.",
    "CidOqAZ": "Som skaberen af ​​LafTools er jeg så rørt over, at du er villig til at støtte os. Vi har gode folk på vores team, som arbejder hårdt for løbende at forbedre LafTools.",
    "CqFdiBu6M": "Udsigt",
    "CuHqw9m": "{0} er ikke et gyldigt telefonnummer. Systemet accepterer i øjeblikket kun et 11-cifret telefonnummer.",
    "Ezsn81tfc": "Udsigt",
    "GaySMPQHo": "Trending",
    "H39ddc0df": "Prøv at logge ind senere, hvis det mislykkedes for mange gange.",
    "HaU4NMabv": "Bekræftelseskoden er forkert. Indtast venligst eller opdater billedet igen.",
    "HckK__LH2": "Mere",
    "Ibzs2-Ho1": "CSV-værktøjer",
    "IugAFc4OT": "Der er opstået et problem under indsendelse af dine data.",
    "Jbor69IBw": "Formatere",
    "N9bCERU1Q": "Intern driftsside for LafTools",
    "NdqZcRL2QN": "Hvis du har glemt din adgangskode, kan du nulstille den ved at klikke på linket 'Glemt adgangskode'.",
    "OBjaZqTvx": "Hjem",
    "OQWm4": "Anmeld en fejl",
    "TET4xnxBT": "Påskeæg",
    "TmvHUnZzQ": "Kopierede sidens URL til udklipsholder",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Hjem",
    "V6U_f": "Servicevilkår",
    "WKG7e": "Regler",
    "ZCzH8": "Nyeste",
    "ZaS8MP8cr": "Bemærk: Bekræftelseskoden er opdateret. Juster venligst dine formularværdier og indtast koden igen for at fortsætte med.",
    "ZbD3F": "{0}, lavet af LafTools-teamet",
    "a0ab0": "Kunst er livets træ. Videnskaben er dødens træ. – William Blake",
    "a2849": "Videnskab er accepten af ​​det, der virker, og afvisningen af ​​det, der ikke gør. Det kræver mere mod, end vi måske tror. – Jacob Bronowski",
    "a3508": "Udstyret med sine fem sanser udforsker mennesket universet omkring sig og kalder eventyret Videnskab. – Edwin Hubble",
    "a5354": "Det er mærkeligt, at kun ekstraordinære menneskeskabte opdagelser, der rykker senere, fremstår så lette og enkle. – George C. Lichtenberg",
    "a7062": "Innovation er gnisten, der tænder fremskridt. -Robyn M. D'Angelo",
    "a8a34": "Innovation er fremtidens visitkort. - Anna Eshoo",
    "a8dd9": "Livet kan ikke have en tilfældig begyndelse... problemet er, at der er omkring 2000 enzymer, og chancen for at opnå dem alle i et tilfældigt forsøg er kun en del ud af 10^40.000, en uhyrligt lille sandsynlighed, der ikke kunne overstås, selvom hele universet bestod af økologisk suppe. – Fred Hoyle",
    "aUdtds_qwY": "Normalt kan du logge ind med dit bruger-id eller telefonnummer, selvom du har overtrådt reglerne i dette fællesskab.",
    "aa2f1": "Udforskning er, hvad du gør, når du ikke ved, hvad du laver. Det er, hvad videnskabsmænd gør hver dag. Hvis en videnskabsmand allerede vidste, hvad de lavede, ville de ikke opdage noget, fordi de allerede vidste, hvad de lavede. – Neil deGrasse Tyson",
    "aa3a4": "Kode er ligesom humor. Når du skal forklare det, er det slemt. – Cory House",
    "ab5f7": "Det mest sørgelige aspekt af livet lige nu er, at videnskaben indsamler viden hurtigere, end samfundet indsamler visdom. – Isaac Asimov",
    "ac615": "Få det til at fungere, gør det rigtigt, gør det hurtigt. – Kent Beck",
    "adcca": "Ethvert fjols kan skrive kode, som en computer kan forstå. Gode ​​programmører skriver kode, som mennesker kan forstå. - Martin Fowler",
    "af3158": "Alt er bestemt... af kræfter, som vi ikke har kontrol over. -Albert Einstein",
    "afcb9": "Intet har en sådan kraft til at udvide sindet som evnen til systematisk og virkelig at undersøge alt, hvad der kommer under din observation i livet. – Marcus Aurelius",
    "afe52": "Der er altid en fejl mere, der skal rettes. – Ellen Ullman",
    "announcement": "Bekendtgørelse",
    "b194e": "Innovation kommer fra producenten – ikke fra kunden. -W. Edwards Deming",
    "b19bb": "Den dag videnskaben begynder at studere ikke-fysiske fænomener, vil den gøre flere fremskridt på et årti end i alle de foregående århundreder af dens eksistens. – Nikola Tesla",
    "b2724": "Programmering er kunsten at fortælle et andet menneske, hvad man vil have computeren til at gøre. - Donald Ervin Knuth",
    "b4603": "Livet er, hvad der sker, når du har travlt med at lægge andre planer. - John Lennon",
    "b5014": "Mange af livets fiaskoer er mennesker, der ikke var klar over, hvor tæt de var på succes, da de gav op.– Thomas A. Edison",
    "b7wgrhuXl": "Tech",
    "bc574": "Innovation er livsnerven i en sund virksomhed. - Mark Cuban",
    "bc92f": "Succesfuld innovation starter med et kundebehov. -Michael Dell",
    "beb6e": "Ideer er nemme. Implementeringen er svær. - Fyr Kawasaki",
    "bfb8e": "Innovation er nøglen til at forblive relevant og konkurrencedygtig på markedet. -Mark Zuckerberg",
    "bjaEuT-cU": "Hostet på {0}",
    "c7cfc": "En god test er en, der har stor sandsynlighed for at knække koden, hvis der er et problem - Michael Bolton",
    "cae2c": "Innovation er processen med at tage ideer og omsætte dem til virkelighed. - Neil Lawrence",
    "cd4d1": "Innovation er nøglen til forretningsvækst. -Andrew R. Steinberg",
    "d0624": "Innovation handler ikke kun om at komme med nye ideer, men det handler om at eksekvere dem effektivt. -Jeff Bezos",
    "d10c9": "Innovation er nøglen til at frigøre nyt potentiale og frigøre nye markeder. -Tim Cook",
    "d1820": "Indtil mennesket dublerer et græsstrå, kan naturen grine af hans såkaldte videnskabelige viden. – Thomas Edison",
    "d366a": "Innovation er nøglen til at frigøre ny vækst. -Philip Kotler",
    "d5LAU": "Licenseret under AGPLv3",
    "d7dc4": "Test er processen med at evaluere et system eller dets komponent(er) med den hensigt at finde ud af, om det opfylder de specificerede krav eller ej - Anonym",
    "dO6b2Tkqwe": "Nyligt brugte værktøjer",
    "da74c": "Spekulation og udforskning af ideer ud over det, vi ved med sikkerhed, er det, der fører til fremskridt. – Lisa Randall",
    "dc662": "Den eneste rigtige fejl er den, som vi intet lærer af - John Powell",
    "dcebe": "Hvis debugging er processen med at fjerne softwarefejl, så skal programmering være processen med at sætte dem ind - Edsger Dijkstra",
    "ddcc7": "Innovation er nøglen til succes i den moderne økonomi. - Satya Nadella",
    "ddsdf3159": "Fysik er virkelig ikke andet end en søgen efter ultimativ enkelhed, men indtil videre er alt, hvad vi har, en slags elegant rodet. -Bill Bryson",
    "de47c": "Test er kunsten at finde en sort boks og få den til at synge - James Bach",
    "dldeoeqwc": "Venlige påmindelser",
    "dnsz7fwNx": "Bruger-id skelner mellem store og små bogstaver.",
    "e097e": "Innovation handler om at skabe nye muligheder, ikke kun nye produkter. -Tony Robbins",
    "e2379": "Vi lever i et samfund, der er udsøgt afhængig af videnskab og teknologi, hvor næsten ingen ved noget om videnskab og teknologi. – Carl Sagan",
    "e984f": "Ren kode ser altid ud, som om den er skrevet af en, der bekymrer sig. — Robert C. Martin",
    "ea227": "Den bedste måde at forudsige fremtiden er at skabe den. -Peter Drucker",
    "ee7d0": "Følelsen af ​​ærefrygt undren, som videnskaben kan give os, er en af ​​de højeste oplevelser, som den menneskelige psyke er i stand til. – Richard Dawkins",
    "englishcorner": "engelsk",
    "f0d15": "Computere er hurtige; udviklere holder dem langsomme. – Anonym",
    "f12bb": "Innovation er drivkraften bag fremskridt i erhvervslivet. Det er processen med at generere nye ideer og omdanne dem til håndgribelige produkter, tjenester eller processer, der leverer værdi til kunderne.",
    "f23c2": "Innovation skelner mellem en leder og en følger. -Steve Jobs",
    "f29b1": "Fremskridt sker ved prøvelse og fiasko; fiaskoerne er generelt hundrede gange flere end succeserne, men de efterlades normalt ukroniseret. – William Ramsay",
    "f3151": "Den største risiko er ikke at tage nogen risiko. -Mark Zuckerberg",
    "f3159": "Matematik er et spil, der spilles efter visse enkle regler med meningsløse mærker på papir. -David Hilbert",
    "f315e7": "Matematik kender ingen racer eller geografiske grænser. -David Hilbert",
    "f3160": "Matematik er den øverste dommer; dens afgørelser er der ingen klage over. -Tobias Dantzig",
    "f3161": "I matematik skal kunsten at stille et spørgsmål have større værdi end at løse det. -Georg Cantor",
    "f3162": "Matematik er et sted, hvor du kan gøre ting, som du ikke kan i den virkelige verden. - Marcus du Sautoy",
    "f3163": "Matematikkens fremskridt og perfektion er tæt forbundet med statens velstand. -Napoleon Bonaparte",
    "f3164": "Essensen af ​​matematik ligger i dens frihed. -Georg Cantor",
    "f3165": "Matematik er videnskaben om, hvad der er klart i sig selv. -Carl Jacobi",
    "f3166": "Matematik, rigtigt set, besidder ikke kun sandhed, men suveræn skønhed. - Bertrand Russell",
    "f3167": "Matematik er værktøjet specielt velegnet til at håndtere abstrakte begreber af enhver art. -P. Dirac",
    "f3168": "Matematik afslører kun sine hemmeligheder for dem, der nærmer sig den med ren kærlighed, for sin egen skønhed. -Arkimedes",
    "f3169": "Matematik er den smukkeste og mest kraftfulde skabelse af den menneskelige ånd. -Stefan Banach",
    "f3170": "Matematikeren studerer ikke ren matematik, fordi det er nyttigt; han studerer det, fordi han nyder det, og han glæder sig over det, fordi det er smukt. -Henri Poincaré",
    "f3171": "Studiet af matematik, ligesom Nilen, begynder i minuthed, men ender i storslåethed. -Charles Caleb Colton",
    "f318e4": "Biologi er den mest kraftfulde teknologi, der nogensinde er skabt. DNA er software, protein er hardware, celler er fabrikker. -Arvind Gupta",
    "f31d71": "Fysik er forhåbentlig simpel. Fysikere er ikke. -Edward Teller",
    "f31d75": "Fysik er virkelig ikke andet end en søgen efter ultimativ enkelhed, men indtil videre er alt, hvad vi har, en slags elegant rodet. -Bill Bryson",
    "f31e53": "Matematik er naturvidenskabernes dronning. -Carl Friedrich Gauss",
    "f31q52": "Ren matematik er på sin måde de logiske ideers poesi. -Albert Einstein",
    "f31q54": "Naturens bog er skrevet på matematikkens sprog. -Galileo Galilei",
    "f31q56": "Matematik er fornuftens musik. -James Joseph Sylvester",
    "f31q58": "Matematik handler ikke om tal, ligninger, beregninger eller algoritmer: det handler om forståelse. -William Paul Thurston",
    "f31q70": "Biologi er videnskaben. Evolution er konceptet, der gør biologi unik. - Jared Diamond",
    "f31q72": "Biologi er poesi af den fysiske verden, og menneskelig biologi er poesi i vores univers. -Julian Casablancas",
    "f31q74": "Biologi er bare fysik, der er begyndt at lugte dårligt. - Nigel Calder",
    "f31q81": "Fysik er videnskaben om fysiske kroppes bevægelser og handlinger udtænkt i form af årsag og virkning. - Arthur Compton",
    "f31qe82": "Biologi er en softwareproces. Vores kroppe består af billioner af celler, som hver især er styret af denne proces. Du og jeg går rundt med forældet software kørende i vores kroppe, som udviklede sig i en meget anden æra. -Ray Kurzweil",
    "f31r83": "Fysik er ved at blive for svært for fysikerne. -David Hilbert",
    "f31sq66": "Biologi er virkelig kemi, kemi er virkelig fysik, fysik er virkelig matematik. - Matt Ridley",
    "f31x76": "Biologi er studiet af de komplekse ting i universet. Fysik er studiet af de simple. -Richard Dawkins",
    "f31x77": "Fysik er erfaring, arrangeret i økonomisk rækkefølge. -Ernst Mach",
    "f3d169": "Fysik er den eneste rigtige videnskab. Resten er blot frimærkeindsamling. -Ernest Rutherford",
    "f3d179": "Fysikken er ved at blive så ufatteligt kompleks, at det tager længere og længere tid at uddanne en fysiker. Det tager faktisk så lang tid at uddanne en fysiker til det sted, hvor han forstår naturen af ​​fysiske problemer, at han allerede er for gammel til at løse dem. -Eugene Wigner",
    "f3d180": "Biologi er videnskaben om livet, men mange af os forstår ikke det grundlæggende i vores egen krop. - Kathy Reichs",
    "f3e155": "Matematik er døren og nøglen til naturvidenskaberne. - Roger Bacon",
    "f3q178": "Biologi er ikke skæbne. Det var aldrig mere end tendens. Det var bare naturens første hurtige og beskidte måde at beregne kød på. Chips er skæbne. -Bart Kosko",
    "f3sd162": "Biologi er studiet af komplicerede ting, der ser ud til at være designet med et formål. -Richard Dawkins",
    "f3sd164": "Biologi giver dig en hjerne. Livet gør det til et sind. - Jeffrey Eugenides",
    "f3sd165": "I fysik behøver du ikke gå rundt og lave ballade for dig selv – naturen gør det for dig. - Frank Wilczek",
    "f3sq167": "Det gode ved videnskab er, at det er sandt, uanset om du tror på det eller ej. -Neil deGrasse Tyson",
    "f477b": "Programmering er kunsten at algoritmedesign og håndværket til at fejlfinde fejlagtig kode. – Ellen Ullman",
    "f7cf7": "Der er faktisk to ting, videnskab og mening; den første avler viden, den anden uvidenhed. – Hippokrates",
    "f814a": "Da jeg skrev denne kode, var det kun Gud og jeg, der forstod, hvad jeg gjorde. Nu er det kun Gud, der knuder. – Anonym",
    "f96ff": "Innovation er drivkraften bag fremskridt og succes i erhvervslivet. - Satya Nadella",
    "fa94e": "Innovation er nøglen til at være foran i konkurrencen. -Paul Sloane",
    "fc805": "Innovation er kreativitet med et job at udføre. – Tom Peters.",
    "fd3173": "Fysik er fantasi i en spændejakke. - John Moffat",
    "fdd2b": "Videnskab er organiseret viden. Visdom er organiseret liv. – Immanuel Kant",
    "forever-foss": "For evigt FOSS!",
    "giveas3tar": "Giv os en stjerne på GitHub, hvis du kan lide LafTools.",
    "groupnote": "Memo",
    "hbvxdivMHi": "{0} værktøjer i alt",
    "iZXig7E2JF": "LafTools tilbyder en omfattende suite af udviklingsværktøjer, herunder codecs, formatere, billedbehandlingsværktøjer og løsninger til computerressourcestyring. Designet til at strømline og forbedre dit udviklingsworkflow, er LafTools din foretrukne ressource til effektiv softwareudvikling af høj kvalitet.",
    "jRFk519Bj-": "Dette fællesskab er drevet af et fuldt internationalt gratis open source-kodeprojekt.",
    "jr_7Y98yZ": "LafTools",
    "kUSuP_S-Y": "Prøv med Client UI",
    "lWqYc": "Denne hjemmeside tilbyder JSON-værktøjer, herunder JSON til XML, JSON til CSV, JSON til YAML.",
    "laftoolstitle": "Gratis online LafTools",
    "lu2T6idPY": "Hvis du mener, der er et problem med din konto, bedes du kontakte webmasteren.",
    "nh1W-": "Test kan kun bevise tilstedeværelsen af ​​fejl, ikke deres fravær - Edsger Dijkstra",
    "nncQE": "Liv",
    "o1ikM3T4c": "Programmers hjælpere",
    "ob1q-I7s-": "Om LafTools",
    "pNwe3": "Andet",
    "q0zA1kML_": "Online værktøjskasse",
    "q3VjkLMsP": "Venskab, udveksling, samarbejde og udvikling",
    "qHoktx": "Tak skal du have!",
    "qWemXE4": "1. januar 2024",
    "quality-first": "Kvalitet først",
    "rK6cx": "{0}, designet og udviklet af LafTools-teamet",
    "rzoFmjStq": "Relevante værktøjer",
    "sdf3160": "Teoretikeres opgave, især inden for biologi, er at foreslå nye eksperimenter. En god teori giver ikke kun forudsigelser, men overraskende forudsigelser, som så viser sig at være sande. - Francis Crick",
    "t8DUz20a-": "JSON-formater",
    "title-laftools": "LafTools - Den førende alt-i-en værktøjskasse til programmører",
    "wCcPJZK": "{0} er ikke en gyldig e-mail",
    "wCctGPJZK": "{0} skal ikke være tom",
    "wYsKTq7nK": "Klik på mig for at se kildekoden",
    "wi28h5_S2": "Codecs",
    "yCsTC": "For tidlig optimering er roden til alt ondt.",
    "zmDWx": "Kontakt os",
    "zuxd0y-kmA": "Bruger-id eller telefonnummer har ingen mellemrum."
}