{
    "CSS-Advantages-010": "Jakie są zalety używania CSS?",
    "CSS-Advantages-Customization-012": "Kolejną zaletą jest możliwość dostosowania wyglądu i stylu wielu stron jednocześnie, co pozwala zaoszczędzić czas i wysiłek podczas aktualizowania stylów całej witryny.",
    "CSS-Advantages-Separation-011": "Jedną z zalet jest oddzielenie zagadnień pomiędzy treścią i prezentacją, co poprawia łatwość konserwacji i skalowalność stron internetowych.",
    "CSS-Animations-Transitions-019": "Animacje i przejścia CSS umożliwiają płynne efekty wizualne bez konieczności obsługi JavaScript.",
    "CSS-Def-002": "CSS (kaskadowe arkusze stylów) to język arkuszy stylów używany do opisu prezentacji dokumentu napisanego w formacie HTML lub XML.",
    "CSS-Disadvantages-013": "Jakie są wady CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Innym problemem jest kompatybilność między przeglądarkami, ponieważ różne przeglądarki mogą różnie interpretować reguły CSS. Wymaga to od programistów stosowania przedrostków dostawców lub technik wykrywania funkcji w celu spójnego renderowania w różnych przeglądarkach.",
    "CSS-Disadvantages-Cascade-014": "Jednym z wyzwań jest zarządzanie kaskadowym charakterem stylów, co może czasami prowadzić do nieoczekiwanych problemów z dziedziczeniem i specyficznością.",
    "CSS-Evolution-006": "Od tego czasu ewoluował poprzez CSS2 (1998), CSS2.1 (2007), CSS3 (ciągły rozwój), wprowadzając takie funkcje, jak selektory, animacje, responsywny projekt i wiele innych.",
    "CSS-Future-020": "Jaka przyszłość czeka technologię CSS?",
    "CSS-Future-Houdini-022": "Na przykład Houdini ma na celu zapewnienie niskopoziomowych interfejsów API umożliwiających dostosowywanie procesu renderowania przeglądarki, zapewniając programistom niespotykaną dotychczas kontrolę nad stylem i układem.",
    "CSS-Future-Progress-021": "Grupa Robocza CSS kontynuuje prace nad nowymi modułami, takimi jak Zmienne CSS (Właściwości niestandardowe), Houdini i Zapytania kontenerowe.",
    "CSS-Hist-Origin-005": "CSS został po raz pierwszy zaproponowany przez Håkona Wium Lie w październiku 1994 r. i stał się oficjalną rekomendacją W3C w grudniu 1996 r. wraz z CSS1.",
    "CSS-History-004": "Jaka jest historia CSS?",
    "CSS-History-W3C": "Oś czasu rekomendacji CSS W3C",
    "CSS-Key-Features-016": "Jakie są kluczowe funkcje CSS?",
    "CSS-Layouts-018": "Systemy układu Flexbox i Grid zapewniają potężne narzędzia do tworzenia responsywnych i elastycznych układów stron.",
    "CSS-MDN-Animations": "Przewodnik MDN po animacjach CSS",
    "CSS-MDN-Flexbox": "Przewodnik MDN po Flexboxie",
    "CSS-MDN-Grid": "Przewodnik MDN po siatce CSS",
    "CSS-MDN-Houdini": "MDN Wprowadzenie do Houdiniego",
    "CSS-Purpose-003": "Umożliwia programistom oddzielenie treści od prezentacji, definiowanie stylów, takich jak układ, kolory i czcionki, dzięki czemu strony internetowe są atrakcyjne wizualnie i spójne na różnych urządzeniach i ekranach.",
    "CSS-Selectors-017": "Selektory umożliwiają kierowanie na określone elementy HTML na podstawie ich typu, klasy, identyfikatora, atrybutów i innych.",
    "CSS-Tech-History-001": "Co to jest CSS?",
    "CSS-Usage-007": "Jak używać CSS w moich projektach internetowych?",
    "CSS-Usage-Basics-008": "Aby użyć CSS, utwórz osobny plik (np. style.css) zawierający Twoje style, a następnie połącz go z plikiem HTML za pomocą elementu <link> w sekcji <head>.",
    "CSS-Usage-Inline-009": "Alternatywnie możesz dołączyć style wbudowane bezpośrednio do elementów HTML, używając atrybutu „style” lub osadzić CSS w tagu <style> w sekcji <head>.",
    "CSS-Vendor-Prefixes": "Przewodnik MDN dotyczący prefiksów dostawców",
    "CSS-W3C-Selectors": "Specyfikacja selektorów W3C poziomu 4",
    "CSS-WG-Future-Modules": "Bieżąca praca W3C CSS"
}