{
    "CSS-Advantages-010": "ข้อดีของการใช้ CSS คืออะไร?",
    "CSS-Advantages-Customization-012": "ข้อดีอีกประการหนึ่งคือความสามารถในการปรับแต่งรูปลักษณ์ของเพจหลายหน้าพร้อมกัน ช่วยประหยัดเวลาและความพยายามในการอัปเดตสไตล์ทั่วทั้งไซต์",
    "CSS-Advantages-Separation-011": "ข้อดีประการหนึ่งคือการแยกข้อกังวลระหว่างเนื้อหาและการนำเสนอ ซึ่งปรับปรุงการบำรุงรักษาและความสามารถในการปรับขนาดของเว็บไซต์",
    "CSS-Animations-Transitions-019": "ภาพเคลื่อนไหวและการเปลี่ยนภาพ CSS ช่วยให้เกิดเอฟเฟ็กต์ภาพที่ราบรื่นโดยไม่ต้องใช้ JavaScript",
    "CSS-Def-002": "CSS (Cascading Style Sheets) เป็นภาษาสไตล์ชีตที่ใช้อธิบายการนำเสนอเอกสารที่เขียนด้วย HTML หรือ XML",
    "CSS-Disadvantages-013": "CSS มีข้อเสียอะไรบ้าง?",
    "CSS-Disadvantages-Browser-Compat-015": "ปัญหาอีกประการหนึ่งคือความเข้ากันได้ข้ามเบราว์เซอร์ เนื่องจากเบราว์เซอร์ที่แตกต่างกันอาจตีความกฎ CSS แตกต่างกัน สิ่งนี้กำหนดให้นักพัฒนาต้องใช้คำนำหน้าผู้ขายหรือเทคนิคการตรวจจับคุณสมบัติเพื่อการแสดงผลที่สอดคล้องกันในเบราว์เซอร์",
    "CSS-Disadvantages-Cascade-014": "ความท้าทายประการหนึ่งคือการจัดการลักษณะของสไตล์ที่เรียงซ้อน ซึ่งบางครั้งอาจนำไปสู่ปัญหาการสืบทอดและความจำเพาะที่ไม่คาดคิด",
    "CSS-Evolution-006": "ตั้งแต่นั้นเป็นต้นมา ได้มีการพัฒนาผ่าน CSS2 (1998), CSS2.1 (2007), CSS3 (การพัฒนาอย่างต่อเนื่อง) โดยนำเสนอฟีเจอร์ต่างๆ เช่น ตัวเลือก ภาพเคลื่อนไหว การออกแบบที่ตอบสนอง และอื่นๆ",
    "CSS-Future-020": "อนาคตของเทคโนโลยี CSS คืออะไร?",
    "CSS-Future-Houdini-022": "ตัวอย่างเช่น Houdini มุ่งหวังที่จะจัดหา API ระดับต่ำสำหรับปรับแต่งกระบวนการเรนเดอร์ของเบราว์เซอร์ เสริมศักยภาพให้กับนักพัฒนาด้วยการควบคุมสไตล์และเค้าโครงที่ไม่เคยมีมาก่อน",
    "CSS-Future-Progress-021": "คณะทำงาน CSS ยังคงทำงานกับโมดูลใหม่ๆ เช่น ตัวแปร CSS (คุณสมบัติที่กำหนดเอง), Houdini และ Container Queries",
    "CSS-Hist-Origin-005": "CSS ได้รับการเสนอครั้งแรกโดย Håkon Wium Lie ในเดือนตุลาคม พ.ศ. 2537 และกลายเป็นคำแนะนำของ W3C อย่างเป็นทางการในเดือนธันวาคม พ.ศ. 2539 ด้วย CSS1",
    "CSS-History-004": "ประวัติความเป็นมาของ CSS คืออะไร?",
    "CSS-History-W3C": "ไทม์ไลน์การแนะนำ W3C CSS",
    "CSS-Key-Features-016": "คุณสมบัติที่สำคัญใน CSS คืออะไร?",
    "CSS-Layouts-018": "ระบบเลย์เอาต์ Flexbox และ Grid มอบเครื่องมืออันทรงพลังสำหรับการสร้างเลย์เอาต์เพจที่ตอบสนองและยืดหยุ่น",
    "CSS-MDN-Animations": "คู่มือ MDN สำหรับภาพเคลื่อนไหว CSS",
    "CSS-MDN-Flexbox": "คู่มือ MDN สำหรับ Flexbox",
    "CSS-MDN-Grid": "คู่มือ MDN สำหรับ CSS Grid",
    "CSS-MDN-Houdini": "MDN รู้เบื้องต้นเกี่ยวกับฮูดินี่",
    "CSS-Purpose-003": "ช่วยให้นักพัฒนาสามารถแยกเนื้อหาออกจากการนำเสนอ กำหนดสไตล์ เช่น เค้าโครง สี และแบบอักษร ทำให้หน้าเว็บดูน่าดึงดูดและสอดคล้องกันบนอุปกรณ์และหน้าจอต่างๆ",
    "CSS-Selectors-017": "ตัวเลือกอนุญาตให้กำหนดเป้าหมายองค์ประกอบ HTML ที่เฉพาะเจาะจงตามประเภท คลาส รหัส แอตทริบิวต์ และอื่นๆ",
    "CSS-Tech-History-001": "ซีเอสเอสคืออะไร?",
    "CSS-Usage-007": "ฉันจะใช้ CSS ในโครงการเว็บของฉันได้อย่างไร",
    "CSS-Usage-Basics-008": "หากต้องการใช้ CSS คุณจะต้องสร้างไฟล์แยกต่างหาก (เช่น style.css) ที่มีสไตล์ของคุณ จากนั้นลิงก์ไปที่ไฟล์ HTML โดยใช้องค์ประกอบ <link> ภายในส่วน <head>",
    "CSS-Usage-Inline-009": "หรือคุณสามารถรวมรูปแบบอินไลน์โดยตรงในองค์ประกอบ HTML โดยใช้แอตทริบิวต์ 'style' หรือฝัง CSS ไว้ในแท็ก <style> ภายในส่วน <head>",
    "CSS-Vendor-Prefixes": "คู่มือ MDN เกี่ยวกับคำนำหน้าผู้ขาย",
    "CSS-W3C-Selectors": "ข้อมูลจำเพาะของตัวเลือก W3C ระดับ 4",
    "CSS-WG-Future-Modules": "งานปัจจุบันของ W3C CSS"
}