{
    "123e4567": "Co je Base64?",
    "1a2b3c4d": "Proč používat Base64?",
    "23fgh456": "Historie Base64",
    "2bcde3fg": "Nevýhody Base64",
    "34wxyz56": "Jak kódovat/dekódovat Base64 v JavaScriptu?",
    "4hijk5lm": "Zvětšení velikosti: Kódovaná data jsou zhruba o 33 % větší než původní binární data.",
    "5e6f7g8h": "Base64 se používá, když je třeba přenášet binární data prostřednictvím textových protokolů, jako je e-mail nebo JSON, nebo vkládat do míst, kde je povolen pouze text.",
    "6nopqrst": "Žádné šifrování: Base64 není metoda šifrování; je snadno dekódovatelný a neposkytuje žádné zabezpečení.",
    "78abcdef": "JavaScript nabízí vestavěné funkce, jako je btoa() a atob() pro kódování a dekódování Base64.",
    "78ijk9lm": "Base64 byl poprvé definován v RFC 1421 (1993) a později standardizován v RFC 4648 (2006).",
    "9i0j1k2l": "Používá se také pro vkládání malých obrázků přímo do HTML nebo CSS jako datové URL.",
    "ab9c0d1e": "Mezi primární operace patří kódování (převod binární na Base64) a dekódování (převod Base64 zpět na binární).",
    "abc12345": "Base64 je kódovací schéma, které představuje binární data jako sekvenci znaků ASCII.",
    "abcdef12": "Jak Base64 funguje?",
    "bcdef01a": "Base64 funguje tak, že rozděluje binární data do skupin po 6 bitech a mapuje každou skupinu na konkrétní znak z abecedy 64 znaků (A-Za-z0-9+/).",
    "cbaq54321": "Ne, Base64 není kompresní technika, mění pouze reprezentaci dat, nikoli jejich velikost.",
    "cdefg234": "Na konci jsou přidány výplňové znaky (=), aby byla zajištěna délka kódovaných dat násobkem 4 znaků.",
    "efg45678": "Srovnání s Base32",
    "efghi678": "Tato varianta se často používá pro názvy souborů, adresy URL nebo situace, kdy je třeba se vyhnout speciálním znakům.",
    "fghi6789": "Používá se k přenosu nebo ukládání binárních souborů v textových formátech, což zajišťuje kompatibilitu napříč různými systémy.",
    "hij90klm": "Base32 používá menší abecedu (A-Z2-7), což má za následek delší, ale pro člověka čitelnější řetězce.",
    "mno34567": "Výhody Base64",
    "mnoijklm": "Existují další kódování BaseXX?",
    "n0pqrstu": "Příklad použití Base64",
    "nopqrs01": "Zatímco Base64 optimalizuje pro kompaktnost, Base32 je vybrán, když je zásadní minimalizace vstupních chyb, jako je ruční zadávání.",
    "pqrs890t": "Univerzální kompatibilita: Base64 je široce uznáván a podporován ve všech hlavních programovacích jazycích.",
    "qrstuvwx": "Ano, kromě Base64 a Base32 existují také Base16 (Hexadecimal), Base58 a Base85, každý navržený pro jiné scénáře.",
    "tuv23456": "Base64 URL bezpečná varianta",
    "u7vwx8yz": "Operace Common Base64",
    "uvwxyza1": "Žádná ztráta dat: Protože se jedná o reverzibilní proces, kódování Base64 nevede k žádné ztrátě informací.",
    "vwx1yza2": "Příkladem je zakódování souboru obrázku pro jeho vložení do HTML značky <img>:",
    "wxyzabcd": "Existuje verze Base64 bezpečná pro adresy URL, která nahrazuje '+' '-' a '/' '_' a vynechává výplň '=', takže je vhodná pro webové adresy URL.",
    "zyx98765": "Lze Base64 použít pro kompresi?"
}