{
    "123e4567": "Was ist Base64?",
    "1a2b3c4d": "Warum Base64 verwenden?",
    "23fgh456": "Geschichte von Base64",
    "2bcde3fg": "Nachteile von Base64",
    "34wxyz56": "Wie kodiere/dekodiere ich Base64 in JavaScript?",
    "4hijk5lm": "Größenzunahme: Kodierte Daten sind etwa 33 % größer als die ursprünglichen Binärdaten.",
    "5e6f7g8h": "Base64 wird verwendet, wenn Binärdaten über textbasierte Protokolle wie E-Mail oder JSON übertragen oder an Stellen eingebettet werden müssen, an denen nur Text zulässig ist.",
    "6nopqrst": "Keine Verschlüsselung: Base64 ist keine Verschlüsselungsmethode; Es ist leicht zu entschlüsseln und bietet keine Sicherheit.",
    "78abcdef": "JavaScript bietet integrierte Funktionen wie btoa() und atob() für die Base64-Kodierung bzw. -Dekodierung.",
    "78ijk9lm": "Base64 wurde erstmals in RFC 1421 (1993) definiert und später in RFC 4648 (2006) standardisiert.",
    "9i0j1k2l": "Es wird auch zum direkten Einbetten kleiner Bilder als Daten-URLs in HTML oder CSS verwendet.",
    "ab9c0d1e": "Zu den primären Vorgängen gehören die Kodierung (Binärkonvertierung in Base64) und die Dekodierung (Base64-Rückkonvertierung in Binärdatei).",
    "abc12345": "Base64 ist ein Codierungsschema, das Binärdaten als Folge von ASCII-Zeichen darstellt.",
    "abcdef12": "Wie funktioniert Base64?",
    "bcdef01a": "Base64 funktioniert, indem es Binärdaten in Gruppen von 6 Bits aufteilt und jede Gruppe einem bestimmten Zeichen aus einem Alphabet von 64 Zeichen (A-Za-z0-9+/) zuordnet.",
    "cbaq54321": "Nein, Base64 ist keine Komprimierungstechnik, es ändert nur die Darstellung der Daten, nicht deren Größe.",
    "cdefg234": "Am Ende werden Füllzeichen (=) hinzugefügt, um sicherzustellen, dass die Länge der codierten Daten ein Vielfaches von 4 Zeichen ist.",
    "efg45678": "Vergleich mit Base32",
    "efghi678": "Diese Variante wird häufig für Dateinamen, URLs oder Situationen verwendet, in denen Sonderzeichen vermieden werden müssen.",
    "fghi6789": "Es wird zum Übertragen oder Speichern von Binärdateien in textbasierten Formaten verwendet und gewährleistet so die Kompatibilität zwischen verschiedenen Systemen.",
    "hij90klm": "Base32 verwendet ein kleineres Alphabet (A-Z2-7), was zu längeren, aber besser lesbaren Zeichenfolgen führt.",
    "mno34567": "Vorteile von Base64",
    "mnoijklm": "Gibt es andere BaseXX-Kodierungen?",
    "n0pqrstu": "Beispielverwendung von Base64",
    "nopqrs01": "Während Base64 auf Kompaktheit optimiert, wird Base32 gewählt, wenn die Minimierung von Eingabefehlern, wie z. B. manuelle Eingaben, von entscheidender Bedeutung ist.",
    "pqrs890t": "Universelle Kompatibilität: Base64 ist weithin anerkannt und wird in allen wichtigen Programmiersprachen unterstützt.",
    "qrstuvwx": "Ja, neben Base64 und Base32 gibt es auch Base16 (Hexadezimal), Base58 und Base85, die jeweils für unterschiedliche Szenarien konzipiert sind.",
    "tuv23456": "Base64-URL-sichere Variante",
    "u7vwx8yz": "Allgemeine Base64-Operationen",
    "uvwxyza1": "Kein Datenverlust: Da es sich um einen umkehrbaren Prozess handelt, führt die Base64-Kodierung nicht zu Informationsverlusten.",
    "vwx1yza2": "Ein Beispiel ist die Codierung einer Bilddatei, um sie in ein HTML-<img>-Tag einzubetten:",
    "wxyzabcd": "Es gibt eine URL-sichere Version von Base64, die „+“ durch „-“ und „/“ durch „_“ ersetzt und auf das Auffüllen von „=“ verzichtet, wodurch sie für Web-URLs geeignet ist.",
    "zyx98765": "Kann Base64 zur Komprimierung verwendet werden?"
}