{
    "123e4567": "Qu’est-ce que Base64 ?",
    "1a2b3c4d": "Pourquoi utiliser Base64 ?",
    "23fgh456": "Histoire de Base64",
    "2bcde3fg": "Inconvénients de Base64",
    "34wxyz56": "Comment encoder/décoder Base64 en JavaScript ?",
    "4hijk5lm": "Augmentation de la taille : les données codées sont environ 33 % plus grandes que les données binaires d'origine.",
    "5e6f7g8h": "Base64 est utilisé lorsque les données binaires doivent être transmises via des protocoles basés sur du texte comme le courrier électronique ou JSON, ou intégrées à des endroits où seul le texte est autorisé.",
    "6nopqrst": "Pas de cryptage : Base64 n'est pas une méthode de cryptage ; il est facilement décodé et n’offre aucune sécurité.",
    "78abcdef": "JavaScript propose des fonctions intégrées telles que btoa() et atob() pour l'encodage et le décodage Base64 respectivement.",
    "78ijk9lm": "Base64 a été défini pour la première fois dans la RFC 1421 (1993), puis normalisé dans la RFC 4648 (2006).",
    "9i0j1k2l": "Il est également utilisé pour intégrer de petites images directement dans HTML ou CSS en tant qu'URL de données.",
    "ab9c0d1e": "Les opérations principales incluent le codage (conversion du binaire en Base64) et le décodage (conversion du Base64 en binaire).",
    "abc12345": "Base64 est un schéma de codage qui représente les données binaires sous la forme d'une séquence de caractères ASCII.",
    "abcdef12": "Comment fonctionne Base64 ?",
    "bcdef01a": "Base64 fonctionne en divisant les données binaires en groupes de 6 bits et en mappant chaque groupe à un caractère spécifique d'un alphabet de 64 caractères (A-Za-z0-9+/).",
    "cbaq54321": "Non, Base64 n'est pas une technique de compression, elle modifie uniquement la représentation des données et non leur taille.",
    "cdefg234": "Des caractères de remplissage (=) sont ajoutés à la fin pour garantir que la longueur des données codées est un multiple de 4 caractères.",
    "efg45678": "Comparaison avec Base32",
    "efghi678": "Cette variante est souvent utilisée pour les noms de fichiers, les URL ou les situations où les caractères spéciaux doivent être évités.",
    "fghi6789": "Il est utilisé pour transmettre ou stocker des fichiers binaires dans des formats texte, garantissant ainsi la compatibilité entre différents systèmes.",
    "hij90klm": "Base32 utilise un alphabet plus petit (A-Z2-7), ce qui donne des chaînes plus longues mais plus lisibles par l'homme.",
    "mno34567": "Avantages de Base64",
    "mnoijklm": "Existe-t-il d'autres encodages BaseXX ?",
    "n0pqrstu": "Exemple d'utilisation de Base64",
    "nopqrs01": "Alors que Base64 optimise la compacité, Base32 est choisi lorsque la minimisation des erreurs de saisie, comme la saisie manuelle, est cruciale.",
    "pqrs890t": "Compatibilité universelle : Base64 est largement reconnu et pris en charge dans tous les principaux langages de programmation.",
    "qrstuvwx": "Oui, outre Base64 et Base32, il existe également Base16 (hexadécimal), Base58 et Base85, chacun conçu pour des scénarios différents.",
    "tuv23456": "Variante sécurisée d'URL Base64",
    "u7vwx8yz": "Opérations Base64 communes",
    "uvwxyza1": "Aucune perte de données : puisqu'il s'agit d'un processus réversible, l'encodage Base64 n'entraîne aucune perte d'informations.",
    "vwx1yza2": "Un exemple consiste à encoder un fichier image pour l'intégrer dans une balise HTML <img> :",
    "wxyzabcd": "Il existe une version sécurisée pour les URL de Base64 qui remplace « + » par « - » et « / » par « _ », et omet le remplissage « = », ce qui la rend adaptée aux URL Web.",
    "zyx98765": "Base64 peut-il être utilisé pour la compression ?"
}