{
    "123e4567": "Apakah itu Base64?",
    "1a2b3c4d": "Mengapa menggunakan Base64?",
    "23fgh456": "Sejarah Pangkalan64",
    "2bcde3fg": "Kelemahan Base64",
    "34wxyz56": "Bagaimana untuk mengekod/menyahkod Base64 dalam JavaScript?",
    "4hijk5lm": "Peningkatan Saiz: Data yang dikodkan adalah kira-kira 33% lebih besar daripada data binari asal.",
    "5e6f7g8h": "Base64 digunakan apabila data binari perlu dihantar melalui protokol berasaskan teks seperti e-mel atau JSON, atau dibenamkan di tempat yang hanya teks dibenarkan.",
    "6nopqrst": "Tiada Penyulitan: Base64 bukan kaedah penyulitan; ia mudah dinyahkod dan tidak memberikan keselamatan.",
    "78abcdef": "JavaScript menawarkan fungsi terbina dalam seperti btoa() dan atob() untuk pengekodan dan penyahkodan Base64 masing-masing.",
    "78ijk9lm": "Base64 pertama kali ditakrifkan dalam RFC 1421 (1993) dan kemudiannya diseragamkan dalam RFC 4648 (2006).",
    "9i0j1k2l": "Ia juga digunakan untuk membenamkan imej kecil terus ke dalam HTML atau CSS sebagai URL data.",
    "ab9c0d1e": "Operasi utama termasuk pengekodan (menukar binari kepada Base64) dan penyahkodan (menukar Base64 kembali kepada binari).",
    "abc12345": "Base64 ialah skema pengekodan yang mewakili data binari sebagai jujukan aksara ASCII.",
    "abcdef12": "Bagaimanakah Base64 berfungsi?",
    "bcdef01a": "Base64 berfungsi dengan membahagikan data binari kepada kumpulan 6 bit dan memetakan setiap kumpulan kepada aksara tertentu daripada abjad 64 aksara (A-Za-z0-9+/).",
    "cbaq54321": "Tidak, Base64 bukan teknik pemampatan, ia hanya mengubah perwakilan data bukan saiznya.",
    "cdefg234": "Aksara padding (=) ditambahkan pada penghujung untuk memastikan panjang data yang dikodkan ialah gandaan 4 aksara.",
    "efg45678": "Perbandingan dengan Base32",
    "efghi678": "Varian ini sering digunakan untuk nama fail, URL atau situasi di mana aksara khas mesti dielakkan.",
    "fghi6789": "Ia digunakan untuk menghantar atau menyimpan fail binari dalam format berasaskan teks, memastikan keserasian merentas pelbagai sistem.",
    "hij90klm": "Base32 menggunakan abjad yang lebih kecil (A-Z2-7), menghasilkan rentetan yang lebih panjang tetapi lebih mudah dibaca manusia.",
    "mno34567": "Kelebihan Base64",
    "mnoijklm": "Adakah terdapat pengekodan BaseXX lain?",
    "n0pqrstu": "Contoh penggunaan Base64",
    "nopqrs01": "Walaupun Base64 mengoptimumkan kekompakan, Base32 dipilih apabila meminimumkan ralat input, seperti kemasukan manual, adalah penting.",
    "pqrs890t": "Keserasian Universal: Base64 diiktiraf secara meluas dan disokong dalam semua bahasa pengaturcaraan utama.",
    "qrstuvwx": "Ya, selain daripada Base64 dan Base32, terdapat juga Base16 (Heksadesimal), Base58, dan Base85, setiap satu direka untuk senario yang berbeza.",
    "tuv23456": "Varian selamat URL Base64",
    "u7vwx8yz": "Operasi Common Base64",
    "uvwxyza1": "Tiada Kehilangan Data: Memandangkan ia merupakan proses boleh balik, pengekodan Base64 tidak mengakibatkan kehilangan maklumat.",
    "vwx1yza2": "Contohnya ialah pengekodan fail imej untuk membenamkannya dalam teg <img> HTML:",
    "wxyzabcd": "Terdapat versi Base64 yang selamat untuk URL yang menggantikan '+' dengan '-' dan '/' dengan '_', serta mengenepikan padding '=', menjadikannya sesuai untuk URL web.",
    "zyx98765": "Bolehkah Base64 digunakan untuk pemampatan?"
}