{
    "123e4567": "Wat is Base64?",
    "1a2b3c4d": "Waarom Base64 gebruiken?",
    "23fgh456": "Geschiedenis van Base64",
    "2bcde3fg": "Nadelen van Base64",
    "34wxyz56": "Hoe Base64 coderen/decoderen in JavaScript?",
    "4hijk5lm": "Grootte vergroten: Gecodeerde gegevens zijn ongeveer 33% groter dan de originele binaire gegevens.",
    "5e6f7g8h": "Base64 wordt gebruikt wanneer binaire gegevens moeten worden verzonden via op tekst gebaseerde protocollen zoals e-mail of JSON, of moeten worden ingebed op plaatsen waar alleen tekst is toegestaan.",
    "6nopqrst": "Geen codering: Base64 is geen coderingsmethode; het is gemakkelijk te decoderen en biedt geen beveiliging.",
    "78abcdef": "JavaScript biedt ingebouwde functies zoals btoa() en atob() voor respectievelijk Base64-codering en decodering.",
    "78ijk9lm": "Base64 werd voor het eerst gedefinieerd in RFC 1421 (1993) en later gestandaardiseerd in RFC 4648 (2006).",
    "9i0j1k2l": "Het wordt ook gebruikt voor het rechtstreeks insluiten van kleine afbeeldingen in HTML of CSS als gegevens-URL's.",
    "ab9c0d1e": "De primaire bewerkingen omvatten het coderen (het converteren van binair naar Base64) en het decoderen (het converteren van Base64 terug naar binair).",
    "abc12345": "Base64 is een coderingsschema dat binaire gegevens weergeeft als een reeks ASCII-tekens.",
    "abcdef12": "Hoe werkt Base64?",
    "bcdef01a": "Base64 werkt door binaire gegevens in groepen van 6 bits te verdelen en elke groep toe te wijzen aan een specifiek teken uit een alfabet van 64 tekens (A-Za-z0-9+/).",
    "cbaq54321": "Nee, Base64 is geen compressietechniek; het verandert alleen de weergave van gegevens, niet de grootte ervan.",
    "cdefg234": "Aan het einde worden opvultekens (=) toegevoegd om ervoor te zorgen dat de gecodeerde gegevenslengte een veelvoud van 4 tekens is.",
    "efg45678": "Vergelijking met Base32",
    "efghi678": "Deze variant wordt vaak gebruikt voor bestandsnamen, URL's of situaties waarin speciale tekens moeten worden vermeden.",
    "fghi6789": "Het wordt gebruikt om binaire bestanden in op tekst gebaseerde formaten te verzenden of op te slaan, waardoor compatibiliteit tussen verschillende systemen wordt gegarandeerd.",
    "hij90klm": "Base32 gebruikt een kleiner alfabet (A-Z2-7), wat resulteert in langere maar beter leesbare reeksen.",
    "mno34567": "Voordelen van Base64",
    "mnoijklm": "Zijn er andere BaseXX-coderingen?",
    "n0pqrstu": "Voorbeeldgebruik van Base64",
    "nopqrs01": "Terwijl Base64 optimaliseert voor compactheid, wordt voor Base32 gekozen wanneer het minimaliseren van invoerfouten, zoals handmatige invoer, cruciaal is.",
    "pqrs890t": "Universele compatibiliteit: Base64 wordt algemeen erkend en ondersteund in alle belangrijke programmeertalen.",
    "qrstuvwx": "Ja, naast Base64 en Base32 zijn er ook Base16 (hexadecimaal), Base58 en Base85, elk ontworpen voor verschillende scenario's.",
    "tuv23456": "Base64 URL veilige variant",
    "u7vwx8yz": "Gemeenschappelijke Base64-bewerkingen",
    "uvwxyza1": "Geen gegevensverlies: Omdat het een omkeerbaar proces is, resulteert Base64-codering niet in enig verlies van informatie.",
    "vwx1yza2": "Een voorbeeld is het coderen van een afbeeldingsbestand om het in een HTML <img>-tag in te sluiten:",
    "wxyzabcd": "Er is een URL-veilige versie van Base64 die '+' vervangt door '-' en '/' door '_', en de opvulling '=' weglaat, waardoor deze geschikt is voor web-URL's.",
    "zyx98765": "Kan Base64 worden gebruikt voor compressie?"
}