{
    "MD2-Advantages-011": "ข้อดีของการใช้ MD2 คืออะไร?",
    "MD2-AlgorithmDetails-010": "รายละเอียดอัลกอริทึม MD2",
    "MD2-Applications-018": "แอปพลิเคชันใดบ้างที่เคยใช้หรือยังคงใช้ MD2",
    "MD2-Breakdown-016": "เมื่อเวลาผ่านไป มีการค้นพบจุดอ่อนด้านการเข้ารหัสใน MD2 และทางเลือกอื่นที่แข็งแกร่งกว่า เช่น SHA-256 และ SHA-3 ได้รับการแนะนำสำหรับแอปพลิเคชันทั้งหมดที่ต้องการแฮชที่ปลอดภัย",
    "MD2-CollisionSecurity-015": "MD2 ถือว่าอ่อนแอต่อการโจมตีด้วยการเข้ารหัสลับสมัยใหม่ ขนาดแฮช (128 บิต) มีขนาดเล็กตามมาตรฐานปัจจุบัน ทำให้เสี่ยงต่อการโจมตีแบบชนกัน",
    "MD2-Def-002": "MD2 (อัลกอริธึมการแยกข้อความ 2) เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่ออกแบบโดย Ronald Rivest ในปี 1989 โดยสร้างค่าแฮช 128 บิตสำหรับข้อความอินพุตที่กำหนด",
    "MD2-DigitalSignature-Risks-021": "ความเสี่ยงของการใช้ MD2 สำหรับลายเซ็นดิจิทัล",
    "MD2-Disadvantages-014": "MD2 มีข้อเสียและข้อกังวลด้านความปลอดภัยอย่างไร",
    "MD2-FAQ-001": "MD2 คืออะไร?",
    "MD2-HistoricalUse-020": "ในอดีต MD2 พบว่ามีการใช้ในการตรวจสอบความสมบูรณ์ของไฟล์และการอัปเดตซอฟต์แวร์ แม้ว่าแอปพลิเคชันเหล่านี้ส่วนใหญ่จะเปลี่ยนไปใช้ฟังก์ชันแฮชที่ปลอดภัยมากขึ้น เช่น SHA-256 และ SHA-512)",
    "MD2-History-004": "MD2 ได้รับการพัฒนาอย่างไรและมีประวัติเป็นอย่างไร",
    "MD2-Implementation-013": "มีการนำไปใช้อย่างกว้างขวางและเป็นมาตรฐานในแพลตฟอร์มและภาษาต่างๆ ซึ่งหมายความว่าการรวม MD2 เข้ากับระบบที่มีอยู่นั้นค่อนข้างตรงไปตรงมา",
    "MD2-InsecurityExamples-017": "ตัวอย่างรายละเอียดการรักษาความปลอดภัย MD2",
    "MD2-Operation-007": "การทำงานของ MD2 ทำงานอย่างไร?",
    "MD2-Origin-005": "MD2 ถูกสร้างขึ้นครั้งแรกโดยมีการปรับปรุงจาก MD1 โดยแก้ไขจุดอ่อนบางประการที่พบในอัลกอริธึมรุ่นก่อนหน้า ได้รับความนิยมเนื่องจากความเรียบง่ายและความเร็วในขณะนั้น",
    "MD2-PKI-019": "MD2 ครั้งหนึ่งเคยถูกใช้ใน Public Key Infrastructure (PKI) สำหรับลายเซ็นดิจิทัล แต่หลังจากนั้นก็เลิกใช้แล้วเนื่องจากมีความเสี่ยงที่จะถูกโจมตี ใบรับรองที่ลงนามด้วย MD2 ไม่ได้รับความเชื่อถือจากระบบส่วนใหญ่อีกต่อไป",
    "MD2-Process-008": "MD2 ทำงานโดยการเติมข้อความอินพุตให้เป็นจำนวนทวีคูณของ 16 ไบต์ จากนั้นจึงประมวลผลผ่านชุดของการดำเนินการพิเศษเฉพาะหรือ การหมุนบิต และการเพิ่มเติม ผลลัพธ์สุดท้ายคือค่าแฮช 128 บิต",
    "MD2-Purpose-003": "วัตถุประสงค์ของ MD2 คือการรับรองความสมบูรณ์ของข้อมูลโดยการสร้างลายนิ้วมือดิจิทัลที่เป็นเอกลักษณ์ซึ่งสามารถใช้เพื่อตรวจสอบความเป็นต้นฉบับและความถูกต้องของข้อมูลได้",
    "MD2-Rounds-009": "อัลกอริธึมใช้กระบวนการสี่รอบโดยมีการดำเนินการเฉพาะกับตัวแปรสถานะ 128 บิต แต่ละรอบจะใช้บล็อกของข้อความที่มีเบาะและอัปเดตสถานะจนกว่าข้อความทั้งหมดจะได้รับการประมวลผล",
    "MD2-Speed-012": "MD2 ถือว่าเร็วในช่วงเวลานั้นและยังคงมีประสิทธิภาพที่ยอมรับได้ในบางสถานการณ์ ทำให้เหมาะสำหรับสภาพแวดล้อมที่ทรัพยากรการคำนวณมีจำกัด",
    "MD2-Successors-006": "อย่างไรก็ตาม มันถูกแทนที่โดยอัลกอริธึมที่แข็งแกร่งกว่า เช่น MD5 และ SHA-1 ซึ่งเป็นส่วนหนึ่งของฟังก์ชันแฮชตระกูลเดียวกัน แต่มีฟีเจอร์ความปลอดภัยที่ได้รับการปรับปรุง"
}