{
    "R_S7_CLAo": "Voorbeeld: Om 'TEST12345' in Base32 te coderen, kunt u bibliotheken zoals base32-encode in Node.js gebruiken, of ingebouwde functies in andere talen zoals base64.b32encode van Python.",
    "a4s6x": "Hoe werkt Base32?",
    "a8b7z": "Opvulling is dus alleen nodig als de laatste groep bits die wordt gecodeerd, niet deelbaar is door 40 bits (aangezien 8 Base32-tekens 40 bits vertegenwoordigen). De opvulling bestaat uit nul tot zes '='-tekens aan het einde van de gecodeerde tekenreeks.",
    "b8g2k": "Gebruiksscenario's voor Base32",
    "c0v2p": "Algemene bewerkingen met Base32",
    "d1x7v": "Een ander voorbeeld is Git, waar gehashte objecten soms in Base32-formaat worden opgeslagen om problemen met regeleindes en bestandsnaambeperkingen te voorkomen. HashiCorp Vault gebruikt ook Base32 voor het afleiden van sleutels.",
    "d9w7m": "Bovendien kan het, omdat het alleen hoofdletters gebruikt, niet alle mogelijke combinaties van hoofdlettergevoeligheid gebruiken als extra beveiligingsmaatregel, zoals Base64 soms doet met het opvouwen van hoofdletters tijdens het decoderen.",
    "e5c7r": "Base32 is een binair-naar-tekst-coderingsschema dat gegevens in een ASCII-reeks vertegenwoordigt met behulp van een subset van 32 tekens. Het is ontworpen om voor mensen leesbaar en URL-veilig te zijn.",
    "f0q4w": "Een populair gebruiksscenario is het genereren van geheime sleutels voor tweefactorauthenticatie (2FA), waarbij services zoals Google Authenticator en Yubikey door Base32 gecodeerde geheimen gebruiken.",
    "f5a0s": "Bovendien produceert Base32 langere uitvoer, maar kan het geschikter zijn voor specifieke toepassingen zoals bestandsnamen vanwege het ontbreken van speciale tekens die in conflict kunnen komen met de regels van het bestandssysteem.",
    "g8r3e": "Het grootste nadeel van Base32 is de relatief slechte ruimte-efficiëntie; het breidt de invoergegevens met ongeveer 25% meer uit dan Base64. Dit betekent dat het meer opslagruimte of bandbreedte in beslag neemt voor dezelfde hoeveelheid gecodeerde gegevens.",
    "h4e1b": "Het is ook handig in situaties waarin hoofdlettergevoelige alfanumerieke tekenreeksen gemakkelijker te verwerken zijn dan hexadecimale of base64-tekenreeksen, die niet-alfanumerieke tekens kunnen bevatten die in bepaalde contexten problemen kunnen veroorzaken (zoals URL's of bestandsnamen).",
    "h9j3m": "Opvulling in Base32",
    "i9o7k": "Voordelen van Base32 ten opzichte van Base64",
    "j1b5k": "De meest voorkomende bewerkingen waarbij Base32 betrokken is, zijn onder meer het coderen van binaire gegevens in een Base32-string en het decoderen van een Base32-string terug naar het oorspronkelijke binaire formaat.",
    "k7g0n": "In Base32 worden elke 5 bits aan invoergegevens toegewezen aan een van de 32 tekens uit de set 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "l1p9z": "Wat is Base32?",
    "m6d8b": "Elke 5-bits waarde wordt weergegeven door een enkel teken, waardoor efficiënte codering en decodering mogelijk is voor systemen die de voorkeur geven aan het werken met octetten (8-bits eenheden).",
    "n3e7r": "Geschiedenis van Basis32",
    "p9s5t": "Base32 is in 2001 ontwikkeld door Douglas Crockford, bekend van zijn bijdragen aan JavaScript. Het is gemaakt als een betrouwbaarder alternatief voor bestaande coderingen zoals Base64, vooral voor situaties die op tekst gebaseerde representaties van binaire gegevens vereisen.",
    "q2w5m": "Doel van het gebruik van Base32?",
    "s5t0n": "Bij het opvullen in Base32 worden '='-tekens toegevoegd om ervoor te zorgen dat het laatste deel van de gecodeerde gegevens nog steeds een veelvoud van 8 bits bevat. In tegenstelling tot Base64 is de opvulling van Base32 echter minimaal omdat elk Base32-teken al 5 bits codeert.",
    "t8z1v": "Als er aan het einde niet genoeg bits over zijn om een ​​volledige groep van 5 bits te vullen, worden opvultekens '=' toegevoegd. Voor een byte zijn bijvoorbeeld twee Base32-tekens nodig, terwijl voor een reeks van 3 bytes vier Base32-tekens nodig zijn.",
    "u3j9p": "Base32 wordt vaak gebruikt wanneer u een compacte tekstuele weergave van binaire gegevens nodig heeft die kan worden getypt of afgedrukt zonder informatie te verliezen, zoals bij controles van de bestandsintegriteit, geocaching en het veilig genereren van wachtwoorden.",
    "y6t1n": "Nadelen van Base32",
    "z2x8c": "Base32 heeft minder visuele dubbelzinnigheden omdat het alleen hoofdletters en cijfers gebruikt, waardoor het gemakkelijker is om handmatig of via de telefoon te lezen en te transcriberen in vergelijking met Base64, dat '+', '/' en kleine letters bevat.",
    "z6m1c": "Latere variaties zoals z-base-32 werden geïntroduceerd om de bruikbaarheid te verbeteren, waarbij enkele minder gedenkwaardige karakters door andere werden vervangen, maar de oorspronkelijke specificatie van Crockford wordt nog steeds veel gebruikt."
}