{
    "MySQL-Performance-Tuning": "Tips voor het afstemmen van MySQL-prestaties",
    "OWASP-SQL-Injection": "OWASP SQL-injectiehandleiding",
    "SQL-Basics-001": "Wat is SQL?",
    "SQL-Beautifier-Example": "Online SQL-formatter",
    "SQL-Beautify-006": "Wat is SQL-verfraaiing?",
    "SQL-Beautify-Def-007": "SQL-verfraaiing is het proces waarbij SQL-code wordt opgemaakt om de leesbaarheid te verbeteren door consistente inspringing, spatiëring en hoofdletterconventies toe te passen.",
    "SQL-Beautify-Purpose-008": "Net als generieke codeverfraaiers helpt het ontwikkelaars complexe query's gemakkelijker te begrijpen en de consistentie in hun SQL-scripts of projecten te behouden.",
    "SQL-Commands-005": "SQL bevat verschillende typen opdrachten: DDL (Data Definition Language - CREATE, ALTER, DROP), DML (Data Manipulation Language - SELECT, INSERT, UPDATE, DELETE) en DCL (Data Control Language - GRANT, REVOKE).",
    "SQL-Components-004": "Wat zijn de belangrijkste componenten van SQL?",
    "SQL-Components-Wikipedia": "SQL-componenten op Wikipedia",
    "SQL-Def-002": "SQL (Structured Query Language) is een standaard programmeertaal voor het beheren en bevragen van relationele databases.",
    "SQL-Indexing-016": "Wat zijn indexen in SQL en waarom zijn ze belangrijk?",
    "SQL-Indexing-Benefit-018": "Het maken van een index voor veelgebruikte kolommen voor WHERE-clausulevoorwaarden versnelt SELECT-query's aanzienlijk, maar kan INSERT-, UPDATE- en DELETE-bewerkingen vertragen vanwege de noodzaak om de indexstructuur te behouden.",
    "SQL-Indexing-Explanation-017": "Indexen zijn datastructuren (bijvoorbeeld B-bomen) die de snelheid van het ophalen van gegevens in een tabel verbeteren door de database-engine in staat te stellen snel rijen te lokaliseren op basis van specifieke kolomwaarden.",
    "SQL-Indexing-MDN": "MDN-webdocumenten over indexen",
    "SQL-Injection-019": "Wat is SQL-injectie en hoe kan het worden voorkomen?",
    "SQL-Injection-Def-020": "SQL-injectie is een beveiligingsprobleem waarbij een aanvaller kwaadaardige SQL-code in invoervelden kan invoegen om gegevens uit een database te manipuleren of te extraheren.",
    "SQL-Injection-Prevention-021": "Preventiemethoden omvatten het gebruik van geparametriseerde query's, voorbereide instructies of ORM-bibliotheken die automatisch aan gebruikersinvoer ontsnappen, evenals het beperken van databasemachtigingen en het toepassen van de minste privilege-principes.",
    "SQL-Joins-011": "Wat zijn JOIN's in SQL?",
    "SQL-Joins-Explanation-012": "JOIN's worden gebruikt om rijen uit twee of meer tabellen te combineren op basis van een gerelateerde kolom ertussen. Bijvoorbeeld INNER JOIN, LEFT JOIN, RIGHT JOIN en FULL JOIN.",
    "SQL-Joins-Tutorial": "SQL Joins-zelfstudie",
    "SQL-Perf-Tuning-Methods-024": "Andere technieken zijn onder meer het partitioneren van grote tabellen, het gebruik van de juiste gegevenstypen en het cachen van resultaten indien mogelijk.",
    "SQL-Perf-Tuning-Overview-023": "Het optimaliseren van de prestaties van SQL-query's omvat het analyseren van uitvoeringsplannen, het op de juiste manier indexeren, het minimaliseren van onnodige joins en subquery's en het schrijven van efficiënte WHERE-clausules.",
    "SQL-Performance-Tuning-022": "Hoe optimaliseer ik de prestaties van SQL-query's?",
    "SQL-Purpose-003": "Het wordt gebruikt voor het maken, lezen, bijwerken, verwijderen en opvragen van gegevens in tabellen, en voor het beheren van de databasestructuur en machtigingen.",
    "SQL-Select-009": "Hoe schrijf ik een eenvoudige SELECT-instructie?",
    "SQL-Select-Example-0210": "Een eenvoudige SELECT-instructie haalt gegevens uit een tabel op. Bijvoorbeeld: {0}', 'SELECT kolom1, kolom2 FROM mijn_tabel;",
    "SQL-Transactions-013": "Wat zijn transacties in SQL?",
    "SQL-Transactions-Def-014": "Een transactie is een logische werkeenheid die een of meer SQL-instructies bevat. Het zorgt ervoor dat alle operaties erin succesvol worden voltooid (atomiciteit), geïsoleerd van andere transacties en duurzaam zijn, zelfs in het geval van een systeemstoring.",
    "SQL-Transactions-Example-015": "Om een ​​transactie te starten, gebruikt u het commando START TRANSACTION; wijzigingen doorvoeren met COMMIT of terugdraaien naar de vorige status met ROLLBACK.",
    "SQL-Transactions-W3Schools": "SQL-transacties op W3Schools"
}