{
    "MySQL-Performance-Tuning": "MySQL ytelsesjusteringstips",
    "OWASP-SQL-Injection": "OWASP SQL Injection Guide",
    "SQL-Basics-001": "Hva er SQL?",
    "SQL-Beautifier-Example": "Online SQL-formater",
    "SQL-Beautify-006": "Hva er SQL-forskjønnelse?",
    "SQL-Beautify-Def-007": "SQL-forskjønnelse er prosessen med å formatere SQL-kode for å forbedre lesbarheten ved å bruke konsistente innrykk, mellomrom og kasuskonvensjoner.",
    "SQL-Beautify-Purpose-008": "Akkurat som generiske kodeforskjønnere, hjelper det utviklere å forstå komplekse søk lettere og opprettholde konsistens på tvers av SQL-skriptene eller -prosjektene deres.",
    "SQL-Commands-005": "SQL inkluderer flere typer kommandoer: DDL (Data Definition Language - CREATE, ALTER, DROP), DML (Data Manipulation Language - SELECT, INSERT, UPDATE, DELETE) og DCL (Data Control Language - GRANT, REVOKE).",
    "SQL-Components-004": "Hva er hovedkomponentene i SQL?",
    "SQL-Components-Wikipedia": "SQL-komponenter på Wikipedia",
    "SQL-Def-002": "SQL (Structured Query Language) er et standard programmeringsspråk for administrasjon og spørring av relasjonsdatabaser.",
    "SQL-Indexing-016": "Hva er indekser i SQL og hvorfor er de viktige?",
    "SQL-Indexing-Benefit-018": "Å lage en indeks på ofte brukte kolonner for WHERE-klausulforhold øker betydelig hastighet på SELECT-spørringer, men kan redusere INSERT-, UPDATE- og DELETE-operasjoner på grunn av behovet for å opprettholde indeksstrukturen.",
    "SQL-Indexing-Explanation-017": "Indekser er datastrukturer (f.eks. B-trær) som forbedrer hastigheten på datainnhentingsoperasjoner i en tabell ved å la databasemotoren raskt finne rader basert på spesifikke kolonneverdier.",
    "SQL-Indexing-MDN": "MDN Web Docs på indekser",
    "SQL-Injection-019": "Hva er SQL Injection og hvordan kan det forhindres?",
    "SQL-Injection-Def-020": "SQL Injection er et sikkerhetssårbarhet der en angriper kan sette inn ondsinnet SQL-kode i inndatafelt for å manipulere eller trekke ut data fra en database.",
    "SQL-Injection-Prevention-021": "Forebyggingsmetoder inkluderer bruk av parametriserte spørringer, forberedte setninger eller ORM-biblioteker som automatisk unnslipper brukerinndata, samt begrense databasetillatelser og bruk av minsterettighetsprinsipper.",
    "SQL-Joins-011": "Hva er JOINs i SQL?",
    "SQL-Joins-Explanation-012": "JOINs brukes til å kombinere rader fra to eller flere tabeller basert på en relatert kolonne mellom dem. F.eks. INNER JOIN, LEFT JOIN, HØYRE JOIN, og FULL JOIN.",
    "SQL-Joins-Tutorial": "Opplæring i SQL blir med",
    "SQL-Perf-Tuning-Methods-024": "Andre teknikker inkluderer partisjonering av store tabeller, bruk av passende datatyper og hurtigbufring av resultater når det er mulig.",
    "SQL-Perf-Tuning-Overview-023": "Optimalisering av SQL-spørringsytelse innebærer å analysere utførelsesplaner, indeksere riktig, minimere unødvendige sammenføyninger og underspørringer og skrive effektive WHERE-klausuler.",
    "SQL-Performance-Tuning-022": "Hvordan optimerer jeg ytelsen til SQL-spørringer?",
    "SQL-Purpose-003": "Den brukes til å opprette, lese, oppdatere, slette og spørre etter data i tabeller samt administrere databasestruktur og tillatelser.",
    "SQL-Select-009": "Hvordan skriver jeg en grunnleggende SELECT-setning?",
    "SQL-Select-Example-0210": "En enkel SELECT-setning henter data fra en tabell. For eksempel: {0}', 'SELECT column1, column2 FROM my_table;",
    "SQL-Transactions-013": "Hva er transaksjoner i SQL?",
    "SQL-Transactions-Def-014": "En transaksjon er en logisk arbeidsenhet som inneholder en eller flere SQL-setninger. Den sikrer at alle operasjoner i den fullføres vellykket (atomisitet), isolert fra andre transaksjoner og varige selv i tilfelle systemfeil.",
    "SQL-Transactions-Example-015": "For å starte en transaksjon, bruk START TRANSACTION-kommandoen; commit endringer med COMMIT eller rollback til forrige tilstand med ROLLBACK.",
    "SQL-Transactions-W3Schools": "SQL-transaksjoner på W3Schools"
}