{
    "-dxG-aEe4w": "Die maximale Anzahl der heute gesendeten SMS-Bestätigungscodes wurde erreicht.",
    "4sQWoTgfr": "Der Bestätigungscode ist abgelaufen. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut",
    "4sdQWoTgfr": "Der Bestätigungscode ist abgelaufen. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut.",
    "8s1R5nChx": "Der Einladungscode ist leer. Diese Community ist nicht öffentlich, sondern auf eingeladene Benutzer beschränkt.",
    "8s1dX": "Der Einladungscode ist nicht im System vorhanden. Bitte prüfen Sie, ob die Groß-/Kleinschreibung beachtet wird.",
    "8sVG1RXhx": "Das Passwort sollte mindestens 6 Zeichen lang sein",
    "8sVG1RdXhx": "Benutzer-ID existiert bereits",
    "8sVG1kqXhx": "Die Benutzer-ID sollte mindestens 2 Zeichen lang sein",
    "8sVGdXhx": "Die Benutzer-ID sollte nur Buchstaben und Zahlen enthalten",
    "8saIR-LCjyChx": "Der Einladungscode ist abgelaufen",
    "8saIt5r5nGxwwChx": "Der Einladungscode ist aufgebraucht",
    "CuHqw9m": "{0} ist keine gültige Telefonnummer. Das System akzeptiert derzeit nur 11-stellige Telefonnummern.",
    "D_9sNBiZj": "Sie haben es zu oft versucht. Bitte versuchen Sie es später noch einmal.",
    "HZEGO_YeW": "Dies ist eine Testzeichenfolge, um „Hallo Welt“ zu sagen. Ist das in Ordnung?",
    "HaU4NMabv": "Der Bestätigungscode ist falsch. Bitte geben Sie das Bild erneut ein oder aktualisieren Sie es.",
    "K2UEY4ddl": "Die Benutzer-ID enthält ungültige Wörter. Bitte vermeiden Sie die Verwendung von {0}.",
    "RYlJHHwg3": "Der SMS-Code ist nicht korrekt.",
    "TXdh_K": "Passwort",
    "TdXddh_wK": "Telefonnummer",
    "Te3h_wK": "Telefonnummer",
    "TqXdd3h_wK": "Telefonnummer",
    "TqXddh_K": "Bestätigungscode",
    "TqXdh_K": "Bestätige das Passwort",
    "Xddh_wK": "Einladungscode",
    "Y-svpKvUz": "Zwei Passwörter stimmen nicht überein",
    "dsdfqw": "Benutzer existiert nicht",
    "eqwee": "Das Passwort ist nicht korrekt",
    "m1932": "{0} ist Ihr Bestätigungscode",
    "m2308": "Wenn Sie diesen Code nicht angefordert haben, können Sie diese E-Mail getrost ignorieren.",
    "m23091": "Vielen Dank, dass Sie LafTools verwenden. Um Ihre Anfrage abzuschließen, geben Sie bitte den folgenden Bestätigungscode in den Antrag ein:",
    "oHQNQ4mRw": "Benutzer-ID",
    "wCcPJZK": "{0} ist keine gültige E-Mail",
    "wCctGPJZK": "{0} sollte nicht leer sein"
}