{
    "-dxG-aEe4w": "Le nombre maximum de codes de vérification SMS envoyés aujourd'hui a été atteint.",
    "4sQWoTgfr": "Le code de vérification est expiré, veuillez actualiser la page et réessayer",
    "4sdQWoTgfr": "Le code de vérification est expiré, veuillez actualiser la page et réessayer.",
    "8s1R5nChx": "Le code d'invitation est vide, cette communauté n'est pas ouverte au public mais limitée aux utilisateurs invités.",
    "8s1dX": "Le code d'invitation n'existe pas dans le système, veuillez vérifier s'il existe un problème sensible à la casse.",
    "8sVG1RXhx": "le mot de passe doit contenir au moins 6 caractères",
    "8sVG1RdXhx": "L'ID utilisateur existe déjà",
    "8sVG1kqXhx": "L'ID utilisateur doit comporter au moins 2 caractères",
    "8sVGdXhx": "L'ID utilisateur ne doit contenir que des lettres et des chiffres",
    "8saIR-LCjyChx": "Le code d'invitation a expiré",
    "8saIt5r5nGxwwChx": "Le code d'invitation a été utilisé",
    "CuHqw9m": "{0} n'est pas un numéro de téléphone valide. Actuellement, le système n'accepte que les numéros de téléphone à 11 chiffres.",
    "D_9sNBiZj": "Vous avez essayé trop de fois, veuillez réessayer plus tard.",
    "HZEGO_YeW": "Il s'agit d'une chaîne de test pour dire Hello World, est-ce que ça va ?",
    "HaU4NMabv": "Le code de vérification est incorrect, veuillez saisir à nouveau ou actualiser l'image.",
    "K2UEY4ddl": "L'ID utilisateur contient des mots non valides, veuillez éviter d'utiliser {0}",
    "RYlJHHwg3": "Le code SMS n'est pas correct.",
    "TXdh_K": "Mot de passe",
    "TdXddh_wK": "Numéro de téléphone",
    "Te3h_wK": "Numéro de téléphone",
    "TqXdd3h_wK": "Numéro de téléphone",
    "TqXddh_K": "Le code de vérification",
    "TqXdh_K": "Confirmez le mot de passe",
    "Xddh_wK": "code d'invitation",
    "Y-svpKvUz": "deux mots de passe ne correspondent pas",
    "dsdfqw": "L'utilisateur n'existe pas",
    "eqwee": "Le mot de passe n'est pas correct",
    "m1932": "{0} est votre code de vérification",
    "m2308": "Si vous n'avez pas demandé ce code, vous pouvez ignorer cet e-mail en toute sécurité.",
    "m23091": "Merci d'utiliser LafTools. Pour compléter votre demande, veuillez saisir le code de vérification suivant dans l'application :",
    "oHQNQ4mRw": "ID de l'utilisateur",
    "wCcPJZK": "{0} n'est pas une adresse e-mail valide",
    "wCctGPJZK": "{0} ne doit pas être vide"
}