{
    "-dxG-aEe4w": "Maksymalna liczba wysłanych dzisiaj kodów weryfikacyjnych SMS została osiągnięta.",
    "4sQWoTgfr": "Kod weryfikacyjny wygasł. Odśwież stronę i spróbuj ponownie",
    "4sdQWoTgfr": "Kod weryfikacyjny wygasł. Odśwież stronę i spróbuj ponownie.",
    "8s1R5nChx": "Kod zaproszenia jest pusty, ta społeczność nie jest otwarta dla publiczności, ale ograniczona do zaproszonych użytkowników.",
    "8s1dX": "Kod zaproszenia nie istnieje w systemie. Sprawdź, czy wielkość liter ma znaczenie.",
    "8sVG1RXhx": "hasło powinno składać się z co najmniej 6 znaków",
    "8sVG1RdXhx": "Identyfikator użytkownika już istnieje",
    "8sVG1kqXhx": "Identyfikator użytkownika powinien składać się z co najmniej 2 znaków",
    "8sVGdXhx": "Identyfikator użytkownika powinien zawierać wyłącznie litery i cyfry",
    "8saIR-LCjyChx": "Kod zaproszenia wygasł",
    "8saIt5r5nGxwwChx": "Kod zaproszenia został wykorzystany",
    "CuHqw9m": "{0} nie jest prawidłowym numerem telefonu, obecnie system akceptuje tylko 11-cyfrowy numer telefonu.",
    "D_9sNBiZj": "Próbowano zbyt wiele razy. Spróbuj ponownie później.",
    "HZEGO_YeW": "To jest ciąg testowy, który ma powiedzieć „Hello World, czy wszystko w porządku?”",
    "HaU4NMabv": "Kod weryfikacyjny jest nieprawidłowy. Wprowadź ponownie lub odśwież obraz.",
    "K2UEY4ddl": "Identyfikator użytkownika zawiera nieprawidłowe słowa, unikaj używania {0}",
    "RYlJHHwg3": "Kod SMS jest nieprawidłowy.",
    "TXdh_K": "Hasło",
    "TdXddh_wK": "Numer telefonu",
    "Te3h_wK": "Numer telefonu",
    "TqXdd3h_wK": "Numer telefonu",
    "TqXddh_K": "Kod weryfikacyjny",
    "TqXdh_K": "Potwierdź hasło",
    "Xddh_wK": "Kod zaproszenia",
    "Y-svpKvUz": "dwa hasła nie pasują do siebie",
    "dsdfqw": "użytkownik nie istnieje",
    "eqwee": "Hasło jest nieprawidłowe",
    "m1932": "{0} to Twój kod weryfikacyjny",
    "m2308": "Jeśli nie prosiłeś o ten kod, możesz bezpiecznie zignorować tę wiadomość e-mail.",
    "m23091": "Dziękujemy za korzystanie z LafTools. Aby zrealizować zgłoszenie, prosimy o wpisanie w aplikacji następującego kodu weryfikacyjnego:",
    "oHQNQ4mRw": "Identyfikator użytkownika",
    "wCcPJZK": "{0} nie jest prawidłowym adresem e-mail",
    "wCctGPJZK": "{0} nie powinien być pusty"
}