{
    "Diff-XML-JSON-Article": "Forskellen mellem XML og JSON",
    "MDN-XML-Syntax": "MDN Web Docs - XML-syntaks",
    "W3Schools-XML-Validation": "W3Schools - XML-validering",
    "XML-Advantage-Readable-018": "Dens menneskelæselige natur giver mulighed for nem inspektion og fejlfinding, og evnen til at definere brugerdefinerede strukturer gør den fleksibel til flere brugssager.",
    "XML-Advantage-Standardized-017": "XML er en almindeligt anvendt standard, der gør den kompatibel med forskellige platforme og systemer, hvilket fremmer interoperabilitet og dataudveksling.",
    "XML-Advantages-016": "Hvad er fordelene ved at bruge XML?",
    "XML-Attributes-006": "Elementer kan have attributter, som giver yderligere oplysninger om elementet i åbningstagget, såsom {0}",
    "XML-Basics-001": "Hvad er XML?",
    "XML-Def-002": "XML (eXtensible Markup Language) er et opmærkningssprog, der definerer et sæt regler for kodning af dokumenter i et format, der både kan læses af mennesker og maskinlæsbart.",
    "XML-Disadvantage-Size-020": "XML kan være relativt omfattende, hvilket resulterer i større filstørrelser sammenlignet med alternativer som JSON, hvilket påvirker transmissionshastighed og lagerkrav.",
    "XML-Disadvantages-019": "Hvad er nogle ulemper ved at bruge XML?",
    "XML-JSON-Diff-Structure-014": "XML bruger verbose, hierarkiske tags til struktur, mens JSON er afhængig af nøgleværdi-par og arrays. Eksempel: XML {0} vs. JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML har en strengere syntaks med afsluttende tags og attributter, hvorimod JSONs syntaks er lettere og tættere på JavaScript-objektnotation. JSON anses generelt for at være lettere at parse og overføre over nettet.",
    "XML-JSON-Difference-013": "Hvad er forskellen mellem XML og JSON?",
    "XML-Nesting-007": "Hvordan fungerer nesting i XML?",
    "XML-Nesting-Example-009": "For eksempel repræsenterer `<book><title>Min bogtitel</title><author>John Doe</author></book>` en bog med dens titel og forfatter som indlejrede elementer.",
    "XML-Nesting-Explanation-008": "I XML kan elementer indlejres i hinanden for at repræsentere hierarkiske relationer. De underordnede elementer placeres mellem åbnings- og lukketags for deres overordnede element.",
    "XML-Processing-Speed-021": "Parsing og generering af XML kan være langsommere på grund af dens strenge syntaks og behov for validering, især når man beskæftiger sig med komplekse dokumenter.",
    "XML-Purpose-003": "Det er designet til at bære data i stedet for at vise data som HTML, hvilket gør det muligt at bruge det som et fælles format til deling af struktureret information på tværs af forskellige platforme og applikationer.",
    "XML-Syntax-004": "Hvad er den grundlæggende syntaks for XML?",
    "XML-Syntax-Example-005": "Et simpelt XML-dokument består af elementer i en trælignende struktur. Hvert element starter med et tag i vinkelparenteser (<element>) og slutter med et afsluttende tag (</element>).",
    "XML-Validation-010": "Hvad er XML-validering, og hvordan fungerer det?",
    "XML-Validation-Def-011": "XML-validering sikrer, at et XML-dokument overholder et specifikt sæt regler, der er defineret i en Document Type Definition (DTD) eller et XML-skema (XSD).",
    "XML-Validation-Process-012": "Validatorer kontrollerer, om alle nødvendige elementer og attributter er til stede, validerer datatyperne og håndhæver eventuelle begrænsninger, der er angivet i skemaet, før de behandler dokumentet."
}