{
    "Diff-XML-JSON-Article": "Perbezaan Antara XML dan JSON",
    "MDN-XML-Syntax": "Dokumen Web MDN - Sintaks XML",
    "W3Schools-XML-Validation": "W3Schools - Pengesahan XML",
    "XML-Advantage-Readable-018": "Sifatnya yang boleh dibaca oleh manusia membolehkan pemeriksaan dan penyahpepijatan yang mudah, dan keupayaan untuk menentukan struktur tersuai menjadikannya fleksibel untuk berbilang kes penggunaan.",
    "XML-Advantage-Standardized-017": "XML ialah piawaian yang diterima pakai secara meluas, menjadikannya serasi dengan pelbagai platform dan sistem, menggalakkan kesalingoperasian dan pertukaran data.",
    "XML-Advantages-016": "Apakah kelebihan menggunakan XML?",
    "XML-Attributes-006": "Elemen boleh mempunyai atribut, yang memberikan maklumat tambahan tentang elemen dalam teg pembukaan, seperti {0}",
    "XML-Basics-001": "Apakah XML?",
    "XML-Def-002": "XML (Bahasa Penanda eXtensible) ialah bahasa penanda yang mentakrifkan satu set peraturan untuk pengekodan dokumen dalam format yang boleh dibaca oleh manusia dan boleh dibaca oleh mesin.",
    "XML-Disadvantage-Size-020": "XML boleh menjadi agak bertele-tele, menghasilkan saiz fail yang lebih besar berbanding alternatif seperti JSON, yang memberi kesan kepada kelajuan penghantaran dan keperluan storan.",
    "XML-Disadvantages-019": "Apakah beberapa kelemahan menggunakan XML?",
    "XML-JSON-Diff-Structure-014": "XML menggunakan verbose, teg hierarki untuk struktur, manakala JSON bergantung pada pasangan nilai kunci dan tatasusunan. Contoh: XML {0} lwn. JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML mempunyai sintaks yang lebih ketat dengan teg penutup dan atribut, manakala sintaks JSON lebih ringan dan lebih dekat dengan tatatanda objek JavaScript. JSON biasanya dianggap lebih mudah untuk dihuraikan dan dihantar melalui web.",
    "XML-JSON-Difference-013": "Apakah perbezaan antara XML dan JSON?",
    "XML-Nesting-007": "Bagaimanakah sarang berfungsi dalam XML?",
    "XML-Nesting-Example-009": "Sebagai contoh, `<book><title>Tajuk Buku Saya</title><author>John Doe</author></book>` mewakili buku dengan tajuk dan pengarangnya sebagai elemen bersarang.",
    "XML-Nesting-Explanation-008": "Dalam XML, elemen boleh bersarang di dalam satu sama lain untuk mewakili perhubungan hierarki. Elemen anak diletakkan di antara tag pembuka dan penutup elemen induknya.",
    "XML-Processing-Speed-021": "Menghuraikan dan menjana XML boleh menjadi lebih perlahan kerana sintaksnya yang ketat dan keperluan untuk pengesahan, terutamanya apabila berurusan dengan dokumen yang kompleks.",
    "XML-Purpose-003": "Ia direka bentuk untuk membawa data, bukannya memaparkan data seperti HTML, membolehkannya digunakan sebagai format biasa untuk berkongsi maklumat berstruktur merentas platform dan aplikasi yang berbeza.",
    "XML-Syntax-004": "Apakah sintaks asas XML?",
    "XML-Syntax-Example-005": "Dokumen XML ringkas terdiri daripada elemen dalam struktur seperti pokok. Setiap elemen bermula dengan teg dalam kurungan sudut (<element>) dan berakhir dengan teg penutup (</element>).",
    "XML-Validation-010": "Apakah pengesahan XML, dan bagaimana ia berfungsi?",
    "XML-Validation-Def-011": "Pengesahan XML memastikan bahawa dokumen XML mematuhi set peraturan khusus yang ditakrifkan dalam Definisi Jenis Dokumen (DTD) atau Skema XML (XSD).",
    "XML-Validation-Process-012": "Pengesah menyemak sama ada semua elemen dan atribut yang diperlukan ada, mengesahkan jenis data dan menguatkuasakan sebarang kekangan yang dinyatakan dalam skema sebelum memproses dokumen."
}