{
    "Diff-XML-JSON-Article": "Forskjellen mellom XML og JSON",
    "MDN-XML-Syntax": "MDN Web Docs - XML-syntaks",
    "W3Schools-XML-Validation": "W3Schools - XML-validering",
    "XML-Advantage-Readable-018": "Dens menneskelesbare natur muliggjør enkel inspeksjon og feilsøking, og muligheten til å definere tilpassede strukturer gjør den fleksibel for flere brukstilfeller.",
    "XML-Advantage-Standardized-017": "XML er en mye brukt standard som gjør den kompatibel med ulike plattformer og systemer, noe som fremmer interoperabilitet og datautveksling.",
    "XML-Advantages-016": "Hva er fordelene med å bruke XML?",
    "XML-Attributes-006": "Elementer kan ha attributter som gir tilleggsinformasjon om elementet i åpningstaggen, for eksempel {0}",
    "XML-Basics-001": "Hva er XML?",
    "XML-Def-002": "XML (eXtensible Markup Language) er et markup-språk som definerer et sett med regler for koding av dokumenter i et format som er både lesbart for mennesker og maskinlesbart.",
    "XML-Disadvantage-Size-020": "XML kan være relativt detaljert, noe som resulterer i større filstørrelser sammenlignet med alternativer som JSON, noe som påvirker overføringshastighet og lagringskrav.",
    "XML-Disadvantages-019": "Hva er noen ulemper ved å bruke XML?",
    "XML-JSON-Diff-Structure-014": "XML bruker detaljerte, hierarkiske tagger for struktur, mens JSON er avhengig av nøkkelverdi-par og matriser. Eksempel: XML {0} vs. JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML har en strengere syntaks med avsluttende tagger og attributter, mens JSONs syntaks er lettere og nærmere JavaScript-objektnotasjon. JSON anses generelt som enklere å analysere og overføre over nettet.",
    "XML-JSON-Difference-013": "Hva er forskjellen mellom XML og JSON?",
    "XML-Nesting-007": "Hvordan fungerer nesting i XML?",
    "XML-Nesting-Example-009": "For eksempel representerer `<book><title>Min boktittel</title><author>John Doe</author></book>` en bok med tittel og forfatter som nestede elementer.",
    "XML-Nesting-Explanation-008": "I XML kan elementer nestes inne i hverandre for å representere hierarkiske relasjoner. De underordnede elementene plasseres mellom åpnings- og lukketaggene til overordnet element.",
    "XML-Processing-Speed-021": "Parsing og generering av XML kan gå langsommere på grunn av dens strenge syntaks og behov for validering, spesielt når du arbeider med komplekse dokumenter.",
    "XML-Purpose-003": "Den er designet for å bære data, i stedet for å vise data som HTML, noe som gjør at den kan brukes som et vanlig format for å dele strukturert informasjon på tvers av forskjellige plattformer og applikasjoner.",
    "XML-Syntax-004": "Hva er den grunnleggende syntaksen til XML?",
    "XML-Syntax-Example-005": "Et enkelt XML-dokument består av elementer i en trelignende struktur. Hvert element starter med en tag i vinkelparenteser (<element>) og slutter med en avsluttende tag (</element>).",
    "XML-Validation-010": "Hva er XML-validering, og hvordan fungerer det?",
    "XML-Validation-Def-011": "XML-validering sikrer at et XML-dokument overholder et spesifikt sett med regler definert i en Document Type Definition (DTD) eller et XML-skjema (XSD).",
    "XML-Validation-Process-012": "Validatorer sjekker om alle nødvendige elementer og attributter er til stede, validerer datatypene og håndhever eventuelle begrensninger spesifisert i skjemaet før de behandler dokumentet."
}