{
    "Diff-XML-JSON-Article": "Skillnaden mellan XML och JSON",
    "MDN-XML-Syntax": "MDN Web Docs - XML-syntax",
    "W3Schools-XML-Validation": "W3Schools - XML-validering",
    "XML-Advantage-Readable-018": "Dess läsbara karaktär möjliggör enkel inspektion och felsökning, och möjligheten att definiera anpassade strukturer gör den flexibel för flera användningsfall.",
    "XML-Advantage-Standardized-017": "XML är en allmänt antagen standard som gör den kompatibel med olika plattformar och system, vilket främjar interoperabilitet och datautbyte.",
    "XML-Advantages-016": "Vilka är fördelarna med att använda XML?",
    "XML-Attributes-006": "Element kan ha attribut som ger ytterligare information om elementet i öppningstaggen, som {0}",
    "XML-Basics-001": "Vad är XML?",
    "XML-Def-002": "XML (eXtensible Markup Language) är ett märkningsspråk som definierar en uppsättning regler för kodning av dokument i ett format som är både läsbart för människor och maskinläsbart.",
    "XML-Disadvantage-Size-020": "XML kan vara relativt utförligt, vilket resulterar i större filstorlekar jämfört med alternativ som JSON, vilket påverkar överföringshastighet och lagringskrav.",
    "XML-Disadvantages-019": "Vilka är några nackdelar med att använda XML?",
    "XML-JSON-Diff-Structure-014": "XML använder utförliga, hierarkiska taggar för struktur, medan JSON förlitar sig på nyckel-värdepar och matriser. Exempel: XML {0} kontra JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML har en striktare syntax med avslutande taggar och attribut, medan JSONs syntax är lättare och närmare JavaScript-objektnotation. JSON anses generellt vara lättare att analysera och överföra över webben.",
    "XML-JSON-Difference-013": "Vad är skillnaden mellan XML och JSON?",
    "XML-Nesting-007": "Hur fungerar kapsling i XML?",
    "XML-Nesting-Example-009": "Till exempel, `<book><title>Min boktitel</title><author>John Doe</author></book>` representerar en bok med dess titel och författare som kapslade element.",
    "XML-Nesting-Explanation-008": "I XML kan element kapslas inuti varandra för att representera hierarkiska relationer. De underordnade elementen placeras mellan öppnings- och stängningstaggar för deras överordnade element.",
    "XML-Processing-Speed-021": "Parsning och generering av XML kan vara långsammare på grund av dess strikta syntax och behov av validering, särskilt när man hanterar komplexa dokument.",
    "XML-Purpose-003": "Den är utformad för att bära data, snarare än att visa data som HTML, vilket gör att den kan användas som ett vanligt format för att dela strukturerad information över olika plattformar och applikationer.",
    "XML-Syntax-004": "Vad är den grundläggande syntaxen för XML?",
    "XML-Syntax-Example-005": "Ett enkelt XML-dokument består av element i en trädliknande struktur. Varje element börjar med en tagg inom vinkelparenteser (<element>) och slutar med en avslutande tagg (</element>).",
    "XML-Validation-010": "Vad är XML-validering och hur fungerar det?",
    "XML-Validation-Def-011": "XML-validering säkerställer att ett XML-dokument följer en specifik uppsättning regler definierade i en Document Type Definition (DTD) eller ett XML-schema (XSD).",
    "XML-Validation-Process-012": "Validatorer kontrollerar om alla nödvändiga element och attribut finns, validerar datatyperna och upprätthåller eventuella begränsningar som anges i schemat innan dokumentet behandlas."
}