{
    "Diff-XML-JSON-Article": "Sự khác biệt giữa XML và JSON",
    "MDN-XML-Syntax": "Tài liệu web MDN - Cú pháp XML",
    "W3Schools-XML-Validation": "W3Schools - Xác thực XML",
    "XML-Advantage-Readable-018": "Bản chất con người có thể đọc được của nó cho phép kiểm tra và gỡ lỗi dễ dàng, đồng thời khả năng xác định cấu trúc tùy chỉnh giúp nó linh hoạt cho nhiều trường hợp sử dụng.",
    "XML-Advantage-Standardized-017": "XML là một tiêu chuẩn được áp dụng rộng rãi, làm cho nó tương thích với nhiều nền tảng và hệ thống khác nhau, thúc đẩy khả năng tương tác và trao đổi dữ liệu.",
    "XML-Advantages-016": "Ưu điểm của việc sử dụng XML là gì?",
    "XML-Attributes-006": "Các phần tử có thể có các thuộc tính cung cấp thông tin bổ sung về phần tử trong thẻ mở, chẳng hạn như {0}",
    "XML-Basics-001": "XML là gì?",
    "XML-Def-002": "XML (Ngôn ngữ đánh dấu eXtensible) là ngôn ngữ đánh dấu xác định một bộ quy tắc để mã hóa tài liệu theo định dạng mà cả con người và máy đều có thể đọc được.",
    "XML-Disadvantage-Size-020": "XML có thể tương đối dài dòng, dẫn đến kích thước tệp lớn hơn so với các lựa chọn thay thế như JSON, điều này ảnh hưởng đến tốc độ truyền và yêu cầu lưu trữ.",
    "XML-Disadvantages-019": "Một số nhược điểm của việc sử dụng XML là gì?",
    "XML-JSON-Diff-Structure-014": "XML sử dụng các thẻ dài dòng, phân cấp cho cấu trúc, trong khi JSON dựa vào các cặp và mảng khóa-giá trị. Ví dụ: XML {0} so với JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML có cú pháp chặt chẽ hơn với các thẻ và thuộc tính đóng, trong khi cú pháp của JSON nhẹ hơn và gần với ký hiệu đối tượng JavaScript hơn. JSON thường được coi là dễ phân tích và truyền tải qua web hơn.",
    "XML-JSON-Difference-013": "Sự khác biệt giữa XML và JSON là gì?",
    "XML-Nesting-007": "Việc lồng nhau hoạt động như thế nào trong XML?",
    "XML-Nesting-Example-009": "Ví dụ: `<book><title>Tiêu đề sách của tôi</title><author>John Doe</author></book>` biểu thị một cuốn sách có tiêu đề và tác giả dưới dạng các phần tử lồng nhau.",
    "XML-Nesting-Explanation-008": "Trong XML, các phần tử có thể được lồng vào nhau để thể hiện mối quan hệ phân cấp. Các phần tử con được đặt giữa thẻ mở và thẻ đóng của phần tử cha.",
    "XML-Processing-Speed-021": "Việc phân tích cú pháp và tạo XML có thể chậm hơn do cú pháp nghiêm ngặt và cần xác thực, đặc biệt khi xử lý các tài liệu phức tạp.",
    "XML-Purpose-003": "Nó được thiết kế để mang dữ liệu, thay vì hiển thị dữ liệu như HTML, cho phép nó được sử dụng làm định dạng chung để chia sẻ thông tin có cấu trúc trên các nền tảng và ứng dụng khác nhau.",
    "XML-Syntax-004": "Cú pháp cơ bản của XML là gì?",
    "XML-Syntax-Example-005": "Một tài liệu XML đơn giản bao gồm các phần tử có cấu trúc dạng cây. Mỗi phần tử bắt đầu bằng một thẻ trong ngoặc nhọn (<element>) và kết thúc bằng thẻ đóng (</element>).",
    "XML-Validation-010": "Xác thực XML là gì và nó hoạt động như thế nào?",
    "XML-Validation-Def-011": "Xác thực XML đảm bảo rằng tài liệu XML tuân thủ một bộ quy tắc cụ thể được xác định trong Định nghĩa loại tài liệu (DTD) hoặc Lược đồ XML (XSD).",
    "XML-Validation-Process-012": "Trình xác thực sẽ kiểm tra xem tất cả các phần tử và thuộc tính bắt buộc có hiện diện hay không, xác thực các kiểu dữ liệu và thực thi bất kỳ ràng buộc nào được chỉ định trong lược đồ trước khi xử lý tài liệu."
}