{
    "dWbBm": "C# inclui a classe 'System.Convert' com métodos integrados ToBase64String e FromBase64String que permitem codificar e decodificar dados Base64. A string de entrada é primeiro convertida em uma matriz de bytes usando a codificação UTF-8 e, em seguida, codificada e decodificada de acordo.",
    "eN4fM": "No Rust, você pode usar a caixa 'base64' para codificação e decodificação Base64. Adicione 'base64 = \\\"1.x\\\"' ao seu arquivo Cargo.toml na seção [dependências], execute 'cargo build' e inclua as importações necessárias em seu código para utilizar essas funções.",
    "fTt2N": "Perl requer o módulo 'MIME::Base64' para codificação e decodificação Base64. Instale-o executando 'cpan install MIME::Base64' se ainda não estiver instalado.",
    "gT6re": "C++ não possui uma implementação nativa de Base64. Este exemplo usa a biblioteca OpenSSL para realizar codificação e decodificação Base64. Para usar OpenSSL, instale-o em seu sistema e vincule-o às bibliotecas apropriadas ao compilar seu programa.",
    "h7rUq": "No Node.js, a classe 'Buffer' integrada pode lidar com codificação e decodificação Base64 sem exigir nenhuma biblioteca externa. Este trecho de código codifica a string 'TEST12345' para Base64 e depois a decodifica de volta para a string original.",
    "jRzgS": "A estrutura Foundation do Swift inclui métodos integrados para codificação e decodificação Base64. Nenhuma biblioteca externa é necessária; basta importar 'Foundation' para usar esses recursos.",
    "jZvLJ": "PHP vem com funções integradas 'base64_encode()' e 'base64_decode()' para lidar com operações Base64. Essas funções estão prontamente disponíveis e não requerem configuração ou instalação adicional.",
    "kZd9G": "Ruby possui uma biblioteca 'base64' integrada que fornece métodos para codificação e decodificação Base64. Inclua a biblioteca com 'require \\\"base64\\\"' no seu script.",
    "rLXJN": "No Kotlin, a classe 'android.util.Base64' integrada do Android pode ser usada para codificação e decodificação Base64. Este exemplo pressupõe um ambiente Android; para projetos Kotlin não Android, considere usar 'java.util.Base64'.",
    "sBxHr": "Scala usa a classe 'java.util.Base64' integrada do Java para operações Base64. Certifique-se de estar executando em uma plataforma JVM com Java 8 ou superior.",
    "sKx5t": "A classe 'java.util.Base64' integrada do Java, disponível desde Java 8, fornece métodos para codificação e decodificação Base64. A string de entrada é convertida em bytes usando a codificação UTF-8 e, em seguida, codificada e decodificada conforme necessário.",
    "tR8pY": "Go fornece um pacote de biblioteca padrão 'encoding/base64' com funções para codificação e decodificação Base64. Nenhuma dependência externa é necessária; simplesmente importe este pacote para o seu programa Go e chame as funções apropriadas.",
    "uW7eZ": "Em C, não há implementação nativa de Base64. Este exemplo usa a biblioteca OpenSSL para codificação e decodificação Base64. Para usar este trecho de código, instale o OpenSSL em seu sistema e vincule-se às bibliotecas apropriadas ao compilar seu programa usando um comando semelhante a 'gcc -o base64_example base64_example.c -lssl -lcrypto'.",
    "z9kVv": "Python possui um módulo 'base64' integrado que fornece métodos para codificação e decodificação Base64. A string de entrada é primeiro convertida em bytes usando a codificação UTF-8 antes de ser codificada em Base64 e, em seguida, decodificada de volta à sua forma original."
}