import { Container, Title, Accordion } from '@mantine/core';

export default () => {
    return <Container size="sm" >
        <div className="container">
            <h1>秒达工具箱 - 隐私保护协议</h1>

            <h2>一、隐私保护承诺</h2>
            <p>秒达工具箱深知用户隐私的重要性，我们承诺将采取合理措施保护用户的隐私。我们不会未经用户同意收集、使用或分享用户的个人信息。</p>

            <h2>二、个人信息收集</h2>
            <p>我们不会主动收集用户的个人信息。但在使用秒达工具箱的过程中，某些功能可能需要用户主动提供部分信息，如账号注册、反馈建议等。此类信息仅用于提供更好的服务，不会用于其他用途。</p>

            <h2>二、个人信息使用与共享</h2>
            <p>我们承诺不会将用户的个人信息出售、出租或以其他方式分享给第三方，除非：</p>
            <ul>
                <li>用户明确同意共享信息；</li>
                <li>根据法律法规或政府机关的要求，我们必须提供用户信息；</li>
                <li>为了保护秒达工具箱、用户或他人的合法权益，例如防止欺诈或侵权行为。</li>
            </ul>

            <h2>三、信息安全</h2>
            <p>我们将采取合理的安全措施，以防止未经授权的访问、使用、修改或破坏用户信息。但请注意，任何安全措施都无法保证100%的安全，我们将尽力保护用户的个人信息。</p>

            <h2>四、法律与合规</h2>
            <p>在某些情况下，我们可能会根据法律、法规或政府机关的要求，披露用户的个人信息。在此情况下，我们将尽力确保用户的隐私权益得到充分保护。</p>

            <h2>五、隐私保护协议的更新</h2>
            <p>我们可能会不时更新本隐私保护协议，以反映法律法规、市场需求和技术发展等方面的变化。更新后的协议将在秒达工具箱官方网站上发布，并立即生效。</p>

            <h2>六、联系我们</h2>
            <p>如果您对隐私保护协议有任何疑问或建议，请随时通过以下方式联系我们：</p>
            <p>邮箱：work7z@outlook.com</p>
        </div>
    </Container >
}