{
    "41ev7": "MD2",
    "5-S-B": "MD4 ze souboru",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) je kryptografická hašovací funkce, která přijímá vstup a vytváří 128bitovou (16bajtovou) hašovací hodnotu. Byl vyvinut Ronaldem Rivestem v roce 1989 jako nástupce MD1. MD2 je optimalizován pro 8bitové počítače a ve srovnání s jinými hashovacími funkcemi je relativně jednoduchý. Ukázalo se však, že MD2 je zranitelný vůči kolizním útokům a již není považován za bezpečný pro kryptografické účely. MD2 se stále používá v některých aplikacích, ale postupně se vyřazuje ve prospěch bezpečnějších hashovacích funkcí, jako jsou SHA-256 a SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) je kryptografická hašovací funkce, která přijímá vstup a vytváří 128bitovou (16bajtovou) hašovací hodnotu. Byl vyvinut Ronaldem Rivestem v roce 1990 jako nástupce MD2 a MD3. Ukázalo se však, že MD4 je zranitelný vůči kolizním útokům a již není považován za bezpečný pro kryptografické účely. MD4 se stále používá v některých aplikacích, ale postupně se vyřazuje ve prospěch bezpečnějších hashovacích funkcí, jako jsou SHA-256 a SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Kliknutím sem zašifrujete svůj vstupní text",
    "ECm8j": "Kliknutím sem zašifrujete svůj vstupní text",
    "IP8-V": "MD2 z Textu",
    "IPtV": "MD4 z Textu",
    "P56UK": "Kliknutím sem zašifrujete svůj vstupní text",
    "PJNze": "Kliknutím sem zašifrujete svůj vstupní text",
    "REFy8": "Kliknutím sem zašifrujete svůj vstupní text",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Všechny nástroje",
    "eNNrM": "MD2 ze souboru",
    "g0QB9": "Algoritmus zpracování zpráv MD5 je široce používaná hašovací funkce vytvářející 128bitovou hašovací hodnotu. MD5 navrhl Ronald Rivest v roce 1991, aby nahradil dřívější hashovací funkci MD4[3], a v roce 1992 byl specifikován jako RFC 1321. MD5 lze použít jako kontrolní součet k ověření integrity dat proti neúmyslnému poškození. Historicky byl široce používán jako kryptografická hashovací funkce; bylo však zjištěno, že trpí rozsáhlými zranitelnostmi. Zůstává vhodný pro jiné nekryptografické účely, například pro určení oddílu pro konkrétní klíč v rozdělené databázi, a může být preferován kvůli nižším výpočetním požadavkům než novější algoritmy Secure Hash Algorithms.[4]",
    "gh9zA": "SHA-1 nebo Secure Hash Algorithm 1 je kryptografický algoritmus, který přijímá vstup a vytváří 160bitovou (20bajtovou) hodnotu hash.",
    "gh9zA.sha224": "SHA-224 je kryptografická hašovací funkce, která přijímá vstup a vytváří 224bitovou (28bajtovou) hašovací hodnotu. Je součástí rodiny hashovacích funkcí SHA-2, která také zahrnuje SHA-256, SHA-384 a SHA-512. SHA-224 je navržen tak, aby byl bezpečnější než jeho předchůdce SHA-1, u kterého se ukázalo, že je zranitelný vůči útokům kolize. SHA-224 je široce používán v digitálních podpisech, ověřovacích kódech zpráv a dalších aplikacích, kde je kritická integrita dat.",
    "gh9zA.sha256": "SHA-256 je kryptografická hašovací funkce, která přijímá vstup a vytváří 256bitovou (32bajtovou) hašovací hodnotu. Je součástí rodiny hashovacích funkcí SHA-2, která také zahrnuje SHA-224, SHA-384 a SHA-512. SHA-256 je navržen tak, aby byl bezpečnější než jeho předchůdce SHA-1, u kterého se ukázalo, že je zranitelný vůči útokům kolize. SHA-256 je široce používán v digitálních podpisech, ověřovacích kódech zpráv a dalších aplikacích, kde je kritická integrita dat.",
    "gh9zA.sha384": "SHA-384 je kryptografická hašovací funkce, která přijímá vstup a vytváří 384bitovou (48bajtovou) hašovací hodnotu. Je součástí rodiny hashovacích funkcí SHA-2, která také zahrnuje SHA-224, SHA-256, SHA-512, SHA-512/224 a SHA-512/256. SHA-384 je navržen tak, aby byl bezpečnější než jeho předchůdce SHA-1, u kterého se ukázalo, že je zranitelný vůči útokům kolize. SHA-384 je široce používán v digitálních podpisech, ověřovacích kódech zpráv a dalších aplikacích, kde je kritická integrita dat.",
    "gh9zA.sha512": "SHA-512 je kryptografická hašovací funkce, která přijímá vstup a vytváří 512bitovou (64bajtovou) hašovací hodnotu. Je součástí rodiny hashovacích funkcí SHA-2, která také zahrnuje SHA-224, SHA-256, SHA-384, SHA-512/224 a SHA-512/256. SHA-512 je navržen tak, aby byl bezpečnější než jeho předchůdce SHA-1, u kterého se ukázalo, že je zranitelný vůči útokům kolize. SHA-512 je široce používán v digitálních podpisech, ověřovacích kódech zpráv a dalších aplikacích, kde je kritická integrita dat.",
    "gwo79": "SHA1 ze souboru",
    "gwo79.sha224": "SHA224 ze souboru",
    "gwo79.sha256": "SHA256 ze souboru",
    "gwo79.sha384": "SHA384 ze souboru",
    "gwo79.sha512": "SHA512 ze souboru",
    "jjhid": "to je ahoj světe",
    "m0105": "kodek",
    "m0106": "Konvertor",
    "m0107": "Generátor",
    "m0108": "Formátovač",
    "m0109": "Centrum dokumentů",
    "o3poi": "SHA1 z Text",
    "o3poi.sha224": "SHA224 z Text",
    "o3poi.sha256": "SHA256 z Text",
    "o3poi.sha384": "SHA384 z Text",
    "o3poi.sha512": "SHA512 z Text",
    "pl8S6": "Kliknutím sem zašifrujete svůj vstupní text",
    "qjQvD": "Kliknutím sem zašifrujete svůj vstupní text",
    "vQq9v": "MD5 z Textu",
    "vhgr3": "Kliknutím sem vyberte soubor a přímo jej zašifrujte.",
    "vu10K": "MD5 ze souboru",
    "wqp_4": "Kliknutím sem vyberte soubor a přímo jej zašifrujte.",
    "y_2Q1": "Kódovat a dekódovat",
    "y_2Q2": "Symetrické krypto",
    "y_2Q3": "Asymetrické kryptoměny",
    "y_2Q4": "Čínské národní algoritmy",
    "y_2Q5": "Web Auth",
    "y_BN6": "Algoritmus Digest"
}