{
    "41ev7": "MD2",
    "5-S-B": "MD4 fra fil",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) er en kryptografisk hashfunktion, der tager et input og producerer en 128-bit (16-byte) hashværdi. Den blev udviklet af Ronald Rivest i 1989 som en efterfølger til MD1. MD2 er optimeret til 8-bit computere og er relativt simpel sammenlignet med andre hash-funktioner. MD2 har dog vist sig at være sårbar over for kollisionsangreb og anses ikke længere for at være sikker til kryptografiske formål. MD2 bruges stadig i nogle applikationer, men er ved at blive udfaset til fordel for mere sikre hash-funktioner som SHA-256 og SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) er en kryptografisk hash-funktion, der tager et input og producerer en 128-bit (16-byte) hash-værdi. Den blev udviklet af Ronald Rivest i 1990 som en efterfølger til MD2 og MD3. MD4 har dog vist sig at være sårbar over for kollisionsangreb og anses ikke længere for at være sikker til kryptografiske formål. MD4 bruges stadig i nogle applikationer, men er ved at blive udfaset til fordel for mere sikre hash-funktioner som SHA-256 og SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Klik her for at kryptere din inputtekst",
    "ECm8j": "Klik her for at kryptere din inputtekst",
    "IP8-V": "MD2 fra tekst",
    "IPtV": "MD4 fra Tekst",
    "P56UK": "Klik her for at kryptere din inputtekst",
    "PJNze": "Klik her for at kryptere din inputtekst",
    "REFy8": "Klik her for at kryptere din inputtekst",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Alle værktøjer",
    "eNNrM": "MD2 fra fil",
    "g0QB9": "MD5 message-digest-algoritmen er en meget brugt hash-funktion, der producerer en 128-bit hash-værdi. MD5 blev designet af Ronald Rivest i 1991 til at erstatte en tidligere hash-funktion MD4,[3] og blev specificeret i 1992 som RFC 1321. MD5 kan bruges som en kontrolsum til at verificere dataintegritet mod utilsigtet korruption. Historisk set blev det meget brugt som en kryptografisk hashfunktion; men det har vist sig at lide af omfattende sårbarheder. Det forbliver velegnet til andre ikke-kryptografiske formål, for eksempel til at bestemme partitionen for en bestemt nøgle i en partitioneret database, og kan foretrækkes på grund af lavere beregningskrav end nyere Secure Hash-algoritmer.[4]",
    "gh9zA": "SHA-1 eller Secure Hash Algorithm 1 er en kryptografisk algoritme, som tager et input og producerer en 160-bit (20-byte) hashværdi.",
    "gh9zA.sha224": "SHA-224 er en kryptografisk hashfunktion, der tager et input og producerer en 224-bit (28-byte) hashværdi. Det er en del af SHA-2-familien af ​​hashfunktioner, som også inkluderer SHA-256, SHA-384 og SHA-512. SHA-224 er designet til at være mere sikker end sin forgænger, SHA-1, som har vist sig at være sårbar over for kollisionsangreb. SHA-224 er meget udbredt i digitale signaturer, meddelelsesgodkendelseskoder og andre applikationer, hvor dataintegritet er kritisk.",
    "gh9zA.sha256": "SHA-256 er en kryptografisk hash-funktion, der tager et input og producerer en 256-bit (32-byte) hash-værdi. Det er en del af SHA-2-familien af ​​hashfunktioner, som også inkluderer SHA-224, SHA-384 og SHA-512. SHA-256 er designet til at være mere sikker end sin forgænger, SHA-1, som har vist sig at være sårbar over for kollisionsangreb. SHA-256 er meget brugt i digitale signaturer, meddelelsesgodkendelseskoder og andre applikationer, hvor dataintegritet er kritisk.",
    "gh9zA.sha384": "SHA-384 er en kryptografisk hash-funktion, der tager et input og producerer en 384-bit (48-byte) hashværdi. Det er en del af SHA-2-familien af ​​hashfunktioner, som også inkluderer SHA-224, SHA-256, SHA-512, SHA-512/224 og SHA-512/256. SHA-384 er designet til at være mere sikker end sin forgænger, SHA-1, som har vist sig at være sårbar over for kollisionsangreb. SHA-384 er meget brugt i digitale signaturer, meddelelsesgodkendelseskoder og andre applikationer, hvor dataintegritet er kritisk.",
    "gh9zA.sha512": "SHA-512 er en kryptografisk hashfunktion, der tager et input og producerer en 512-bit (64-byte) hashværdi. Det er en del af SHA-2-familien af ​​hash-funktioner, som også inkluderer SHA-224, SHA-256, SHA-384, SHA-512/224 og SHA-512/256. SHA-512 er designet til at være mere sikker end sin forgænger, SHA-1, som har vist sig at være sårbar over for kollisionsangreb. SHA-512 er meget udbredt i digitale signaturer, meddelelsesgodkendelseskoder og andre applikationer, hvor dataintegritet er kritisk.",
    "gwo79": "SHA1 fra fil",
    "gwo79.sha224": "SHA224 fra fil",
    "gwo79.sha256": "SHA256 fra fil",
    "gwo79.sha384": "SHA384 fra fil",
    "gwo79.sha512": "SHA512 fra fil",
    "jjhid": "det er hej verden",
    "m0105": "Codec",
    "m0106": "Konverter",
    "m0107": "Generator",
    "m0108": "Formater",
    "m0109": "Dokumentcenter",
    "o3poi": "SHA1 fra Tekst",
    "o3poi.sha224": "SHA224 fra Tekst",
    "o3poi.sha256": "SHA256 fra Tekst",
    "o3poi.sha384": "SHA384 fra Tekst",
    "o3poi.sha512": "SHA512 fra Tekst",
    "pl8S6": "Klik her for at kryptere din inputtekst",
    "qjQvD": "Klik her for at kryptere din inputtekst",
    "vQq9v": "MD5 fra Tekst",
    "vhgr3": "Klik her for at vælge en fil og kryptere den direkte.",
    "vu10K": "MD5 fra fil",
    "wqp_4": "Klik her for at vælge en fil og kryptere den direkte.",
    "y_2Q1": "Indkode og afkode",
    "y_2Q2": "Symmetrisk krypto",
    "y_2Q3": "Asymmetrisk krypto",
    "y_2Q4": "Kinas nationale algoritmer",
    "y_2Q5": "Web Auth",
    "y_BN6": "Digest Algoritme"
}