{
    "41ev7": "MD2",
    "5-S-B": "MD4 desde archivo",
    "6wtIW": "MD2 (Algoritmo 2 de resumen de mensajes) es una función hash criptográfica que toma una entrada y produce un valor hash de 128 bits (16 bytes). Fue desarrollado por Ronald Rivest en 1989 como sucesor del MD1. MD2 está optimizado para computadoras de 8 bits y es relativamente simple en comparación con otras funciones hash. Sin embargo, se ha demostrado que MD2 es vulnerable a ataques de colisión y ya no se considera seguro para fines criptográficos. MD2 todavía se usa en algunas aplicaciones, pero se está eliminando gradualmente en favor de funciones hash más seguras como SHA-256 y SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Algoritmo 4 de resumen de mensajes) es una función hash criptográfica que toma una entrada y produce un valor hash de 128 bits (16 bytes). Fue desarrollado por Ronald Rivest en 1990 como sucesor de MD2 y MD3. Sin embargo, se ha demostrado que MD4 es vulnerable a ataques de colisión y ya no se considera seguro para fines criptográficos. MD4 todavía se usa en algunas aplicaciones, pero se está eliminando gradualmente en favor de funciones hash más seguras como SHA-256 y SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Haga clic aquí para cifrar su texto de entrada",
    "ECm8j": "Haga clic aquí para cifrar su texto de entrada",
    "IP8-V": "MD2 de texto",
    "IPtV": "MD4 de texto",
    "P56UK": "Haga clic aquí para cifrar su texto de entrada",
    "PJNze": "Haga clic aquí para cifrar su texto de entrada",
    "REFy8": "Haga clic aquí para cifrar su texto de entrada",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Todas las herramientas",
    "eNNrM": "MD2 desde archivo",
    "g0QB9": "El algoritmo de resumen de mensajes MD5 es una función hash ampliamente utilizada que produce un valor hash de 128 bits. MD5 fue diseñado por Ronald Rivest en 1991 para reemplazar una función hash anterior MD4,[3] y se especificó en 1992 como RFC 1321. MD5 se puede utilizar como suma de verificación para verificar la integridad de los datos contra corrupción involuntaria. Históricamente se utilizó ampliamente como función hash criptográfica; sin embargo, se ha descubierto que sufre importantes vulnerabilidades. Sigue siendo adecuado para otros fines no criptográficos, por ejemplo, para determinar la partición de una clave particular en una base de datos particionada, y puede ser preferido debido a sus menores requisitos computacionales que los algoritmos Hash Seguros más recientes.[4]",
    "gh9zA": "SHA-1 o Secure Hash Algorithm 1 es un algoritmo criptográfico que toma una entrada y produce un valor hash de 160 bits (20 bytes).",
    "gh9zA.sha224": "SHA-224 es una función hash criptográfica que toma una entrada y produce un valor hash de 224 bits (28 bytes). Es parte de la familia de funciones hash SHA-2, que también incluye SHA-256, SHA-384 y SHA-512. SHA-224 está diseñado para ser más seguro que su predecesor, SHA-1, que ha demostrado ser vulnerable a ataques de colisión. SHA-224 se usa ampliamente en firmas digitales, códigos de autenticación de mensajes y otras aplicaciones donde la integridad de los datos es crítica.",
    "gh9zA.sha256": "SHA-256 es una función hash criptográfica que toma una entrada y produce un valor hash de 256 bits (32 bytes). Es parte de la familia de funciones hash SHA-2, que también incluye SHA-224, SHA-384 y SHA-512. SHA-256 está diseñado para ser más seguro que su predecesor, SHA-1, que ha demostrado ser vulnerable a ataques de colisión. SHA-256 se usa ampliamente en firmas digitales, códigos de autenticación de mensajes y otras aplicaciones donde la integridad de los datos es crítica.",
    "gh9zA.sha384": "SHA-384 es una función hash criptográfica que toma una entrada y produce un valor hash de 384 bits (48 bytes). Es parte de la familia de funciones hash SHA-2, que también incluye SHA-224, SHA-256, SHA-512, SHA-512/224 y SHA-512/256. SHA-384 está diseñado para ser más seguro que su predecesor, SHA-1, que ha demostrado ser vulnerable a ataques de colisión. SHA-384 se usa ampliamente en firmas digitales, códigos de autenticación de mensajes y otras aplicaciones donde la integridad de los datos es crítica.",
    "gh9zA.sha512": "SHA-512 es una función hash criptográfica que toma una entrada y produce un valor hash de 512 bits (64 bytes). Es parte de la familia de funciones hash SHA-2, que también incluye SHA-224, SHA-256, SHA-384, SHA-512/224 y SHA-512/256. SHA-512 está diseñado para ser más seguro que su predecesor, SHA-1, que ha demostrado ser vulnerable a ataques de colisión. SHA-512 se usa ampliamente en firmas digitales, códigos de autenticación de mensajes y otras aplicaciones donde la integridad de los datos es crítica.",
    "gwo79": "SHA1 del archivo",
    "gwo79.sha224": "SHA224 del archivo",
    "gwo79.sha256": "SHA256 del archivo",
    "gwo79.sha384": "SHA384 del archivo",
    "gwo79.sha512": "SHA512 del archivo",
    "jjhid": "esto es hola mundo",
    "m0105": "Códec",
    "m0106": "Convertidor",
    "m0107": "Generador",
    "m0108": "Formateador",
    "m0109": "Centro de documentos",
    "o3poi": "SHA1 del texto",
    "o3poi.sha224": "SHA224 del texto",
    "o3poi.sha256": "SHA256 del texto",
    "o3poi.sha384": "SHA384 del texto",
    "o3poi.sha512": "SHA512 del texto",
    "pl8S6": "Haga clic aquí para cifrar su texto de entrada",
    "qjQvD": "Haga clic aquí para cifrar su texto de entrada",
    "vQq9v": "MD5 de texto",
    "vhgr3": "Haga clic aquí para seleccionar un archivo y cifrarlo directamente.",
    "vu10K": "MD5 desde archivo",
    "wqp_4": "Haga clic aquí para seleccionar un archivo y cifrarlo directamente.",
    "y_2Q1": "Codificar y decodificar",
    "y_2Q2": "Cripto simétrico",
    "y_2Q3": "Cripto asimétrico",
    "y_2Q4": "Algoritmos nacionales de China",
    "y_2Q5": "Autenticación web",
    "y_BN6": "Algoritmo de resumen"
}