{
    "41ev7": "MD2",
    "5-S-B": "MD4 tiedostosta",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) on kryptografinen hash-funktio, joka ottaa syötteen ja tuottaa 128-bittisen (16-tavun) hash-arvon. Sen kehitti Ronald Rivest vuonna 1989 MD1:n seuraajaksi. MD2 on optimoitu 8-bittisille tietokoneille ja on suhteellisen yksinkertainen verrattuna muihin hash-toimintoihin. MD2:n on kuitenkin osoitettu olevan alttiina törmäyshyökkäyksille, eikä sitä pidetä enää turvallisena salaustarkoituksiin. MD2 on edelleen käytössä joissakin sovelluksissa, mutta siitä luovutaan asteittain turvallisempien hash-toimintojen, kuten SHA-256 ja SHA-3, hyväksi.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) on kryptografinen hash-funktio, joka ottaa syötteen ja tuottaa 128-bittisen (16-tavun) hash-arvon. Sen kehitti Ronald Rivest vuonna 1990 MD2:n ja MD3:n seuraajaksi. MD4:n on kuitenkin osoitettu olevan alttiina törmäyshyökkäyksille, eikä sitä pidetä enää turvallisena salaustarkoituksiin. MD4 on edelleen käytössä joissakin sovelluksissa, mutta siitä luovutaan asteittain turvallisempien hajautustoimintojen, kuten SHA-256 ja SHA-3, vuoksi.",
    "AWqXD": "MD5",
    "E88Ej": "Napsauta tätä salataksesi syöttämäsi tekstin",
    "ECm8j": "Napsauta tätä salataksesi syöttämäsi tekstin",
    "IP8-V": "MD2 tekstistä",
    "IPtV": "MD4 tekstistä",
    "P56UK": "Napsauta tätä salataksesi syöttämäsi tekstin",
    "PJNze": "Napsauta tätä salataksesi syöttämäsi tekstin",
    "REFy8": "Napsauta tätä salataksesi syöttämäsi tekstin",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Kaikki työkalut",
    "eNNrM": "MD2 tiedostosta",
    "g0QB9": "MD5-sanoman tiivistelmäalgoritmi on laajalti käytetty hash-funktio, joka tuottaa 128-bittisen hash-arvon. Ronald Rivest suunnitteli MD5:n vuonna 1991 korvaamaan aikaisemman hash-funktion MD4[3], ja se määriteltiin vuonna 1992 nimellä RFC 1321. MD5:tä voidaan käyttää tarkistussummana tietojen eheyden varmistamiseen tahattoman korruption varalta. Historiallisesti sitä käytettiin laajalti kryptografisena hash-funktiona; sen on kuitenkin havaittu kärsivän laajoista haavoittuvuuksista. Se sopii edelleen muihin ei-salaukseen liittyviin tarkoituksiin, esimerkiksi tietyn avaimen osion määrittämiseen osioidussa tietokannassa, ja se voi olla parempi, koska laskentavaatimukset ovat alhaisemmat kuin uudemmat Secure Hash -algoritmit.[4]",
    "gh9zA": "SHA-1 tai Secure Hash Algorithm 1 on salausalgoritmi, joka ottaa syötteen ja tuottaa 160-bittisen (20-tavun) hash-arvon.",
    "gh9zA.sha224": "SHA-224 on kryptografinen hash-funktio, joka ottaa syötteen ja tuottaa 224-bittisen (28-tavun) hash-arvon. Se on osa SHA-2-hajautustoimintojen perhettä, johon kuuluvat myös SHA-256, SHA-384 ja SHA-512. SHA-224 on suunniteltu turvallisemmaksi kuin edeltäjänsä SHA-1, jonka on osoitettu olevan alttiina törmäyshyökkäyksille. SHA-224:ää käytetään laajalti digitaalisissa allekirjoituksissa, viestien todennuskoodeissa ja muissa sovelluksissa, joissa tietojen eheys on kriittinen.",
    "gh9zA.sha256": "SHA-256 on kryptografinen hash-funktio, joka ottaa syötteen ja tuottaa 256-bittisen (32-tavun) hash-arvon. Se on osa SHA-2-hajautustoimintojen perhettä, johon kuuluvat myös SHA-224, SHA-384 ja SHA-512. SHA-256 on suunniteltu turvallisemmaksi kuin edeltäjänsä SHA-1, jonka on osoitettu olevan alttiina törmäyshyökkäyksille. SHA-256:ta käytetään laajalti digitaalisissa allekirjoituksissa, viestien todennuskoodeissa ja muissa sovelluksissa, joissa tietojen eheys on kriittinen.",
    "gh9zA.sha384": "SHA-384 on kryptografinen hash-funktio, joka ottaa syötteen ja tuottaa 384-bittisen (48-tavun) hash-arvon. Se on osa SHA-2-hajautustoimintojen perhettä, johon kuuluvat myös SHA-224, SHA-256, SHA-512, SHA-512/224 ja SHA-512/256. SHA-384 on suunniteltu turvallisemmaksi kuin edeltäjänsä SHA-1, jonka on osoitettu olevan alttiina törmäyshyökkäyksille. SHA-384:ää käytetään laajalti digitaalisissa allekirjoituksissa, viestien todennuskoodeissa ja muissa sovelluksissa, joissa tietojen eheys on kriittinen.",
    "gh9zA.sha512": "SHA-512 on kryptografinen hajautusfunktio, joka ottaa syötteen ja tuottaa 512-bittisen (64-tavun) hash-arvon. Se on osa SHA-2-hajautustoimintojen perhettä, johon kuuluvat myös SHA-224, SHA-256, SHA-384, SHA-512/224 ja SHA-512/256. SHA-512 on suunniteltu turvallisemmaksi kuin edeltäjänsä SHA-1, jonka on osoitettu olevan alttiina törmäyshyökkäyksille. SHA-512:ta käytetään laajalti digitaalisissa allekirjoituksissa, viestien todennuskoodeissa ja muissa sovelluksissa, joissa tietojen eheys on kriittinen.",
    "gwo79": "SHA1 tiedostosta",
    "gwo79.sha224": "SHA224 tiedostosta",
    "gwo79.sha256": "SHA256 tiedostosta",
    "gwo79.sha384": "SHA384 tiedostosta",
    "gwo79.sha512": "SHA512 tiedostosta",
    "jjhid": "tämä on hei, maailma",
    "m0105": "Codec",
    "m0106": "Muunnin",
    "m0107": "Generaattori",
    "m0108": "Muotoilija",
    "m0109": "Docs Center",
    "o3poi": "SHA1 tekstistä",
    "o3poi.sha224": "SHA224 tekstistä",
    "o3poi.sha256": "SHA256 tekstistä",
    "o3poi.sha384": "SHA384 tekstistä",
    "o3poi.sha512": "SHA512 tekstistä",
    "pl8S6": "Napsauta tätä salataksesi syöttämäsi tekstin",
    "qjQvD": "Napsauta tätä salataksesi syöttämäsi tekstin",
    "vQq9v": "MD5 tekstistä",
    "vhgr3": "Napsauta tästä valitaksesi tiedoston ja salataksesi sen suoraan.",
    "vu10K": "MD5 tiedostosta",
    "wqp_4": "Napsauta tästä valitaksesi tiedoston ja salataksesi sen suoraan.",
    "y_2Q1": "Koodaa ja purkaa",
    "y_2Q2": "Symmetrinen krypto",
    "y_2Q3": "Epäsymmetrinen krypto",
    "y_2Q4": "Kiinan kansalliset algoritmit",
    "y_2Q5": "Web Auth",
    "y_BN6": "Digest-algoritmi"
}