{
    "41ev7": "MD2",
    "5-S-B": "MD4 daripada Fail",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) ialah fungsi cincang kriptografi yang mengambil input dan menghasilkan nilai cincang 128-bit (16-bait). \\n\\nIa telah dibangunkan oleh Ronald Rivest pada tahun 1989 sebagai pengganti MD1. MD2 dioptimumkan untuk komputer 8-bit dan agak mudah berbanding dengan fungsi cincang yang lain. Walau bagaimanapun, MD2 telah terbukti terdedah kepada serangan perlanggaran, dan tidak lagi dianggap selamat untuk tujuan kriptografi. MD2 masih digunakan dalam beberapa aplikasi, tetapi sedang ditamatkan secara berperingkat demi fungsi cincang yang lebih selamat seperti SHA-256 dan SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) ialah fungsi cincang kriptografi yang mengambil input dan menghasilkan nilai cincang 128-bit (16-bait). \\n\\nIa telah dibangunkan oleh Ronald Rivest pada tahun 1990 sebagai pengganti MD2 dan MD3. Walau bagaimanapun, MD4 telah terbukti terdedah kepada serangan perlanggaran, dan tidak lagi dianggap selamat untuk tujuan kriptografi. MD4 masih digunakan dalam beberapa aplikasi, tetapi sedang ditamatkan secara berperingkat demi fungsi cincang yang lebih selamat seperti SHA-256 dan SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Klik di sini untuk menyulitkan teks input anda",
    "ECm8j": "Klik di sini untuk menyulitkan teks input anda",
    "IP8-V": "MD2 daripada Teks",
    "IPtV": "MD4 daripada Teks",
    "P56UK": "Klik di sini untuk menyulitkan teks input anda",
    "PJNze": "Klik di sini untuk menyulitkan teks input anda",
    "REFy8": "Klik di sini untuk menyulitkan teks input anda",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Semua Alat",
    "eNNrM": "MD2 daripada Fail",
    "g0QB9": "Algoritma MD5 message-digest ialah fungsi cincang yang digunakan secara meluas yang menghasilkan nilai cincang 128-bit. MD5 telah direka oleh Ronald Rivest pada tahun 1991 untuk menggantikan fungsi cincang yang lebih awal MD4,[3] dan telah ditetapkan pada tahun 1992 sebagai RFC 1321. MD5 boleh digunakan sebagai jumlah semak untuk mengesahkan integriti data terhadap rasuah yang tidak disengajakan. Dari segi sejarah ia digunakan secara meluas sebagai fungsi cincang kriptografi; namun ia didapati mengalami kelemahan yang meluas. Ia kekal sesuai untuk tujuan bukan kriptografi yang lain, contohnya untuk menentukan partition untuk kunci tertentu dalam pangkalan data yang dipisahkan, dan mungkin lebih disukai kerana keperluan pengiraan yang lebih rendah daripada Algoritma Secure Hash yang lebih terkini.[4]",
    "gh9zA": "SHA-1 atau Secure Hash Algorithm 1 ialah algoritma kriptografi yang mengambil input dan menghasilkan nilai cincang 160-bit (20-bait).",
    "gh9zA.sha224": "SHA-224 ialah fungsi cincang kriptografi yang mengambil input dan menghasilkan nilai cincang 224-bit (28-bait). Ia adalah sebahagian daripada keluarga fungsi cincang SHA-2, yang turut merangkumi SHA-256, SHA-384 dan SHA-512. SHA-224 direka bentuk untuk menjadi lebih selamat daripada pendahulunya, SHA-1, yang telah terbukti terdedah kepada serangan perlanggaran. SHA-224 digunakan secara meluas dalam tandatangan digital, kod pengesahan mesej dan aplikasi lain yang integriti data adalah kritikal.",
    "gh9zA.sha256": "SHA-256 ialah fungsi cincang kriptografi yang mengambil input dan menghasilkan nilai cincang 256-bit (32-bait). Ia adalah sebahagian daripada keluarga fungsi cincang SHA-2, yang turut merangkumi SHA-224, SHA-384 dan SHA-512. SHA-256 direka bentuk untuk lebih selamat daripada pendahulunya, SHA-1, yang telah terbukti terdedah kepada serangan perlanggaran. SHA-256 digunakan secara meluas dalam tandatangan digital, kod pengesahan mesej dan aplikasi lain yang integriti data adalah kritikal.",
    "gh9zA.sha384": "SHA-384 ialah fungsi cincang kriptografi yang mengambil input dan menghasilkan nilai cincang 384-bit (48-bait). Ia merupakan sebahagian daripada keluarga fungsi cincang SHA-2, yang turut merangkumi SHA-224, SHA-256, SHA-512, SHA-512/224 dan SHA-512/256. SHA-384 direka bentuk untuk lebih selamat daripada pendahulunya, SHA-1, yang telah terbukti terdedah kepada serangan perlanggaran. SHA-384 digunakan secara meluas dalam tandatangan digital, kod pengesahan mesej dan aplikasi lain yang integriti data adalah kritikal.",
    "gh9zA.sha512": "SHA-512 ialah fungsi cincang kriptografi yang mengambil input dan menghasilkan nilai cincang 512-bit (64-bait). Ia adalah sebahagian daripada keluarga fungsi cincang SHA-2, yang turut merangkumi SHA-224, SHA-256, SHA-384, SHA-512/224 dan SHA-512/256. SHA-512 direka bentuk untuk menjadi lebih selamat daripada pendahulunya, SHA-1, yang telah terbukti terdedah kepada serangan perlanggaran. SHA-512 digunakan secara meluas dalam tandatangan digital, kod pengesahan mesej dan aplikasi lain yang integriti data adalah kritikal.",
    "gwo79": "SHA1 daripada Fail",
    "gwo79.sha224": "SHA224 daripada Fail",
    "gwo79.sha256": "SHA256 daripada Fail",
    "gwo79.sha384": "SHA384 daripada Fail",
    "gwo79.sha512": "SHA512 daripada Fail",
    "jjhid": "ini hello, dunia",
    "m0105": "Codec",
    "m0106": "Penukar",
    "m0107": "Penjana",
    "m0108": "Pemformat",
    "m0109": "Pusat Dokumen",
    "o3poi": "SHA1 daripada Teks",
    "o3poi.sha224": "SHA224 daripada Teks",
    "o3poi.sha256": "SHA256 daripada Teks",
    "o3poi.sha384": "SHA384 daripada Teks",
    "o3poi.sha512": "SHA512 daripada Teks",
    "pl8S6": "Klik di sini untuk menyulitkan teks input anda",
    "qjQvD": "Klik di sini untuk menyulitkan teks input anda",
    "vQq9v": "MD5 daripada Teks",
    "vhgr3": "Klik di sini untuk memilih fail dan menyulitkannya secara langsung.",
    "vu10K": "MD5 daripada Fail",
    "wqp_4": "Klik di sini untuk memilih fail dan menyulitkannya secara langsung.",
    "y_2Q1": "Encode dan Decode",
    "y_2Q2": "Kripto simetri",
    "y_2Q3": "Kripto Asymmetric",
    "y_2Q4": "Algoritma Kebangsaan China",
    "y_2Q5": "Pengesahan Web",
    "y_BN6": "Algoritma Digest"
}