{
    "41ev7": "MD2",
    "5-S-B": "MD4 uit bestand",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) is een cryptografische hashfunctie die invoer ontvangt en een hashwaarde van 128 bits (16 bytes) produceert. Het werd in 1989 door Ronald Rivest ontwikkeld als opvolger van MD1. MD2 is geoptimaliseerd voor 8-bit computers en is relatief eenvoudig vergeleken met andere hashfuncties. Er is echter aangetoond dat MD2 kwetsbaar is voor botsingsaanvallen en wordt niet langer als veilig beschouwd voor cryptografische doeleinden. MD2 wordt nog steeds in sommige toepassingen gebruikt, maar wordt uitgefaseerd ten gunste van veiligere hashfuncties zoals SHA-256 en SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) is een cryptografische hashfunctie die invoer ontvangt en een hashwaarde van 128 bits (16 bytes) produceert. Het werd in 1990 ontwikkeld door Ronald Rivest als opvolger van MD2 en MD3. Het is echter aangetoond dat MD4 kwetsbaar is voor botsingsaanvallen en wordt niet langer als veilig beschouwd voor cryptografische doeleinden. MD4 wordt nog steeds in sommige toepassingen gebruikt, maar wordt uitgefaseerd ten gunste van veiligere hashfuncties zoals SHA-256 en SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Klik hier om uw invoertekst te coderen",
    "ECm8j": "Klik hier om uw invoertekst te coderen",
    "IP8-V": "MD2 van Tekst",
    "IPtV": "MD4 van Tekst",
    "P56UK": "Klik hier om uw invoertekst te coderen",
    "PJNze": "Klik hier om uw invoertekst te coderen",
    "REFy8": "Klik hier om uw invoertekst te coderen",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Alle gereedschappen",
    "eNNrM": "MD2 uit bestand",
    "g0QB9": "Het MD5 message-digest-algoritme is een veelgebruikte hashfunctie die een hashwaarde van 128 bits produceert. MD5 is in 1991 ontworpen door Ronald Rivest ter vervanging van een eerdere hashfunctie MD4, en werd in 1992 gespecificeerd als RFC 1321. MD5 kan worden gebruikt als een controlesom om de gegevensintegriteit te verifiëren tegen onbedoelde corruptie. Historisch gezien werd het veel gebruikt als cryptografische hashfunctie; er is echter vastgesteld dat het aan uitgebreide kwetsbaarheden lijdt. Het blijft geschikt voor andere niet-cryptografische doeleinden, bijvoorbeeld voor het bepalen van de partitie voor een bepaalde sleutel in een gepartitioneerde database, en kan de voorkeur hebben vanwege lagere rekenvereisten dan recentere Secure Hash-algoritmen.",
    "gh9zA": "SHA-1 of Secure Hash Algorithm 1 is een cryptografisch algoritme dat invoer ontvangt en een hashwaarde van 160 bits (20 bytes) produceert.",
    "gh9zA.sha224": "SHA-224 is een cryptografische hashfunctie die invoer ontvangt en een hashwaarde van 224 bits (28 bytes) produceert. Het maakt deel uit van de SHA-2-familie van hashfuncties, waartoe ook SHA-256, SHA-384 en SHA-512 behoren. SHA-224 is ontworpen om veiliger te zijn dan zijn voorganger, SHA-1, waarvan is aangetoond dat deze kwetsbaar is voor botsingsaanvallen. SHA-224 wordt veel gebruikt in digitale handtekeningen, berichtauthenticatiecodes en andere toepassingen waarbij gegevensintegriteit van cruciaal belang is.",
    "gh9zA.sha256": "SHA-256 is een cryptografische hashfunctie die invoer ontvangt en een hashwaarde van 256 bits (32 bytes) produceert. Het maakt deel uit van de SHA-2-familie van hashfuncties, waartoe ook SHA-224, SHA-384 en SHA-512 behoren. SHA-256 is ontworpen om veiliger te zijn dan zijn voorganger, SHA-1, waarvan is aangetoond dat deze kwetsbaar is voor botsingsaanvallen. SHA-256 wordt veel gebruikt in digitale handtekeningen, berichtauthenticatiecodes en andere toepassingen waarbij gegevensintegriteit van cruciaal belang is.",
    "gh9zA.sha384": "SHA-384 is een cryptografische hashfunctie die invoer ontvangt en een hashwaarde van 384 bits (48 bytes) produceert. Het maakt deel uit van de SHA-2-familie van hashfuncties, waartoe ook SHA-224, SHA-256, SHA-512, SHA-512/224 en SHA-512/256 behoren. SHA-384 is ontworpen om veiliger te zijn dan zijn voorganger, SHA-1, waarvan is aangetoond dat deze kwetsbaar is voor botsingsaanvallen. SHA-384 wordt veel gebruikt in digitale handtekeningen, berichtauthenticatiecodes en andere toepassingen waarbij gegevensintegriteit van cruciaal belang is.",
    "gh9zA.sha512": "SHA-512 is een cryptografische hashfunctie die invoer ontvangt en een hashwaarde van 512 bits (64 bytes) produceert. Het maakt deel uit van de SHA-2-familie van hashfuncties, waartoe ook SHA-224, SHA-256, SHA-384, SHA-512/224 en SHA-512/256 behoren. SHA-512 is ontworpen om veiliger te zijn dan zijn voorganger, SHA-1, waarvan is aangetoond dat deze kwetsbaar is voor botsingsaanvallen. SHA-512 wordt veel gebruikt in digitale handtekeningen, berichtauthenticatiecodes en andere toepassingen waarbij gegevensintegriteit van cruciaal belang is.",
    "gwo79": "SHA1 uit bestand",
    "gwo79.sha224": "SHA224 uit bestand",
    "gwo79.sha256": "SHA256 uit bestand",
    "gwo79.sha384": "SHA384 uit bestand",
    "gwo79.sha512": "SHA512 uit bestand",
    "jjhid": "dit is hallo, wereld",
    "m0105": "Codec",
    "m0106": "Omvormer",
    "m0107": "Generator",
    "m0108": "Formatter",
    "m0109": "Documentencentrum",
    "o3poi": "SHA1 uit tekst",
    "o3poi.sha224": "SHA224 uit tekst",
    "o3poi.sha256": "SHA256 van tekst",
    "o3poi.sha384": "SHA384 van tekst",
    "o3poi.sha512": "SHA512 van tekst",
    "pl8S6": "Klik hier om uw invoertekst te coderen",
    "qjQvD": "Klik hier om uw invoertekst te coderen",
    "vQq9v": "MD5 van Tekst",
    "vhgr3": "Klik hier om een ​​bestand te selecteren en het direct te coderen.",
    "vu10K": "MD5 uit bestand",
    "wqp_4": "Klik hier om een ​​bestand te selecteren en het direct te coderen.",
    "y_2Q1": "Coderen en decoderen",
    "y_2Q2": "Symmetrische cryptografie",
    "y_2Q3": "Asymmetrische crypto",
    "y_2Q4": "Chinese nationale algoritmen",
    "y_2Q5": "Webauth",
    "y_BN6": "Verteren algoritme"
}