{
    "41ev7": "MD2",
    "5-S-B": "MD4 fra fil",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) er en kryptografisk hash-funksjon som tar et input og produserer en 128-biters (16-byte) hash-verdi. Den ble utviklet av Ronald Rivest i 1989 som en etterfølger til MD1. MD2 er optimalisert for 8-bits datamaskiner og er relativt enkel sammenlignet med andre hash-funksjoner. Imidlertid har MD2 vist seg å være sårbar for kollisjonsangrep, og anses ikke lenger som sikker for kryptografiske formål. MD2 brukes fortsatt i enkelte applikasjoner, men fases ut til fordel for sikrere hash-funksjoner som SHA-256 og SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) er en kryptografisk hash-funksjon som tar et input og produserer en 128-biters (16-byte) hash-verdi. Den ble utviklet av Ronald Rivest i 1990 som en etterfølger til MD2 og MD3. Imidlertid har MD4 vist seg å være sårbar for kollisjonsangrep, og anses ikke lenger som sikker for kryptografiske formål. MD4 brukes fortsatt i enkelte applikasjoner, men fases ut til fordel for sikrere hash-funksjoner som SHA-256 og SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Klikk her for å kryptere inndatateksten",
    "ECm8j": "Klikk her for å kryptere inndatateksten",
    "IP8-V": "MD2 fra Tekst",
    "IPtV": "MD4 fra Tekst",
    "P56UK": "Klikk her for å kryptere inndatateksten",
    "PJNze": "Klikk her for å kryptere inndatateksten",
    "REFy8": "Klikk her for å kryptere inndatateksten",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Alle verktøy",
    "eNNrM": "MD2 fra fil",
    "g0QB9": "MD5-meldings-digest-algoritmen er en mye brukt hash-funksjon som produserer en 128-bits hash-verdi. MD5 ble designet av Ronald Rivest i 1991 for å erstatte en tidligere hashfunksjon MD4,[3] og ble spesifisert i 1992 som RFC 1321. MD5 kan brukes som en kontrollsum for å verifisere dataintegritet mot utilsiktet korrupsjon. Historisk sett ble det mye brukt som en kryptografisk hash-funksjon; men det har vist seg å lide av omfattende sårbarheter. Den forblir egnet for andre ikke-kryptografiske formål, for eksempel for å bestemme partisjonen for en bestemt nøkkel i en partisjonert database, og kan foretrekkes på grunn av lavere beregningskrav enn nyere Secure Hash Algorithms.[4]",
    "gh9zA": "SHA-1 eller Secure Hash Algorithm 1 er en kryptografisk algoritme som tar et input og produserer en 160-biters (20-byte) hash-verdi.",
    "gh9zA.sha224": "SHA-224 er en kryptografisk hash-funksjon som tar et input og produserer en 224-biters (28-byte) hash-verdi. Den er en del av SHA-2-familien av hashfunksjoner, som også inkluderer SHA-256, SHA-384 og SHA-512. SHA-224 er designet for å være sikrere enn forgjengeren, SHA-1, som har vist seg å være sårbar for kollisjonsangrep. SHA-224 er mye brukt i digitale signaturer, meldingsautentiseringskoder og andre applikasjoner der dataintegritet er kritisk.",
    "gh9zA.sha256": "SHA-256 er en kryptografisk hash-funksjon som tar et input og produserer en 256-biters (32-byte) hash-verdi. Den er en del av SHA-2-familien av hashfunksjoner, som også inkluderer SHA-224, SHA-384 og SHA-512. SHA-256 er designet for å være sikrere enn forgjengeren, SHA-1, som har vist seg å være sårbar for kollisjonsangrep. SHA-256 er mye brukt i digitale signaturer, meldingsautentiseringskoder og andre applikasjoner der dataintegritet er kritisk.",
    "gh9zA.sha384": "SHA-384 er en kryptografisk hash-funksjon som tar et input og produserer en 384-biters (48-byte) hash-verdi. Den er en del av SHA-2-familien av hashfunksjoner, som også inkluderer SHA-224, SHA-256, SHA-512, SHA-512/224 og SHA-512/256. SHA-384 er designet for å være sikrere enn forgjengeren, SHA-1, som har vist seg å være sårbar for kollisjonsangrep. SHA-384 er mye brukt i digitale signaturer, meldingsautentiseringskoder og andre applikasjoner der dataintegritet er kritisk.",
    "gh9zA.sha512": "SHA-512 er en kryptografisk hash-funksjon som tar et input og produserer en 512-biters (64-byte) hash-verdi. Den er en del av SHA-2-familien av hashfunksjoner, som også inkluderer SHA-224, SHA-256, SHA-384, SHA-512/224 og SHA-512/256. SHA-512 er designet for å være sikrere enn forgjengeren, SHA-1, som har vist seg å være sårbar for kollisjonsangrep. SHA-512 er mye brukt i digitale signaturer, meldingsautentiseringskoder og andre applikasjoner der dataintegritet er kritisk.",
    "gwo79": "SHA1 fra fil",
    "gwo79.sha224": "SHA224 fra fil",
    "gwo79.sha256": "SHA256 fra fil",
    "gwo79.sha384": "SHA384 fra fil",
    "gwo79.sha512": "SHA512 fra fil",
    "jjhid": "dette er hei verden",
    "m0105": "Codec",
    "m0106": "Konverter",
    "m0107": "Generator",
    "m0108": "Formater",
    "m0109": "Dokumentsenter",
    "o3poi": "SHA1 fra Tekst",
    "o3poi.sha224": "SHA224 fra Tekst",
    "o3poi.sha256": "SHA256 fra Tekst",
    "o3poi.sha384": "SHA384 fra Tekst",
    "o3poi.sha512": "SHA512 fra Tekst",
    "pl8S6": "Klikk her for å kryptere inndatateksten",
    "qjQvD": "Klikk her for å kryptere inndatateksten",
    "vQq9v": "MD5 fra Tekst",
    "vhgr3": "Klikk her for å velge en fil og kryptere den direkte.",
    "vu10K": "MD5 fra fil",
    "wqp_4": "Klikk her for å velge en fil og kryptere den direkte.",
    "y_2Q1": "Kode og dekode",
    "y_2Q2": "Symmetrisk krypto",
    "y_2Q3": "Asymmetrisk krypto",
    "y_2Q4": "Kinas nasjonale algoritmer",
    "y_2Q5": "Web Auth",
    "y_BN6": "Digest Algoritme"
}