{
    "41ev7": "MD2",
    "5-S-B": "MD4 z pliku",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) to kryptograficzna funkcja skrótu, która pobiera dane wejściowe i generuje 128-bitową (16-bajtową) wartość skrótu. Został opracowany przez Ronalda Rivesta w 1989 roku jako następca MD1. MD2 jest zoptymalizowany dla komputerów 8-bitowych i jest stosunkowo prosty w porównaniu do innych funkcji skrótu. Jednakże wykazano, że MD2 jest podatny na ataki kolizyjne i nie jest już uważany za bezpieczny do celów kryptograficznych. MD2 jest nadal używany w niektórych aplikacjach, ale jest wycofywane na rzecz bezpieczniejszych funkcji skrótu, takich jak SHA-256 i SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) to kryptograficzna funkcja skrótu, która pobiera dane wejściowe i generuje 128-bitową (16-bajtową) wartość skrótu. Został opracowany przez Ronalda Rivesta w 1990 roku jako następca MD2 i MD3. Jednakże wykazano, że MD4 jest podatny na ataki kolizyjne i nie jest już uważany za bezpieczny do celów kryptograficznych. MD4 jest nadal używany w niektórych aplikacjach, ale jest wycofywane na rzecz bezpieczniejszych funkcji skrótu, takich jak SHA-256 i SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Kliknij tutaj, aby zaszyfrować wprowadzony tekst",
    "ECm8j": "Kliknij tutaj, aby zaszyfrować wprowadzony tekst",
    "IP8-V": "MD2 z tekstu",
    "IPtV": "MD4 z tekstu",
    "P56UK": "Kliknij tutaj, aby zaszyfrować wprowadzony tekst",
    "PJNze": "Kliknij tutaj, aby zaszyfrować wprowadzony tekst",
    "REFy8": "Kliknij tutaj, aby zaszyfrować wprowadzony tekst",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Wszystkie narzędzia",
    "eNNrM": "MD2 z pliku",
    "g0QB9": "Algorytm podsumowania komunikatów MD5 jest szeroko stosowaną funkcją skrótu generującą 128-bitową wartość skrótu. MD5 został zaprojektowany przez Ronalda Rivesta w 1991 r. w celu zastąpienia wcześniejszej funkcji skrótu MD4[3] i został określony w 1992 r. jako RFC 1321. MD5 może służyć jako suma kontrolna do sprawdzania integralności danych pod kątem niezamierzonego uszkodzenia. Historycznie rzecz biorąc, była ona szeroko stosowana jako kryptograficzna funkcja skrótu; jednakże stwierdzono, że zawiera on liczne luki w zabezpieczeniach. Pozostaje odpowiedni do innych celów niezwiązanych z kryptografią, na przykład do określenia partycji dla określonego klucza w partycjonowanej bazie danych i może być preferowany ze względu na niższe wymagania obliczeniowe niż nowsze algorytmy Secure Hash.",
    "gh9zA": "SHA-1 lub Secure Hash Algorithm 1 to algorytm kryptograficzny, który pobiera dane wejściowe i generuje 160-bitową (20-bajtową) wartość skrótu.",
    "gh9zA.sha224": "SHA-224 to kryptograficzna funkcja skrótu, która pobiera dane wejściowe i generuje 224-bitową (28-bajtową) wartość skrótu. Jest częścią rodziny funkcji skrótu SHA-2, która obejmuje również SHA-256, SHA-384 i SHA-512. SHA-224 został zaprojektowany tak, aby był bezpieczniejszy niż jego poprzednik, SHA-1, który okazał się podatny na ataki kolizyjne. SHA-224 jest szeroko stosowany w podpisach cyfrowych, kodach uwierzytelniania wiadomości i innych zastosowaniach, w których integralność danych ma kluczowe znaczenie.",
    "gh9zA.sha256": "SHA-256 to kryptograficzna funkcja skrótu, która pobiera dane wejściowe i generuje 256-bitową (32-bajtową) wartość skrótu. Jest częścią rodziny funkcji skrótu SHA-2, która obejmuje również SHA-224, SHA-384 i SHA-512. SHA-256 został zaprojektowany tak, aby był bezpieczniejszy niż jego poprzednik, SHA-1, który okazał się podatny na ataki kolizyjne. SHA-256 jest szeroko stosowany w podpisach cyfrowych, kodach uwierzytelniania wiadomości i innych zastosowaniach, w których integralność danych ma kluczowe znaczenie.",
    "gh9zA.sha384": "SHA-384 to kryptograficzna funkcja skrótu, która pobiera dane wejściowe i generuje 384-bitową (48-bajtową) wartość skrótu. Jest częścią rodziny funkcji skrótu SHA-2, która obejmuje również SHA-224, SHA-256, SHA-512, SHA-512/224 i SHA-512/256. SHA-384 został zaprojektowany tak, aby był bezpieczniejszy niż jego poprzednik, SHA-1, który okazał się podatny na ataki kolizyjne. SHA-384 jest szeroko stosowany w podpisach cyfrowych, kodach uwierzytelniania wiadomości i innych zastosowaniach, w których integralność danych ma kluczowe znaczenie.",
    "gh9zA.sha512": "SHA-512 to kryptograficzna funkcja skrótu, która pobiera dane wejściowe i generuje 512-bitową (64-bajtową) wartość skrótu. Jest częścią rodziny funkcji skrótu SHA-2, która obejmuje również SHA-224, SHA-256, SHA-384, SHA-512/224 i SHA-512/256. SHA-512 został zaprojektowany tak, aby był bezpieczniejszy niż jego poprzednik, SHA-1, który okazał się podatny na ataki kolizyjne. SHA-512 jest szeroko stosowany w podpisach cyfrowych, kodach uwierzytelniania wiadomości i innych zastosowaniach, w których integralność danych ma kluczowe znaczenie.",
    "gwo79": "SHA1 z pliku",
    "gwo79.sha224": "SHA224 z pliku",
    "gwo79.sha256": "SHA256 z pliku",
    "gwo79.sha384": "SHA384 z pliku",
    "gwo79.sha512": "SHA512 z pliku",
    "jjhid": "oto witaj, świecie",
    "m0105": "Kodek",
    "m0106": "Przetwornik",
    "m0107": "Generator",
    "m0108": "Formater",
    "m0109": "Centrum Dokumentów",
    "o3poi": "SHA1 z tekstu",
    "o3poi.sha224": "SHA224 z tekstu",
    "o3poi.sha256": "SHA256 z tekstu",
    "o3poi.sha384": "SHA384 z tekstu",
    "o3poi.sha512": "SHA512 z tekstu",
    "pl8S6": "Kliknij tutaj, aby zaszyfrować wprowadzony tekst",
    "qjQvD": "Kliknij tutaj, aby zaszyfrować wprowadzony tekst",
    "vQq9v": "MD5 z tekstu",
    "vhgr3": "Kliknij tutaj, aby wybrać plik i bezpośrednio go zaszyfrować.",
    "vu10K": "MD5 z pliku",
    "wqp_4": "Kliknij tutaj, aby wybrać plik i bezpośrednio go zaszyfrować.",
    "y_2Q1": "Koduj i dekoduj",
    "y_2Q2": "Symetryczne krypto",
    "y_2Q3": "Asymetryczne kryptowaluty",
    "y_2Q4": "Chińskie algorytmy narodowe",
    "y_2Q5": "Autoryzacja internetowa",
    "y_BN6": "Algorytm podsumowania"
}