{
    "41ev7": "MD2",
    "5-S-B": "MD4 do arquivo",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) é uma função hash criptográfica que recebe uma entrada e produz um valor hash de 128 bits (16 bytes). Foi desenvolvido por Ronald Rivest em 1989 como sucessor do MD1. MD2 é otimizado para computadores de 8 bits e é relativamente simples em comparação com outras funções hash. No entanto, o MD2 demonstrou ser vulnerável a ataques de colisão e não é mais considerado seguro para fins criptográficos. O MD2 ainda é usado em alguns aplicativos, mas está sendo eliminado em favor de funções hash mais seguras, como SHA-256 e SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) é uma função hash criptográfica que recebe uma entrada e produz um valor hash de 128 bits (16 bytes). Foi desenvolvido por Ronald Rivest em 1990 como sucessor do MD2 e MD3. No entanto, o MD4 demonstrou ser vulnerável a ataques de colisão e não é mais considerado seguro para fins criptográficos. O MD4 ainda é usado em alguns aplicativos, mas está sendo eliminado em favor de funções hash mais seguras, como SHA-256 e SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Clique aqui para criptografar seu texto de entrada",
    "ECm8j": "Clique aqui para criptografar seu texto de entrada",
    "IP8-V": "MD2 do texto",
    "IPtV": "MD4 do texto",
    "P56UK": "Clique aqui para criptografar seu texto de entrada",
    "PJNze": "Clique aqui para criptografar seu texto de entrada",
    "REFy8": "Clique aqui para criptografar seu texto de entrada",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Todas as ferramentas",
    "eNNrM": "MD2 do arquivo",
    "g0QB9": "O algoritmo de resumo de mensagens MD5 é uma função hash amplamente usada que produz um valor hash de 128 bits. MD5 foi projetado por Ronald Rivest em 1991 para substituir uma função hash anterior MD4,[3] e foi especificado em 1992 como RFC 1321. MD5 pode ser usado como uma soma de verificação para verificar a integridade dos dados contra corrupção não intencional. Historicamente, foi amplamente utilizado como função hash criptográfica; no entanto, descobriu-se que ele sofre de vulnerabilidades extensas. Ele permanece adequado para outros fins não criptográficos, por exemplo, para determinar a partição de uma chave específica em um banco de dados particionado, e pode ser preferido devido aos requisitos computacionais mais baixos do que os algoritmos de hash seguros mais recentes.[4]",
    "gh9zA": "SHA-1 ou Secure Hash Algorithm 1 é um algoritmo criptográfico que recebe uma entrada e produz um valor hash de 160 bits (20 bytes).",
    "gh9zA.sha224": "SHA-224 é uma função hash criptográfica que recebe uma entrada e produz um valor hash de 224 bits (28 bytes). Faz parte da família SHA-2 de funções hash, que também inclui SHA-256, SHA-384 e SHA-512. O SHA-224 foi projetado para ser mais seguro que seu antecessor, SHA-1, que demonstrou ser vulnerável a ataques de colisão. SHA-224 é amplamente utilizado em assinaturas digitais, códigos de autenticação de mensagens e outras aplicações onde a integridade dos dados é crítica.",
    "gh9zA.sha256": "SHA-256 é uma função hash criptográfica que recebe uma entrada e produz um valor hash de 256 bits (32 bytes). Faz parte da família SHA-2 de funções hash, que também inclui SHA-224, SHA-384 e SHA-512. O SHA-256 foi projetado para ser mais seguro que seu antecessor, SHA-1, que demonstrou ser vulnerável a ataques de colisão. SHA-256 é amplamente utilizado em assinaturas digitais, códigos de autenticação de mensagens e outras aplicações onde a integridade dos dados é crítica.",
    "gh9zA.sha384": "SHA-384 é uma função hash criptográfica que recebe uma entrada e produz um valor hash de 384 bits (48 bytes). Faz parte da família SHA-2 de funções hash, que também inclui SHA-224, SHA-256, SHA-512, SHA-512/224 e SHA-512/256. O SHA-384 foi projetado para ser mais seguro que seu antecessor, SHA-1, que demonstrou ser vulnerável a ataques de colisão. SHA-384 é amplamente utilizado em assinaturas digitais, códigos de autenticação de mensagens e outras aplicações onde a integridade dos dados é crítica.",
    "gh9zA.sha512": "SHA-512 é uma função hash criptográfica que recebe uma entrada e produz um valor hash de 512 bits (64 bytes). Faz parte da família SHA-2 de funções hash, que também inclui SHA-224, SHA-256, SHA-384, SHA-512/224 e SHA-512/256. O SHA-512 foi projetado para ser mais seguro que seu antecessor, SHA-1, que demonstrou ser vulnerável a ataques de colisão. SHA-512 é amplamente utilizado em assinaturas digitais, códigos de autenticação de mensagens e outras aplicações onde a integridade dos dados é crítica.",
    "gwo79": "SHA1 do arquivo",
    "gwo79.sha224": "SHA224 do arquivo",
    "gwo79.sha256": "SHA256 do arquivo",
    "gwo79.sha384": "SHA384 do arquivo",
    "gwo79.sha512": "SHA512 do arquivo",
    "jjhid": "isso é olá, mundo",
    "m0105": "Codec",
    "m0106": "Conversor",
    "m0107": "Gerador",
    "m0108": "Formatador",
    "m0109": "Central de Documentos",
    "o3poi": "SHA1 do texto",
    "o3poi.sha224": "SHA224 do texto",
    "o3poi.sha256": "SHA256 do texto",
    "o3poi.sha384": "SHA384 do texto",
    "o3poi.sha512": "SHA512 do texto",
    "pl8S6": "Clique aqui para criptografar seu texto de entrada",
    "qjQvD": "Clique aqui para criptografar seu texto de entrada",
    "vQq9v": "MD5 do texto",
    "vhgr3": "Clique aqui para selecionar um arquivo e criptografá-lo diretamente.",
    "vu10K": "MD5 do arquivo",
    "wqp_4": "Clique aqui para selecionar um arquivo e criptografá-lo diretamente.",
    "y_2Q1": "Codificar e decodificar",
    "y_2Q2": "Criptografia simétrica",
    "y_2Q3": "Criptografia assimétrica",
    "y_2Q4": "Algoritmos Nacionais da China",
    "y_2Q5": "Autenticação da Web",
    "y_BN6": "Algoritmo de resumo"
}