{
    "41ev7": "MD2",
    "5-S-B": "MD4 из файла",
    "6wtIW": "MD2 (алгоритм расшифровки сообщения 2) — это криптографическая хеш-функция, которая принимает входные данные и создает 128-битное (16-байтовое) хеш-значение. Он был разработан Рональдом Ривестом в 1989 году как преемник MD1. MD2 оптимизирован для 8-битных компьютеров и относительно прост по сравнению с другими хеш-функциями. Однако было показано, что MD2 уязвим для атак коллизий и больше не считается безопасным для криптографических целей. MD2 все еще используется в некоторых приложениях, но от него постепенно отказываются в пользу более безопасных хэш-функций, таких как SHA-256 и SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (алгоритм 4-го дайджеста сообщений) — это криптографическая хеш-функция, которая принимает входные данные и создает 128-битное (16-байтовое) хеш-значение. Он был разработан Рональдом Ривестом в 1990 году как преемник MD2 и MD3. Однако было показано, что MD4 уязвим для атак коллизий и больше не считается безопасным для криптографических целей. MD4 все еще используется в некоторых приложениях, но от него постепенно отказываются в пользу более безопасных хэш-функций, таких как SHA-256 и SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Нажмите здесь, чтобы зашифровать вводимый текст",
    "ECm8j": "Нажмите здесь, чтобы зашифровать вводимый текст",
    "IP8-V": "MD2 из текста",
    "IPtV": "MD4 из текста",
    "P56UK": "Нажмите здесь, чтобы зашифровать вводимый текст",
    "PJNze": "Нажмите здесь, чтобы зашифровать вводимый текст",
    "REFy8": "Нажмите здесь, чтобы зашифровать вводимый текст",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Все инструменты",
    "eNNrM": "MD2 из файла",
    "g0QB9": "Алгоритм дайджеста сообщения MD5 — это широко используемая хеш-функция, создающая 128-битное хеш-значение. MD5 был разработан Рональдом Ривестом в 1991 году для замены более ранней хеш-функции MD4[3] и был определен в 1992 году как RFC 1321. MD5 можно использовать в качестве контрольной суммы для проверки целостности данных на предмет непреднамеренного повреждения. Исторически он широко использовался в качестве криптографической хеш-функции; однако было обнаружено, что он имеет множество уязвимостей. Он по-прежнему подходит для других некриптографических целей, например, для определения раздела для определенного ключа в многораздельной базе данных, и может быть предпочтительнее из-за меньших вычислительных требований, чем более поздние алгоритмы безопасного хеширования.[4]",
    "gh9zA": "SHA-1 или алгоритм безопасного хеширования 1 — это криптографический алгоритм, который принимает входные данные и создает 160-битное (20-байтовое) хеш-значение.",
    "gh9zA.sha224": "SHA-224 — это криптографическая хэш-функция, которая принимает входные данные и создает 224-битное (28-байтовое) хеш-значение. Он является частью семейства хеш-функций SHA-2, в которое также входят SHA-256, SHA-384 и SHA-512. SHA-224 спроектирован так, чтобы быть более безопасным, чем его предшественник SHA-1, который, как было показано, уязвим к атакам на основе коллизий. SHA-224 широко используется в цифровых подписях, кодах аутентификации сообщений и других приложениях, где целостность данных имеет решающее значение.",
    "gh9zA.sha256": "SHA-256 — это криптографическая хеш-функция, которая принимает входные данные и создает 256-битное (32-байтовое) хеш-значение. Он является частью семейства хэш-функций SHA-2, в которое также входят SHA-224, SHA-384 и SHA-512. SHA-256 спроектирован так, чтобы быть более безопасным, чем его предшественник SHA-1, который, как было показано, уязвим к атакам на основе коллизий. SHA-256 широко используется в цифровых подписях, кодах аутентификации сообщений и других приложениях, где целостность данных имеет решающее значение.",
    "gh9zA.sha384": "SHA-384 — это криптографическая хэш-функция, которая принимает входные данные и создает 384-битное (48-байтовое) хеш-значение. Он является частью семейства хеш-функций SHA-2, в которое также входят SHA-224, SHA-256, SHA-512, SHA-512/224 и SHA-512/256. SHA-384 спроектирован так, чтобы быть более безопасным, чем его предшественник SHA-1, который, как было показано, уязвим к атакам на основе коллизий. SHA-384 широко используется в цифровых подписях, кодах аутентификации сообщений и других приложениях, где целостность данных имеет решающее значение.",
    "gh9zA.sha512": "SHA-512 — это криптографическая хэш-функция, которая принимает входные данные и создает 512-битное (64-байтовое) хеш-значение. Он является частью семейства хеш-функций SHA-2, в которое также входят SHA-224, SHA-256, SHA-384, SHA-512/224 и SHA-512/256. SHA-512 спроектирован так, чтобы быть более безопасным, чем его предшественник SHA-1, который, как было показано, уязвим к атакам на основе коллизий. SHA-512 широко используется в цифровых подписях, кодах аутентификации сообщений и других приложениях, где целостность данных имеет решающее значение.",
    "gwo79": "SHA1 из файла",
    "gwo79.sha224": "SHA224 из файла",
    "gwo79.sha256": "SHA256 из файла",
    "gwo79.sha384": "SHA384 из файла",
    "gwo79.sha512": "SHA512 из файла",
    "jjhid": "это привет, мир",
    "m0105": "Кодек",
    "m0106": "Конвертер",
    "m0107": "Генератор",
    "m0108": "форматтер",
    "m0109": "Центр документации",
    "o3poi": "SHA1 из текста",
    "o3poi.sha224": "SHA224 из текста",
    "o3poi.sha256": "SHA256 из текста",
    "o3poi.sha384": "SHA384 из текста",
    "o3poi.sha512": "SHA512 из текста",
    "pl8S6": "Нажмите здесь, чтобы зашифровать вводимый текст",
    "qjQvD": "Нажмите здесь, чтобы зашифровать вводимый текст",
    "vQq9v": "MD5 из текста",
    "vhgr3": "Нажмите здесь, чтобы выбрать файл и зашифровать его напрямую.",
    "vu10K": "MD5 из файла",
    "wqp_4": "Нажмите здесь, чтобы выбрать файл и зашифровать его напрямую.",
    "y_2Q1": "Кодирование и декодирование",
    "y_2Q2": "Симметричная Крипто",
    "y_2Q3": "Асимметричная криптография",
    "y_2Q4": "Китайские национальные алгоритмы",
    "y_2Q5": "Веб-аутентификация",
    "y_BN6": "Алгоритм дайджеста"
}