{
    "41ev7": "MD2",
    "5-S-B": "MD4 från fil",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) är en kryptografisk hashfunktion som tar en ingång och producerar ett 128-bitars (16-byte) hashvärde. Den utvecklades av Ronald Rivest 1989 som en efterföljare till MD1. MD2 är optimerad för 8-bitars datorer och är relativt enkel jämfört med andra hashfunktioner. MD2 har dock visat sig vara sårbart för kollisionsattacker och anses inte längre vara säker för kryptografiska ändamål. MD2 används fortfarande i vissa applikationer, men fasas ut till förmån för säkrare hashfunktioner som SHA-256 och SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) är en kryptografisk hashfunktion som tar en ingång och producerar ett 128-bitars (16-byte) hashvärde. Den utvecklades av Ronald Rivest 1990 som en efterföljare till MD2 och MD3. MD4 har dock visat sig vara sårbart för kollisionsattacker och anses inte längre vara säker för kryptografiska ändamål. MD4 används fortfarande i vissa applikationer, men fasas ut till förmån för säkrare hashfunktioner som SHA-256 och SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Klicka här för att kryptera din inmatade text",
    "ECm8j": "Klicka här för att kryptera din inmatade text",
    "IP8-V": "MD2 från Text",
    "IPtV": "MD4 från Text",
    "P56UK": "Klicka här för att kryptera din inmatade text",
    "PJNze": "Klicka här för att kryptera din inmatade text",
    "REFy8": "Klicka här för att kryptera din inmatade text",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Alla verktyg",
    "eNNrM": "MD2 från fil",
    "g0QB9": "MD5-meddelandesammandragningsalgoritmen är en allmänt använd hashfunktion som producerar ett 128-bitars hashvärde. MD5 designades av Ronald Rivest 1991 för att ersätta en tidigare hashfunktion MD4,[3] och specificerades 1992 som RFC 1321. MD5 kan användas som en kontrollsumma för att verifiera dataintegritet mot oavsiktlig korruption. Historiskt sett användes det flitigt som en kryptografisk hashfunktion; men det har visat sig lida av omfattande sårbarheter. Den förblir lämplig för andra icke-kryptografiska ändamål, till exempel för att bestämma partitionen för en viss nyckel i en partitionerad databas, och kan föredras på grund av lägre beräkningskrav än nyare Secure Hash-algoritmer.[4]",
    "gh9zA": "SHA-1 eller Secure Hash Algorithm 1 är en kryptografisk algoritm som tar en indata och producerar ett 160-bitars (20-byte) hashvärde.",
    "gh9zA.sha224": "SHA-224 är en kryptografisk hashfunktion som tar en indata och producerar ett 224-bitars (28-byte) hashvärde. Det är en del av SHA-2-familjen av hashfunktioner, som även inkluderar SHA-256, SHA-384 och SHA-512. SHA-224 är designad för att vara säkrare än sin föregångare, SHA-1, som har visat sig vara sårbar för kollisionsattacker. SHA-224 används ofta i digitala signaturer, meddelandeautentiseringskoder och andra applikationer där dataintegritet är avgörande.",
    "gh9zA.sha256": "SHA-256 är en kryptografisk hashfunktion som tar en input och producerar ett 256-bitars (32-byte) hashvärde. Det är en del av SHA-2-familjen av hashfunktioner, som även inkluderar SHA-224, SHA-384 och SHA-512. SHA-256 är designad för att vara säkrare än sin föregångare, SHA-1, som har visat sig vara sårbar för kollisionsattacker. SHA-256 används ofta i digitala signaturer, meddelandeautentiseringskoder och andra applikationer där dataintegritet är avgörande.",
    "gh9zA.sha384": "SHA-384 är en kryptografisk hashfunktion som tar en input och producerar ett 384-bitars (48-byte) hashvärde. Det är en del av SHA-2-familjen av hashfunktioner, som även inkluderar SHA-224, SHA-256, SHA-512, SHA-512/224 och SHA-512/256. SHA-384 är designad för att vara säkrare än sin föregångare, SHA-1, som har visat sig vara sårbar för kollisionsattacker. SHA-384 används ofta i digitala signaturer, meddelandeautentiseringskoder och andra applikationer där dataintegritet är avgörande.",
    "gh9zA.sha512": "SHA-512 är en kryptografisk hashfunktion som tar en input och producerar ett 512-bitars (64-byte) hashvärde. Det är en del av SHA-2-familjen av hashfunktioner, som även inkluderar SHA-224, SHA-256, SHA-384, SHA-512/224 och SHA-512/256. SHA-512 är designad för att vara säkrare än sin föregångare, SHA-1, som har visat sig vara sårbar för kollisionsattacker. SHA-512 används ofta i digitala signaturer, meddelandeautentiseringskoder och andra applikationer där dataintegritet är avgörande.",
    "gwo79": "SHA1 från fil",
    "gwo79.sha224": "SHA224 från fil",
    "gwo79.sha256": "SHA256 från fil",
    "gwo79.sha384": "SHA384 från fil",
    "gwo79.sha512": "SHA512 från fil",
    "jjhid": "det här är hej världen",
    "m0105": "Codec",
    "m0106": "Omvandlare",
    "m0107": "Generator",
    "m0108": "Formaterare",
    "m0109": "Dokumentcenter",
    "o3poi": "SHA1 från Text",
    "o3poi.sha224": "SHA224 från Text",
    "o3poi.sha256": "SHA256 från Text",
    "o3poi.sha384": "SHA384 från Text",
    "o3poi.sha512": "SHA512 från Text",
    "pl8S6": "Klicka här för att kryptera din inmatade text",
    "qjQvD": "Klicka här för att kryptera din inmatade text",
    "vQq9v": "MD5 från Text",
    "vhgr3": "Klicka här för att välja en fil och kryptera den direkt.",
    "vu10K": "MD5 från fil",
    "wqp_4": "Klicka här för att välja en fil och kryptera den direkt.",
    "y_2Q1": "Koda och avkoda",
    "y_2Q2": "Symmetrisk krypto",
    "y_2Q3": "Asymmetrisk krypto",
    "y_2Q4": "Kinas nationella algoritmer",
    "y_2Q5": "Web Auth",
    "y_BN6": "Sammanfattningsalgoritm"
}