{
    "41ev7": "เอ็มดี2",
    "5-S-B": "MD4 จากไฟล์",
    "6wtIW": "MD2 (อัลกอริธึมการแยกข้อความ 2) เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่รับอินพุตและสร้างค่าแฮชขนาด 128 บิต (16 ไบต์) \\n\\nได้รับการพัฒนาโดย Ronald Rivest ในปี 1989 โดยเป็นผู้สืบทอดต่อจาก MD1 MD2 ได้รับการปรับให้เหมาะกับคอมพิวเตอร์ 8 บิต และค่อนข้างง่ายเมื่อเทียบกับฟังก์ชันแฮชอื่นๆ อย่างไรก็ตาม MD2 แสดงให้เห็นว่ามีความเสี่ยงต่อการโจมตีจากการชนกัน และไม่ถือว่าปลอดภัยสำหรับวัตถุประสงค์ในการเข้ารหัสอีกต่อไป MD2 ยังคงใช้ในบางแอปพลิเคชัน แต่กำลังถูกยุติลงเพื่อสนับสนุนฟังก์ชันแฮชที่ปลอดภัยยิ่งขึ้น เช่น SHA-256 และ SHA-3",
    "70PnM": "เอ็มดี4",
    "7gKzt": "MD4 (อัลกอริธึมการแยกข้อความ 4) เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่รับอินพุตและสร้างค่าแฮช 128 บิต (16 ไบต์) \\n\\nได้รับการพัฒนาโดย Ronald Rivest ในปี 1990 โดยเป็นรุ่นต่อจาก MD2 และ MD3 อย่างไรก็ตาม MD4 แสดงให้เห็นว่ามีความเสี่ยงต่อการโจมตีจากการชนกัน และไม่ถือว่าปลอดภัยสำหรับวัตถุประสงค์ในการเข้ารหัสอีกต่อไป MD4 ยังคงใช้ในบางแอปพลิเคชัน แต่กำลังจะยุติลงเพื่อสนับสนุนฟังก์ชันแฮชที่ปลอดภัยยิ่งขึ้น เช่น SHA-256 และ SHA-3",
    "AWqXD": "เอ็มดี5",
    "E88Ej": "คลิกที่นี่เพื่อเข้ารหัสข้อความที่คุณป้อน",
    "ECm8j": "คลิกที่นี่เพื่อเข้ารหัสข้อความที่คุณป้อน",
    "IP8-V": "MD2 จากข้อความ",
    "IPtV": "MD4 จากข้อความ",
    "P56UK": "คลิกที่นี่เพื่อเข้ารหัสข้อความที่คุณป้อน",
    "PJNze": "คลิกที่นี่เพื่อเข้ารหัสข้อความที่คุณป้อน",
    "REFy8": "คลิกที่นี่เพื่อเข้ารหัสข้อความที่คุณป้อน",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "เครื่องมือทั้งหมด",
    "eNNrM": "MD2 จากไฟล์",
    "g0QB9": "อัลกอริธึมการแยกข้อความ MD5 เป็นฟังก์ชันแฮชที่ใช้กันอย่างแพร่หลายซึ่งสร้างค่าแฮช 128 บิต MD5 ได้รับการออกแบบโดย Ronald Rivest ในปี 1991 เพื่อแทนที่ฟังก์ชันแฮชก่อนหน้า MD4 [3] และถูกกำหนดในปี 1992 เป็น RFC 1321 MD5 สามารถใช้เป็นเช็คซัมเพื่อตรวจสอบความสมบูรณ์ของข้อมูลต่อความเสียหายโดยไม่ได้ตั้งใจ ในอดีตมีการใช้กันอย่างแพร่หลายในฐานะฟังก์ชันแฮชการเข้ารหัส อย่างไรก็ตามพบว่ามีช่องโหว่มากมาย ยังคงเหมาะสำหรับวัตถุประสงค์อื่นๆ ที่ไม่ใช่การเข้ารหัส เช่น เพื่อกำหนดพาร์ติชันสำหรับคีย์เฉพาะในฐานข้อมูลที่แบ่งพาร์ติชัน และอาจเป็นที่ต้องการเนื่องจากความต้องการในการคำนวณที่ต่ำกว่าอัลกอริทึม Secure Hash เวอร์ชันล่าสุด",
    "gh9zA": "SHA-1 หรือ Secure Hash Algorithm 1 เป็นอัลกอริทึมการเข้ารหัสที่รับอินพุตและสร้างค่าแฮช 160 บิต (20 ไบต์)",
    "gh9zA.sha224": "SHA-224 เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่รับอินพุตและสร้างค่าแฮช 224 บิต (28 ไบต์) เป็นส่วนหนึ่งของฟังก์ชันแฮชตระกูล SHA-2 ซึ่งรวมถึง SHA-256, SHA-384 และ SHA-512 ด้วย SHA-224 ได้รับการออกแบบให้มีความปลอดภัยมากกว่า SHA-1 รุ่นก่อน ซึ่งแสดงให้เห็นว่ามีความเสี่ยงต่อการโจมตีจากการชนกัน SHA-224 ใช้กันอย่างแพร่หลายในลายเซ็นดิจิทัล รหัสการตรวจสอบข้อความ และแอปพลิเคชันอื่นๆ ที่ความสมบูรณ์ของข้อมูลเป็นสิ่งสำคัญ",
    "gh9zA.sha256": "SHA-256 เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่รับอินพุตและสร้างค่าแฮชขนาด 256 บิต (32 ไบต์) เป็นส่วนหนึ่งของฟังก์ชันแฮชตระกูล SHA-2 ซึ่งรวมถึง SHA-224, SHA-384 และ SHA-512 ด้วย SHA-256 ได้รับการออกแบบให้มีความปลอดภัยมากกว่า SHA-1 รุ่นก่อน ซึ่งแสดงให้เห็นว่ามีความเสี่ยงต่อการโจมตีจากการชนกัน SHA-256 ใช้กันอย่างแพร่หลายในลายเซ็นดิจิทัล รหัสการตรวจสอบข้อความ และแอปพลิเคชันอื่นๆ ที่ความสมบูรณ์ของข้อมูลเป็นสิ่งสำคัญ",
    "gh9zA.sha384": "SHA-384 เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่รับอินพุตและสร้างค่าแฮช 384 บิต (48 ไบต์) เป็นส่วนหนึ่งของฟังก์ชันแฮชตระกูล SHA-2 ซึ่งรวมถึง SHA-224, SHA-256, SHA-512, SHA-512/224 และ SHA-512/256 SHA-384 ได้รับการออกแบบให้มีความปลอดภัยมากกว่า SHA-1 รุ่นก่อน ซึ่งแสดงให้เห็นว่ามีความเสี่ยงต่อการโจมตีจากการชนกัน SHA-384 ใช้กันอย่างแพร่หลายในลายเซ็นดิจิทัล รหัสการตรวจสอบข้อความ และแอปพลิเคชันอื่นๆ ที่ความสมบูรณ์ของข้อมูลเป็นสิ่งสำคัญ",
    "gh9zA.sha512": "SHA-512 เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่รับอินพุตและสร้างค่าแฮชขนาด 512 บิต (64 ไบต์) เป็นส่วนหนึ่งของฟังก์ชันแฮชตระกูล SHA-2 ซึ่งรวมถึง SHA-224, SHA-256, SHA-384, SHA-512/224 และ SHA-512/256 SHA-512 ได้รับการออกแบบให้มีความปลอดภัยมากกว่า SHA-1 รุ่นก่อน ซึ่งแสดงให้เห็นว่ามีความเสี่ยงต่อการโจมตีจากการชนกัน SHA-512 ใช้กันอย่างแพร่หลายในลายเซ็นดิจิทัล รหัสการตรวจสอบข้อความ และแอปพลิเคชันอื่นๆ ที่ความสมบูรณ์ของข้อมูลเป็นสิ่งสำคัญ",
    "gwo79": "SHA1 จากไฟล์",
    "gwo79.sha224": "SHA224 จากไฟล์",
    "gwo79.sha256": "SHA256 จากไฟล์",
    "gwo79.sha384": "SHA384 จากไฟล์",
    "gwo79.sha512": "SHA512 จากไฟล์",
    "jjhid": "นี่คือสวัสดีชาวโลก",
    "m0105": "ตัวแปลงสัญญาณ",
    "m0106": "ตัวแปลง",
    "m0107": "เครื่องกำเนิดไฟฟ้า",
    "m0108": "ฟอร์แมตเตอร์",
    "m0109": "ศูนย์เอกสาร",
    "o3poi": "SHA1 จากข้อความ",
    "o3poi.sha224": "SHA224 จากข้อความ",
    "o3poi.sha256": "SHA256 จากข้อความ",
    "o3poi.sha384": "SHA384 จากข้อความ",
    "o3poi.sha512": "SHA512 จากข้อความ",
    "pl8S6": "คลิกที่นี่เพื่อเข้ารหัสข้อความที่คุณป้อน",
    "qjQvD": "คลิกที่นี่เพื่อเข้ารหัสข้อความที่คุณป้อน",
    "vQq9v": "MD5 จากข้อความ",
    "vhgr3": "คลิกที่นี่เพื่อเลือกไฟล์และเข้ารหัสโดยตรง",
    "vu10K": "MD5 จากไฟล์",
    "wqp_4": "คลิกที่นี่เพื่อเลือกไฟล์และเข้ารหัสโดยตรง",
    "y_2Q1": "เข้ารหัสและถอดรหัส",
    "y_2Q2": "การเข้ารหัสแบบสมมาตร",
    "y_2Q3": "การเข้ารหัสแบบอสมมาตร",
    "y_2Q4": "อัลกอริทึมแห่งชาติของจีน",
    "y_2Q5": "การตรวจสอบสิทธิ์ทางเว็บ",
    "y_BN6": "อัลกอริทึมย่อย"
}