{
    "41ev7": "MD2",
    "5-S-B": "Dosyadan MD4",
    "6wtIW": "MD2 (Message-Digest Algorithm 2), bir girdi alan ve 128 bitlik (16 bayt) bir karma değeri üreten bir kriptografik karma işlevidir. 1989 yılında Ronald Rivest tarafından MD1'in halefi olarak geliştirildi. MD2, 8 bit bilgisayarlar için optimize edilmiştir ve diğer karma işlevlerine kıyasla nispeten basittir. Ancak MD2'nin çarpışma saldırılarına karşı savunmasız olduğu gösterilmiştir ve artık kriptografik amaçlar için güvenli sayılmamaktadır. MD2 hala bazı uygulamalarda kullanılmaktadır, ancak SHA-256 ve SHA-3 gibi daha güvenli hash fonksiyonlarının lehine aşamalı olarak kullanımdan kaldırılmaktadır.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4), bir girdi alan ve 128 bitlik (16 bayt) bir karma değeri üreten bir kriptografik karma işlevidir. 1990 yılında Ronald Rivest tarafından MD2 ve MD3'ün halefi olarak geliştirildi. Ancak MD4'ün çarpışma saldırılarına karşı savunmasız olduğu gösterilmiştir ve artık kriptografik amaçlar için güvenli sayılmamaktadır. MD4 hala bazı uygulamalarda kullanılıyor, ancak SHA-256 ve SHA-3 gibi daha güvenli hash fonksiyonlarının lehine aşamalı olarak kullanımdan kaldırılıyor.",
    "AWqXD": "MD5",
    "E88Ej": "Giriş metninizi şifrelemek için burayı tıklayın",
    "ECm8j": "Giriş metninizi şifrelemek için burayı tıklayın",
    "IP8-V": "Metinden MD2",
    "IPtV": "Metinden MD4",
    "P56UK": "Giriş metninizi şifrelemek için burayı tıklayın",
    "PJNze": "Giriş metninizi şifrelemek için burayı tıklayın",
    "REFy8": "Giriş metninizi şifrelemek için burayı tıklayın",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Tüm Araçlar",
    "eNNrM": "Dosyadan MD2",
    "g0QB9": "MD5 mesaj özeti algoritması, 128 bitlik bir karma değeri üreten, yaygın olarak kullanılan bir karma işlevidir. MD5, 1991 yılında Ronald Rivest tarafından daha önceki karma işlevi MD4'ün[3] yerini almak üzere tasarlandı ve 1992'de RFC 1321 olarak belirtildi. MD5, kasıtsız bozulmalara karşı veri bütünlüğünü doğrulamak için bir sağlama toplamı olarak kullanılabilir. Tarihsel olarak yaygın bir şekilde kriptografik karma işlevi olarak kullanılmıştır; ancak kapsamlı güvenlik açıklarından muzdarip olduğu tespit edildi. Örneğin bölümlenmiş bir veritabanındaki belirli bir anahtarın bölümünü belirlemek gibi kriptografik olmayan diğer amaçlar için de uygun olmaya devam eder ve daha yeni Güvenli Karma Algoritmalara göre daha düşük hesaplama gereksinimleri nedeniyle tercih edilebilir.[4]",
    "gh9zA": "SHA-1 veya Güvenli Karma Algoritma 1, bir girdi alan ve 160 bitlik (20 bayt) karma değer üreten bir şifreleme algoritmasıdır.",
    "gh9zA.sha224": "SHA-224, bir girdi alan ve 224 bitlik (28 bayt) bir karma değeri üreten bir şifreleme karma işlevidir. SHA-256, SHA-384 ve SHA-512'yi de içeren SHA-2 karma işlevleri ailesinin bir parçasıdır. SHA-224, çarpışma saldırılarına karşı savunmasız olduğu gösterilen önceki SHA-1'den daha güvenli olacak şekilde tasarlanmıştır. SHA-224, dijital imzalarda, mesaj kimlik doğrulama kodlarında ve veri bütünlüğünün kritik olduğu diğer uygulamalarda yaygın olarak kullanılır.",
    "gh9zA.sha256": "SHA-256, bir girdi alan ve 256 bitlik (32 bayt) bir karma değeri üreten bir şifreleme karma işlevidir. SHA-224, SHA-384 ve SHA-512'yi de içeren SHA-2 karma işlevleri ailesinin bir parçasıdır. SHA-256, çarpışma saldırılarına karşı savunmasız olduğu gösterilen önceki SHA-1'den daha güvenli olacak şekilde tasarlanmıştır. SHA-256, dijital imzalarda, mesaj kimlik doğrulama kodlarında ve veri bütünlüğünün kritik olduğu diğer uygulamalarda yaygın olarak kullanılır.",
    "gh9zA.sha384": "SHA-384, bir girdi alan ve 384 bitlik (48 bayt) bir karma değeri üreten bir şifreleme karma işlevidir. SHA-224, SHA-256, SHA-512, SHA-512/224 ve SHA-512/256'yı da içeren SHA-2 karma işlevleri ailesinin bir parçasıdır. SHA-384, çarpışma saldırılarına karşı savunmasız olduğu gösterilen önceki SHA-1'den daha güvenli olacak şekilde tasarlanmıştır. SHA-384, dijital imzalarda, mesaj kimlik doğrulama kodlarında ve veri bütünlüğünün kritik olduğu diğer uygulamalarda yaygın olarak kullanılır.",
    "gh9zA.sha512": "SHA-512, bir girdi alan ve 512 bitlik (64 bayt) bir karma değer üreten bir şifreleme karma işlevidir. SHA-224, SHA-256, SHA-384, SHA-512/224 ve SHA-512/256'yı da içeren SHA-2 karma işlevleri ailesinin bir parçasıdır. SHA-512, çarpışma saldırılarına karşı savunmasız olduğu gösterilen önceki SHA-1'den daha güvenli olacak şekilde tasarlanmıştır. SHA-512, dijital imzalarda, mesaj kimlik doğrulama kodlarında ve veri bütünlüğünün kritik olduğu diğer uygulamalarda yaygın olarak kullanılır.",
    "gwo79": "Dosyadan SHA1",
    "gwo79.sha224": "Dosyadan SHA224",
    "gwo79.sha256": "Dosyadan SHA256",
    "gwo79.sha384": "Dosyadan SHA384",
    "gwo79.sha512": "Dosyadan SHA512",
    "jjhid": "bu merhaba dünya",
    "m0105": "Kodlayıcı",
    "m0106": "Dönüştürücü",
    "m0107": "Jeneratör",
    "m0108": "Biçimlendirici",
    "m0109": "Dokümanlar Merkezi",
    "o3poi": "Metinden SHA1",
    "o3poi.sha224": "Metinden SHA224",
    "o3poi.sha256": "Metinden SHA256",
    "o3poi.sha384": "Metinden SHA384",
    "o3poi.sha512": "Metinden SHA512",
    "pl8S6": "Giriş metninizi şifrelemek için burayı tıklayın",
    "qjQvD": "Giriş metninizi şifrelemek için burayı tıklayın",
    "vQq9v": "Metinden MD5",
    "vhgr3": "Bir dosyayı seçmek ve doğrudan şifrelemek için burayı tıklayın.",
    "vu10K": "Dosyadan MD5",
    "wqp_4": "Bir dosyayı seçmek ve doğrudan şifrelemek için burayı tıklayın.",
    "y_2Q1": "Kodlama ve Kod Çözme",
    "y_2Q2": "Simetrik Kripto",
    "y_2Q3": "Asimetrik Kripto",
    "y_2Q4": "Çin Ulusal Algoritmaları",
    "y_2Q5": "Web Kimlik Doğrulaması",
    "y_BN6": "Özet Algoritması"
}