{
    "41ev7": "MD2",
    "5-S-B": "MD4 từ tệp",
    "6wtIW": "MD2 (Thuật toán phân loại thông báo 2) là hàm băm mật mã nhận đầu vào và tạo ra giá trị băm 128 bit (16 byte). \\n\\nNó được Ronald Rivest phát triển vào năm 1989 với tư cách là phiên bản kế thừa của MD1. MD2 được tối ưu hóa cho máy tính 8 bit và tương đối đơn giản so với các hàm băm khác. Tuy nhiên, MD2 đã được chứng minh là dễ bị tấn công va chạm và không còn được coi là an toàn cho mục đích mã hóa. MD2 vẫn được sử dụng trong một số ứng dụng nhưng đang bị loại bỏ dần để nhường chỗ cho các hàm băm an toàn hơn như SHA-256 và SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Thuật toán phân loại thông báo 4) là hàm băm mật mã nhận đầu vào và tạo ra giá trị băm 128 bit (16 byte). \\n\\nNó được Ronald Rivest phát triển vào năm 1990 dưới dạng kế thừa cho MD2 và MD3. Tuy nhiên, MD4 đã được chứng minh là dễ bị tấn công va chạm và không còn được coi là an toàn cho mục đích mã hóa. MD4 vẫn được sử dụng trong một số ứng dụng nhưng đang bị loại bỏ dần để nhường chỗ cho các hàm băm an toàn hơn như SHA-256 và SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Bấm vào đây để mã hóa văn bản đầu vào của bạn",
    "ECm8j": "Bấm vào đây để mã hóa văn bản đầu vào của bạn",
    "IP8-V": "MD2 từ văn bản",
    "IPtV": "MD4 từ văn bản",
    "P56UK": "Bấm vào đây để mã hóa văn bản đầu vào của bạn",
    "PJNze": "Bấm vào đây để mã hóa văn bản đầu vào của bạn",
    "REFy8": "Bấm vào đây để mã hóa văn bản đầu vào của bạn",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Tất cả công cụ",
    "eNNrM": "MD2 từ tệp",
    "g0QB9": "Thuật toán phân loại thông điệp MD5 là hàm băm được sử dụng rộng rãi tạo ra giá trị băm 128 bit. MD5 được thiết kế bởi Ronald Rivest vào năm 1991 để thay thế hàm băm MD4 trước đó,[3] và được chỉ định vào năm 1992 dưới dạng RFC 1321. MD5 có thể được sử dụng làm tổng kiểm tra để xác minh tính toàn vẹn dữ liệu khỏi bị hỏng ngoài ý muốn. Trong lịch sử, nó được sử dụng rộng rãi như một hàm băm mật mã; tuy nhiên nó đã được phát hiện là có nhiều lỗ hổng bảo mật. Nó vẫn phù hợp cho các mục đích phi mật mã khác, chẳng hạn như để xác định phân vùng cho một khóa cụ thể trong cơ sở dữ liệu được phân vùng và có thể được ưu tiên do yêu cầu tính toán thấp hơn so với các Thuật toán băm bảo mật gần đây hơn.[4]",
    "gh9zA": "SHA-1 hoặc Thuật toán băm an toàn 1 là thuật toán mã hóa lấy đầu vào và tạo ra giá trị băm 160 bit (20 byte).",
    "gh9zA.sha224": "SHA-224 là hàm băm mật mã nhận đầu vào và tạo ra giá trị băm 224 bit (28 byte). Nó là một phần của họ hàm băm SHA-2, cũng bao gồm SHA-256, SHA-384 và SHA-512. SHA-224 được thiết kế để an toàn hơn so với người tiền nhiệm của nó, SHA-1, vốn được chứng minh là dễ bị tấn công do va chạm. SHA-224 được sử dụng rộng rãi trong chữ ký số, mã xác thực tin nhắn và các ứng dụng khác đòi hỏi tính toàn vẹn dữ liệu.",
    "gh9zA.sha256": "SHA-256 là hàm băm mật mã nhận đầu vào và tạo ra giá trị băm 256 bit (32 byte). Nó là một phần của họ hàm băm SHA-2, cũng bao gồm SHA-224, SHA-384 và SHA-512. SHA-256 được thiết kế để an toàn hơn so với người tiền nhiệm của nó, SHA-1, vốn được chứng minh là dễ bị tấn công do va chạm. SHA-256 được sử dụng rộng rãi trong chữ ký số, mã xác thực tin nhắn và các ứng dụng khác đòi hỏi tính toàn vẹn dữ liệu.",
    "gh9zA.sha384": "SHA-384 là hàm băm mật mã nhận đầu vào và tạo ra giá trị băm 384 bit (48 byte). Nó là một phần của họ hàm băm SHA-2, bao gồm SHA-224, SHA-256, SHA-512, SHA-512/224 và SHA-512/256. SHA-384 được thiết kế để an toàn hơn so với người tiền nhiệm của nó, SHA-1, vốn được chứng minh là dễ bị tấn công do va chạm. SHA-384 được sử dụng rộng rãi trong chữ ký số, mã xác thực tin nhắn và các ứng dụng khác đòi hỏi tính toàn vẹn dữ liệu.",
    "gh9zA.sha512": "SHA-512 là hàm băm mật mã nhận đầu vào và tạo ra giá trị băm 512 bit (64 byte). Nó là một phần của họ hàm băm SHA-2, bao gồm SHA-224, SHA-256, SHA-384, SHA-512/224 và SHA-512/256. SHA-512 được thiết kế để an toàn hơn so với người tiền nhiệm SHA-1, vốn được chứng minh là dễ bị tấn công do va chạm. SHA-512 được sử dụng rộng rãi trong chữ ký số, mã xác thực tin nhắn và các ứng dụng khác đòi hỏi tính toàn vẹn dữ liệu.",
    "gwo79": "SHA1 từ tệp",
    "gwo79.sha224": "SHA224 từ tệp",
    "gwo79.sha256": "SHA256 từ tệp",
    "gwo79.sha384": "SHA384 từ tệp",
    "gwo79.sha512": "SHA512 từ tệp",
    "jjhid": "đây là xin chào thế giới",
    "m0105": "Bộ giải mã",
    "m0106": "Bộ chuyển đổi",
    "m0107": "Máy phát điện",
    "m0108": "Trình định dạng",
    "m0109": "Trung tâm Tài liệu",
    "o3poi": "SHA1 từ văn bản",
    "o3poi.sha224": "SHA224 từ văn bản",
    "o3poi.sha256": "SHA256 từ văn bản",
    "o3poi.sha384": "SHA384 từ văn bản",
    "o3poi.sha512": "SHA512 từ văn bản",
    "pl8S6": "Bấm vào đây để mã hóa văn bản đầu vào của bạn",
    "qjQvD": "Bấm vào đây để mã hóa văn bản đầu vào của bạn",
    "vQq9v": "MD5 từ văn bản",
    "vhgr3": "Bấm vào đây để chọn một tập tin và trực tiếp mã hóa nó.",
    "vu10K": "MD5 từ tệp",
    "wqp_4": "Bấm vào đây để chọn một tập tin và trực tiếp mã hóa nó.",
    "y_2Q1": "Mã hóa và giải mã",
    "y_2Q2": "Tiền điện tử đối xứng",
    "y_2Q3": "Tiền điện tử bất đối xứng",
    "y_2Q4": "Thuật toán quốc gia Trung Quốc",
    "y_2Q5": "Xác thực web",
    "y_BN6": "Thuật toán tóm tắt"
}