{
    "Diff-XML-JSON-Article": "Ero XML:n ja JSONin välillä",
    "MDN-XML-Syntax": "MDN Web Docs - XML-syntaksi",
    "W3Schools-XML-Validation": "W3Schools - XML-validointi",
    "XML-Advantage-Readable-018": "Sen ihmisen luettavissa oleva luonne mahdollistaa helpon tarkastuksen ja virheenkorjauksen, ja kyky määrittää mukautettuja rakenteita tekee siitä joustavan useisiin käyttötarkoituksiin.",
    "XML-Advantage-Standardized-017": "XML on laajalti hyväksytty standardi, joka tekee siitä yhteensopivan eri alustojen ja järjestelmien kanssa, mikä edistää yhteentoimivuutta ja tiedonvaihtoa.",
    "XML-Advantages-016": "Mitä etuja XML:n käytöstä on?",
    "XML-Attributes-006": "Elementeillä voi olla attribuutteja, jotka antavat lisätietoja elementistä avaavan tagin sisällä, kuten {0}",
    "XML-Basics-001": "Mikä on XML?",
    "XML-Def-002": "XML (eXtensible Markup Language) on merkintäkieli, joka määrittelee joukon sääntöjä asiakirjojen koodaamiseksi muodossa, joka on sekä ihmisen että koneellisesti luettavissa.",
    "XML-Disadvantage-Size-020": "XML voi olla suhteellisen monisanainen, mikä johtaa suurempiin tiedostokokoihin verrattuna vaihtoehtoihin, kuten JSON, mikä vaikuttaa tiedonsiirtonopeuteen ja tallennusvaatimuksiin.",
    "XML-Disadvantages-019": "Mitä haittoja XML:n käytössä on?",
    "XML-JSON-Diff-Structure-014": "XML käyttää monisanaisia, hierarkkisia tageja rakenteeseen, kun taas JSON luottaa avainarvopareihin ja taulukoihin. Esimerkki: XML {0} vs. JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML:ssä on tiukempi syntaksi, jossa on sulkevia tageja ja attribuutteja, kun taas JSONin syntaksi on kevyempi ja lähempänä JavaScript-objektien merkintää. JSON-tiedostoja pidetään yleensä helpompia jäsentää ja lähettää verkossa.",
    "XML-JSON-Difference-013": "Mitä eroa on XML:n ja JSONin välillä?",
    "XML-Nesting-007": "Kuinka sisäkkäisyys toimii XML:ssä?",
    "XML-Nesting-Example-009": "Esimerkiksi `<book><title>My Book Title</title><author>John Doe</author></book>` edustaa kirjaa, jonka nimi ja kirjoittaja ovat sisäkkäisinä elementteinä.",
    "XML-Nesting-Explanation-008": "XML:ssä elementit voidaan upottaa toistensa sisään edustamaan hierarkkisia suhteita. Alielementit sijoitetaan pääelementin avaus- ja sulkemistunnisteiden väliin.",
    "XML-Processing-Speed-021": "XML:n jäsentäminen ja luominen voi olla hitaampaa sen tiukan syntaksin ja vahvistustarpeen vuoksi, etenkin kun käsitellään monimutkaisia ​​asiakirjoja.",
    "XML-Purpose-003": "Se on suunniteltu kuljettamaan tietoja sen sijaan, että se näyttäisi tietoja, kuten HTML:ää, joten sitä voidaan käyttää yhteisenä muotona strukturoidun tiedon jakamiseen eri alustoilla ja sovelluksissa.",
    "XML-Syntax-004": "Mikä on XML:n perussyntaksi?",
    "XML-Syntax-Example-005": "Yksinkertainen XML-dokumentti koostuu elementeistä puumaisessa rakenteessa. Jokainen elementti alkaa kulmasulkeissa olevalla tagilla (<element>) ja päättyy sulkevaan tagiin (</element>).",
    "XML-Validation-010": "Mitä XML-validointi on ja miten se toimii?",
    "XML-Validation-Def-011": "XML-validointi varmistaa, että XML-dokumentti noudattaa tiettyä asiakirjatyyppimäärityksessä (DTD) tai XML-skeemassa (XSD) määritettyä sääntöjoukkoa.",
    "XML-Validation-Process-012": "Validaattorit tarkistavat, ovatko kaikki vaaditut elementit ja attribuutit olemassa, vahvistavat tietotyypit ja panevat täytäntöön kaikki skeemassa määritetyt rajoitukset ennen asiakirjan käsittelemistä."
}