{
    "Diff-XML-JSON-Article": "Perbedaan Antara XML dan JSON",
    "MDN-XML-Syntax": "Dokumen Web MDN - Sintaks XML",
    "W3Schools-XML-Validation": "W3Schools - Validasi XML",
    "XML-Advantage-Readable-018": "Sifatnya yang dapat dibaca manusia memungkinkan pemeriksaan dan debugging dengan mudah, dan kemampuan untuk menentukan struktur khusus membuatnya fleksibel untuk berbagai kasus penggunaan.",
    "XML-Advantage-Standardized-017": "XML adalah standar yang diadopsi secara luas, membuatnya kompatibel dengan berbagai platform dan sistem, meningkatkan interoperabilitas dan pertukaran data.",
    "XML-Advantages-016": "Apa keuntungan menggunakan XML?",
    "XML-Attributes-006": "Elemen dapat memiliki atribut, yang memberikan informasi tambahan tentang elemen dalam tag pembuka, seperti {0}",
    "XML-Basics-001": "Apa itu XML?",
    "XML-Def-002": "XML (eXtensible Markup Language) adalah bahasa markup yang mendefinisikan seperangkat aturan untuk menyandikan dokumen dalam format yang dapat dibaca manusia dan mesin.",
    "XML-Disadvantage-Size-020": "XML relatif bertele-tele, sehingga menghasilkan ukuran file yang lebih besar dibandingkan alternatif seperti JSON, sehingga memengaruhi kecepatan transmisi dan persyaratan penyimpanan.",
    "XML-Disadvantages-019": "Apa saja kelemahan menggunakan XML?",
    "XML-JSON-Diff-Structure-014": "XML menggunakan tag hierarki yang bertele-tele untuk strukturnya, sementara JSON mengandalkan pasangan nilai kunci dan array. Contoh: XML {0} vs. JSON {1}.",
    "XML-JSON-Diff-Syntax-015": "XML memiliki sintaks yang lebih ketat dengan tag dan atribut penutup, sedangkan sintaksis JSON lebih ringan dan mendekati notasi objek JavaScript. JSON umumnya dianggap lebih mudah untuk diurai dan dikirim melalui web.",
    "XML-JSON-Difference-013": "Apa perbedaan antara XML dan JSON?",
    "XML-Nesting-007": "Bagaimana cara kerja bersarang di XML?",
    "XML-Nesting-Example-009": "Misalnya, `<book><title>Judul Buku Saya</title><author>John Doe</author></book>` mewakili buku dengan judul dan pengarangnya sebagai elemen bertumpuk.",
    "XML-Nesting-Explanation-008": "Dalam XML, elemen dapat disarangkan satu sama lain untuk mewakili hubungan hierarki. Elemen anak ditempatkan di antara tag pembuka dan penutup elemen induknya.",
    "XML-Processing-Speed-021": "Penguraian dan pembuatan XML bisa lebih lambat karena sintaksisnya yang ketat dan perlunya validasi, terutama saat menangani dokumen yang kompleks.",
    "XML-Purpose-003": "Ini dirancang untuk membawa data, bukan menampilkan data seperti HTML, sehingga memungkinkannya digunakan sebagai format umum untuk berbagi informasi terstruktur di berbagai platform dan aplikasi.",
    "XML-Syntax-004": "Apa sintaks dasar XML?",
    "XML-Syntax-Example-005": "Dokumen XML sederhana terdiri dari elemen-elemen dalam struktur seperti pohon. Setiap elemen dimulai dengan tag dalam tanda kurung siku (<element>) dan diakhiri dengan tag penutup (</element>).",
    "XML-Validation-010": "Apa itu validasi XML dan bagaimana cara kerjanya?",
    "XML-Validation-Def-011": "Validasi XML memastikan bahwa dokumen XML mematuhi seperangkat aturan tertentu yang ditentukan dalam Definisi Tipe Dokumen (DTD) atau Skema XML (XSD).",
    "XML-Validation-Process-012": "Validator memeriksa apakah semua elemen dan atribut yang diperlukan ada, memvalidasi tipe data, dan menerapkan batasan apa pun yang ditentukan dalam skema sebelum memproses dokumen."
}