{
    "CP-Advantage-Career-014": "Mempelajari program membuka peluang kerjaya merentas pelbagai industri dan membolehkan anda membangunkan penyelesaian inovatif, mengautomasikan tugas dan memahami sistem yang kompleks.",
    "CP-Advantages-013": "Apakah kelebihan mempelajari pengaturcaraan komputer?",
    "CP-Basics-001": "Apakah pengaturcaraan komputer?",
    "CP-Def-002": "Pengaturcaraan komputer melibatkan penulisan arahan, atau kod, dalam bahasa pengaturcaraan untuk mengarahkan komputer tentang cara melaksanakan tugas tertentu.",
    "CP-History-004": "Apakah sejarah pengaturcaraan komputer?",
    "CP-History-Origin-005": "Mesin boleh atur cara pertama bermula sejak kerja Ada Lovelace pada Enjin Analitik Charles Babbage pada abad ke-19. Walau bagaimanapun, pengaturcaraan moden bermula dengan penciptaan komputer elektronik tujuan umum pertama, ENIAC, pada tahun 1940-an.",
    "CP-Lang-Choice-009": "Pilihan bahasa bergantung pada faktor seperti keperluan projek, sokongan komuniti, kemudahan pembelajaran dan keperluan prestasi.",
    "CP-Language-Evolution-006": "Sejak itu, bahasa pengaturcaraan berkembang daripada kod mesin kepada pemasangan, kemudian kepada bahasa peringkat tinggi seperti FORTRAN, COBOL, C, dan kini kepada bahasa moden seperti Python, JavaScript dan Rust.",
    "CP-Languages-007": "Apakah beberapa bahasa pengaturcaraan yang popular?",
    "CP-Languages-List-008": "Bahasa pengaturcaraan popular termasuk Java, Python, JavaScript, C++, C#, Swift, Go, PHP, Ruby dan Kotlin. Setiap satu mempunyai kekuatan dan kes penggunaannya sendiri, cth., Python untuk sains data, JavaScript untuk pembangunan web dan C++ untuk pengaturcaraan sistem.",
    "CP-Process-010": "Apakah proses pengaturcaraan komputer?",
    "CP-Process-Explanation-011": "Pengaturcaraan biasanya melibatkan perancangan (mendefinisikan masalah dan mereka bentuk penyelesaian), pengekodan (menulis kod sumber dalam bahasa yang dipilih), ujian (menyahpepijat dan mengesahkan fungsi) dan penyelenggaraan (mengemas kini dan menambah baik program dari semasa ke semasa).",
    "CP-Purpose-003": "Pengaturcara mencipta algoritma, menyelesaikan masalah dan membina aplikasi perisian yang boleh mengautomasikan proses, memanipulasi data dan berinteraksi dengan pengguna atau sistem lain.",
    "CP-SDLC-012": "Ini sering distrukturkan dalam Kitaran Hayat Pembangunan Perisian (SDLC) yang merangkumi fasa tambahan seperti analisis keperluan, reka bentuk, penggunaan dan ujian penerimaan pengguna.",
    "CP-Skillset-015": "Ia juga meningkatkan pemikiran logik, kemahiran menyelesaikan masalah, dan kebolehsuaian kepada teknologi baharu, menjadikan teknologi ini lebih serba boleh dalam era digital.",
    "HistOfProg-Wikipedia": "Sejarah Bahasa Pengaturcaraan - Wikipedia",
    "SDLC-Wikipedia": "Kitaran Hayat Pembangunan Perisian - Wikipedia",
    "TIOBE-Index": "Indeks TIOBE - Syarikat Kualiti Perisian"
}