{
    "MD6-AlgorithmDetails-010": "MD6 알고리즘 세부사항",
    "MD6-ComparisonSHA3-020": "MD6은 SHA-3(Keccak)과 어떻게 비교됩니까?",
    "MD6-Def-002": "MD6(Message-Digest Algorithm 6)은 Ronald Rivest가 2008년에 설계한 암호화 해시 함수입니다. MD 제품군의 발전된 버전으로 128~512비트 범위의 가변 출력 크기를 제공합니다.",
    "MD6-FAQ-001": "MD6란 무엇입니까?",
    "MD6-FutureDevelopments-028": "MD6에 대한 향후 개발이나 개선 계획이 있습니까?",
    "MD6-FutureUnknown-029": "현재로서는 진행 중인 개발이나 MD6 알고리즘 개선 계획에 대해 공개적으로 사용 가능한 정보가 없습니다. 암호화 연구는 계속 발전하고 있으며 새로운 위협이나 요구 사항을 해결하기 위해 새로운 알고리즘이 등장할 수 있습니다.",
    "MD6-History-004": "MD6는 어떻게 개발되었으며 무엇이 탄생하게 되었나요?",
    "MD6-Operation-007": "MD6 작동은 어떻게 작동하나요?",
    "MD6-Origin-005": "MD6는 당시 널리 사용되던 MD5와 SHA-1에서 발견된 취약점에 대한 대응으로 만들어졌습니다. 이는 출력 크기와 관련하여 유연성이 향상된 보다 안전한 대안을 제공하는 것을 목표로 했습니다.",
    "MD6-PKI-Alternatives-027": "PKI 및 디지털 서명 애플리케이션의 경우 RSA/SHA-256 또는 SHA-2 또는 SHA-3 변형이 포함된 ECDSA와 같은 표준이 대신 사용됩니다. 이는 광범위한 분석을 거쳐 암호화 커뮤니티 내에서 신뢰를 구축했습니다.",
    "MD6-PKI-Considerations-026": "MD6는 MD5와 같은 이전 해시 기능보다 강력한 보안을 제공하기 위해 고안되었지만 상대적인 참신함과 광범위한 암호화 커뮤니티 수용 부족으로 인해 PKI 또는 디지털 서명 체계에 널리 채택되지 않았습니다.",
    "MD6-Process-008": "MD6은 트리형 구조에 적용되는 일련의 압축 기능을 통해 입력 메시지를 처리합니다. 알고리즘은 병렬로 작동할 수 있으므로 더 큰 입력에 대한 성능이 향상됩니다.",
    "MD6-Purpose-003": "MD6는 이전 제품에 비해 강력한 보안 기능과 향상된 성능을 제공하여 충돌 방지 해싱 및 메시지 무결성 검사가 필요한 다양한 애플리케이션에 적합하도록 하는 것을 목표로 합니다.",
    "MD6-Rounds-009": "MD6 트리의 각 노드는 모듈러 추가, 비트별 XOR 및 비선형 순열과 관련된 여러 라운드의 혼합 작업을 거칩니다. 최종 루트 노드 값은 입력 메시지의 해시 다이제스트를 나타냅니다.",
    "MD6-SecurityUpgrade-006": "MD6의 설계는 트리 기반 해싱 개념을 기반으로 구축되어 이전 MD 알고리즘보다 사전 이미지 및 충돌 공격에 대해 더 나은 보호 기능을 제공하는 동시에 대규모 데이터 세트에 대해 더 높은 처리량을 제공합니다.",
    "MD6-StayingCurrent-030": "특히 암호화 보안 환경이 시간이 지남에 따라 발전함에 따라 모든 애플리케이션에 대한 해시 함수를 선택할 때 암호화 전문가의 최신 연구 결과 및 권장 사항을 계속 업데이트하는 것이 중요합니다.",
    "MD6-UseInPKI-025": "MD6를 PKI(공개 키 인프라) 또는 디지털 서명에 사용할 수 있습니까?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3은 공식 NIST 표준으로 채택되었으며 강력한 보안과 성능으로 인해 널리 사용되었습니다. MD6은 이론적으로 안전함에도 불구하고 동일한 수준의 채택이나 표준화를 보지 못했습니다.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6과 SHA-3은 모두 보안을 염두에 두고 설계되었지만 서로 다른 해싱 기술을 사용합니다. MD6은 향상된 병렬성을 위해 트리 기반 디자인을 사용하는 반면, SHA-3은 스폰지 구성을 기반으로 합니다.",
    "MD6-vs-SHA3-Flexibility-022": "MD6은 가변 출력 길이를 제공하므로 사용자 정의 해시 크기가 필요한 애플리케이션에 유리할 수 있습니다. SHA-3은 가변 출력 길이도 지원하지만 가장 일반적인 변형인 SHAKE는 임의 길이 출력에 더 많은 유연성을 제공합니다.",
    "SHA3-NISTStandard-024": "SHA-3 표준화"
}