{
    "MD6-AlgorithmDetails-010": "รายละเอียดอัลกอริทึม MD6",
    "MD6-ComparisonSHA3-020": "MD6 เปรียบเทียบกับ SHA-3 (Keccak) อย่างไร",
    "MD6-Def-002": "MD6 (อัลกอริธึมการแยกข้อความ 6) คือฟังก์ชันแฮชการเข้ารหัสที่ออกแบบโดย Ronald Rivest ในปี 2008 ซึ่งเป็นวิวัฒนาการของตระกูล MD โดยนำเสนอขนาดเอาต์พุตที่หลากหลายตั้งแต่ 128 ถึง 512 บิต",
    "MD6-FAQ-001": "MD6 คืออะไร?",
    "MD6-FutureDevelopments-028": "มีการพัฒนาหรือปรับปรุงในอนาคตที่วางแผนไว้สำหรับ MD6 หรือไม่?",
    "MD6-FutureUnknown-029": "ณ ขณะนี้ ยังไม่มีข้อมูลที่เปิดเผยต่อสาธารณะเกี่ยวกับการพัฒนาที่กำลังดำเนินอยู่หรือแผนการปรับปรุงตามอัลกอริทึม MD6 การวิจัยด้านการเข้ารหัสยังคงมีการพัฒนาอย่างต่อเนื่อง และอัลกอริธึมใหม่อาจเกิดขึ้นเพื่อจัดการกับภัยคุกคามหรือข้อกำหนดที่เกิดขึ้นใหม่",
    "MD6-History-004": "MD6 ได้รับการพัฒนาอย่างไรและอะไรนำไปสู่การสร้างมันขึ้นมา?",
    "MD6-Operation-007": "การทำงานของ MD6 ทำงานอย่างไร?",
    "MD6-Origin-005": "MD6 ถูกสร้างขึ้นเพื่อตอบสนองต่อช่องโหว่ที่พบใน MD5 และ SHA-1 ซึ่งใช้กันอย่างแพร่หลายในขณะนั้น โดยมีเป้าหมายเพื่อมอบทางเลือกที่ปลอดภัยยิ่งขึ้นพร้อมความยืดหยุ่นที่เพิ่มขึ้นเกี่ยวกับขนาดเอาต์พุต",
    "MD6-PKI-Alternatives-027": "สำหรับ PKI และแอปพลิเคชันลายเซ็นดิจิทัล โดยทั่วไปจะใช้มาตรฐาน เช่น RSA/SHA-256 หรือ ECDSA ที่มีรูปแบบ SHA-2 หรือ SHA-3 แทน สิ่งเหล่านี้ได้ผ่านการวิเคราะห์อย่างกว้างขวางและได้สร้างความไว้วางใจภายในชุมชนการเข้ารหัส",
    "MD6-PKI-Considerations-026": "แม้ว่า MD6 ได้รับการออกแบบเพื่อให้มีความปลอดภัยที่แข็งแกร่งกว่าฟังก์ชันแฮชรุ่นก่อนๆ เช่น MD5 แต่ก็ยังไม่ได้รับการยอมรับอย่างกว้างขวางสำหรับ PKI หรือรูปแบบลายเซ็นดิจิทัล เนื่องจากมีความแปลกใหม่และขาดการยอมรับจากชุมชนการเข้ารหัสในวงกว้าง",
    "MD6-Process-008": "MD6 ประมวลผลข้อความอินพุตผ่านชุดฟังก์ชันการบีบอัดที่ใช้ในโครงสร้างคล้ายต้นไม้ อัลกอริธึมสามารถทำงานแบบขนานได้ ซึ่งจะช่วยเพิ่มประสิทธิภาพให้กับอินพุตขนาดใหญ่",
    "MD6-Purpose-003": "MD6 มุ่งหวังที่จะมอบคุณสมบัติด้านความปลอดภัยที่แข็งแกร่งและประสิทธิภาพที่ดีขึ้นเมื่อเทียบกับรุ่นก่อน ทำให้เหมาะสำหรับการใช้งานที่หลากหลายที่ต้องการการตรวจสอบแฮชที่ป้องกันการชนกันและการตรวจสอบความสมบูรณ์ของข้อความ",
    "MD6-Rounds-009": "แต่ละโหนดในแผนผัง MD6 ผ่านการดำเนินการผสมหลายรอบที่เกี่ยวข้องกับการบวกแบบโมดูลาร์, XOR ระดับบิต และการเรียงสับเปลี่ยนแบบไม่เชิงเส้น ค่าโหนดรูทสุดท้ายแสดงถึงแฮชไดเจสต์ของข้อความอินพุต",
    "MD6-SecurityUpgrade-006": "การออกแบบ MD6 สร้างขึ้นบนแนวคิดของการแฮชแบบต้นไม้ ช่วยให้สามารถป้องกันการโจมตีพรีอิมเมจและการชนกันได้ดีขึ้นกว่าอัลกอริธึม MD รุ่นก่อนๆ ขณะเดียวกันก็ให้ปริมาณงานที่สูงขึ้นสำหรับชุดข้อมูลขนาดใหญ่",
    "MD6-StayingCurrent-030": "จำเป็นอย่างยิ่งที่จะต้องติดตามผลการวิจัยล่าสุดและคำแนะนำจากผู้เชี่ยวชาญด้านการเข้ารหัสเมื่อเลือกฟังก์ชันแฮชสำหรับแอปพลิเคชันใดๆ โดยเฉพาะอย่างยิ่งเมื่อภาพรวมของการรักษาความปลอดภัยในการเข้ารหัสมีการพัฒนาไปตามกาลเวลา",
    "MD6-UseInPKI-025": "MD6 สามารถใช้สำหรับโครงสร้างพื้นฐานคีย์สาธารณะ (PKI) หรือลายเซ็นดิจิทัลได้หรือไม่",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 ถูกนำมาใช้เป็นมาตรฐาน NIST อย่างเป็นทางการและมีการใช้กันอย่างแพร่หลายเนื่องจากมีความปลอดภัยและประสิทธิภาพที่แข็งแกร่ง MD6 แม้จะมีความปลอดภัยในทางทฤษฎี แต่ก็ยังไม่เห็นการนำไปใช้หรือมาตรฐานในระดับเดียวกัน",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 และ SHA-3 ได้รับการออกแบบโดยคำนึงถึงความปลอดภัยเป็นหลัก แต่ใช้เทคนิคแฮชที่แตกต่างกัน MD6 ใช้การออกแบบแบบต้นไม้เพื่อปรับปรุงความขนาน ในขณะที่ SHA-3 ใช้โครงสร้างฟองน้ำ",
    "MD6-vs-SHA3-Flexibility-022": "MD6 นำเสนอความยาวเอาต์พุตที่แปรผันได้ ซึ่งจะเป็นประโยชน์สำหรับแอปพลิเคชันที่ต้องการขนาดแฮชแบบกำหนดเอง SHA-3 ยังรองรับความยาวเอาต์พุตที่แปรผันได้ แม้ว่า SHAKE ซึ่งเป็นรูปแบบที่พบบ่อยที่สุดจะมอบความยืดหยุ่นมากยิ่งขึ้นด้วยเอาต์พุตที่มีความยาวตามต้องการ",
    "SHA3-NISTStandard-024": "การกำหนดมาตรฐาน SHA-3"
}