{
    "JS-Basics-001": "จาวาสคริปต์คืออะไร?",
    "JS-DOM-API-007": "JavaScript โต้ตอบกับ DOM อย่างไร",
    "JS-DOM-API-Explanation-008": "JavaScript มี Document Object Model (DOM) API เพื่อจัดการ HTML และ CSS ทำให้นักพัฒนาสามารถเปลี่ยนเนื้อหา สไตล์ และตัวฟังเหตุการณ์ได้แบบไดนามิก",
    "JS-DOM-Example-009": "ตัวอย่างเช่น คุณสามารถเลือกองค์ประกอบและเปลี่ยนเนื้อหาข้อความ: `document.getElementById('myElement').textContent = 'ข้อความใหม่';`",
    "JS-Data-Types-010": "ประเภทข้อมูลใน JavaScript คืออะไร?",
    "JS-Data-Types-List-011": "JavaScript รองรับข้อมูลหลายประเภท รวมถึงข้อมูลพื้นฐาน เช่น สตริง ตัวเลข บูลีน null ไม่ได้กำหนด และสัญลักษณ์ รวมถึงประเภทที่ซับซ้อน เช่น อ็อบเจ็กต์และอาร์เรย์",
    "JS-Def-002": "JavaScript (JS) เป็นภาษาการเขียนโปรแกรมระดับสูงที่ตีความซึ่งใช้กันอย่างแพร่หลายในการสร้างเว็บแอปพลิเคชัน ปรับปรุงอินเทอร์เฟซผู้ใช้ และสร้างตรรกะฝั่งเซิร์ฟเวอร์ด้วย Node.js",
    "JS-Event-Loop-013": "เหตุการณ์วนซ้ำใน JavaScript คืออะไร?",
    "JS-Event-Loop-Explanation-014": "ลูปเหตุการณ์เป็นส่วนหลักของโมเดลการทำงานพร้อมกันของ JavaScript ซึ่งช่วยให้ดำเนินการแบบอะซิงโครนัสผ่านการเรียกกลับ สัญญา และอะซิงก์/รอได้",
    "JS-Event-Loop-Process-015": "โดยจะรันสคริปต์หลักก่อน จากนั้นจึงเรียกใช้ฟังก์ชันการโทรกลับเมื่อมีเหตุการณ์ที่เกี่ยวข้องกัน (เช่น การป้อนข้อมูลของผู้ใช้หรือการตอบสนองของเครือข่าย) เกิดขึ้น โดยจัดการผ่านระบบคิว",
    "JS-Function-Syntax-006": "ฟังก์ชั่นถูกกำหนดโดยใช้คีย์เวิร์ด `function` ตามด้วยชื่อฟังก์ชันและพารามิเตอร์ที่อยู่ในวงเล็บ ส่วนของฟังก์ชันจะอยู่ในวงเล็บปีกกา: `function wait(name) { console.log(`Hello, ${name}!`); }`",
    "JS-Purpose-003": "ได้รับการพัฒนาครั้งแรกโดย Brendan Eich ที่ Netscape ในปี 1995 และต่อมาได้พัฒนาให้เป็นหนึ่งในภาษาที่ได้รับความนิยมมากที่สุด โดยได้รับการสนับสนุนจากเว็บเบราว์เซอร์และแพลตฟอร์มหลักๆ ทั้งหมด เช่น Electron และ React Native",
    "JS-Syntax-004": "ไวยากรณ์พื้นฐานของ JavaScript คืออะไร?",
    "JS-Type-Checking-012": "การตรวจสอบประเภทสามารถทำได้โดยใช้ตัวสร้าง (`typeof value === 'string'`) หรือตัวดำเนินการ `instanceof` สำหรับอ็อบเจ็กต์ที่สืบทอดมาจากตัวสร้างในตัว (เช่น `value instance of Array`)",
    "MDN-DOM-API": "MDN Web Docs - การจัดการเอกสาร",
    "MDN-Event-Loop": "MDN Web Docs - ลูปเหตุการณ์",
    "MDN-JS-Guide": "เอกสารเว็บ MDN - คู่มือ JavaScript",
    "MDN-JS-Types": "MDN Web Docs - ประเภทข้อมูลและโครงสร้างข้อมูล"
}