{
    "MD6-AlgorithmDetails-010": "MD6 アルゴリズムの詳細",
    "MD6-ComparisonSHA3-020": "MD6 は SHA-3 (Keccak) とどう違うのですか?",
    "MD6-Def-002": "MD6 (メッセージ ダイジェスト アルゴリズム 6) は、2008 年に Ronald Rivest によって設計された暗号化ハッシュ関数です。これは MD ファミリの進化版であり、128 ～ 512 ビットの範囲の可変出力サイズを提供します。",
    "MD6-FAQ-001": "MD6とは何ですか?",
    "MD6-FutureDevelopments-028": "MD6 に関して今後の開発や改善の予定はありますか?",
    "MD6-FutureUnknown-029": "現時点では、進行中の開発や MD6 アルゴリズムの改善計画について公開されている情報はありません。暗号化の研究は進化し続けており、新たな脅威や要件に対処するための新しいアルゴリズムが登場する可能性があります。",
    "MD6-History-004": "MD6 はどのように開発され、何が作成に至ったのでしょうか?",
    "MD6-Operation-007": "MD6 の操作はどのように行われますか?",
    "MD6-Origin-005": "MD6 は、当時広く使用されていた MD5 と SHA-1 で見つかった脆弱性に対応するために作成されました。出力サイズに関する柔軟性を高めた、より安全な代替手段を提供することを目的としています。",
    "MD6-PKI-Alternatives-027": "PKI およびデジタル署名アプリケーションの場合は、代わりに RSA/SHA-256 や SHA-2 または SHA-3 バリアントを備えた ECDSA などの標準が一般的に使用されます。これらは広範な分析を経て、暗号化コミュニティ内で信頼を確立しました。",
    "MD6-PKI-Considerations-026": "MD6 は、MD5 などの以前のハッシュ関数よりも強力なセキュリティを提供することを目的としていましたが、比較的新規性があり、暗号コミュニティで広く受け入れられていないため、PKI やデジタル署名スキームには広く採用されていませんでした。",
    "MD6-Process-008": "MD6 は、ツリー状の構造で適用される一連の圧縮関数を通じて入力メッセージを処理します。このアルゴリズムは並列で動作できるため、より大きな入力のパフォーマンスに貢献します。",
    "MD6-Purpose-003": "MD6 は、堅牢なセキュリティ機能を提供し、以前のバージョンと比較してパフォーマンスが向上することを目的としており、耐衝突ハッシュやメッセージ整合性チェックを必要とするさまざまなアプリケーションに適しています。",
    "MD6-Rounds-009": "MD6 ツリー内の各ノードは、モジュラー加算、ビットごとの XOR、および非線形置換を含む混合操作を複数回実行します。最終的なルート ノード値は、入力メッセージのハッシュ ダイジェストを表します。",
    "MD6-SecurityUpgrade-006": "MD6 の設計はツリーベースのハッシュの概念に基づいて構築されており、以前の MD アルゴリズムよりもプリイメージ攻撃や衝突攻撃に対する優れた保護を提供できると同時に、大規模なデータ セットに対してより高いスループットを提供します。",
    "MD6-StayingCurrent-030": "アプリケーションのハッシュ関数を選択するときは、特に暗号セキュリティの状況が時間の経過とともに進化するため、最新の研究結果や暗号専門家からの推奨事項を常に最新の状態に保つことが重要です。",
    "MD6-UseInPKI-025": "MD6 は公開キー基盤 (PKI) またはデジタル署名に使用できますか?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 は NIST の公式標準として採用されており、その堅牢なセキュリティとパフォーマンスにより広く使用されています。 MD6 は理論的には安全であるにもかかわらず、同レベルの採用や標準化は見られていません。",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 と SHA-3 は両方ともセキュリティを念頭に置いて設計されていますが、使用するハッシュ技術は異なります。 MD6 は並列性を向上させるためにツリーベースの設計を使用していますが、SHA-3 はスポンジ構造に基づいています。",
    "MD6-vs-SHA3-Flexibility-022": "MD6 は可変出力長を提供するため、カスタム ハッシュ サイズを必要とするアプリケーションには有利です。 SHA-3 は可変出力長もサポートしていますが、その最も一般的なバリアントである SHAKE は、任意の長さの出力でさらに高い柔軟性を提供します。",
    "SHA3-NISTStandard-024": "SHA-3標準化"
}