{
    "MD6-AlgorithmDetails-010": "Butiran Algoritma MD6",
    "MD6-ComparisonSHA3-020": "Bagaimanakah MD6 dibandingkan dengan SHA-3 (Keccak)?",
    "MD6-Def-002": "MD6 (Message-Digest Algorithm 6) ialah fungsi cincang kriptografi yang direka oleh Ronald Rivest pada tahun 2008. Ia merupakan evolusi keluarga MD, yang menawarkan saiz output berubah-ubah antara 128 hingga 512 bit.",
    "MD6-FAQ-001": "Apakah MD6?",
    "MD6-FutureDevelopments-028": "Adakah terdapat sebarang perkembangan atau penambahbaikan masa hadapan yang dirancang untuk MD6?",
    "MD6-FutureUnknown-029": "Setakat ini, tidak ada sebarang maklumat yang tersedia secara terbuka tentang pembangunan yang sedang berjalan atau rancangan untuk menambah baik algoritma MD6. Penyelidikan kriptografi terus berkembang, dan algoritma baharu mungkin muncul untuk menangani ancaman atau keperluan yang muncul.",
    "MD6-History-004": "Bagaimanakah MD6 dibangunkan dan apakah yang membawa kepada penciptaannya?",
    "MD6-Operation-007": "Bagaimanakah operasi MD6 berfungsi?",
    "MD6-Origin-005": "MD6 dicipta sebagai tindak balas kepada kelemahan yang terdapat dalam MD5 dan SHA-1, yang digunakan secara meluas pada masa itu. Ia bertujuan untuk menyediakan alternatif yang lebih selamat dengan peningkatan fleksibiliti mengenai saiz output.",
    "MD6-PKI-Alternatives-027": "Untuk PKI dan aplikasi tandatangan digital, piawaian seperti RSA/SHA-256 atau ECDSA dengan varian SHA-2 atau SHA-3 biasanya digunakan. Ini telah melalui analisis yang meluas dan telah mewujudkan kepercayaan dalam komuniti kriptografi.",
    "MD6-PKI-Considerations-026": "Walaupun MD6 bertujuan untuk menyediakan keselamatan yang lebih kukuh daripada fungsi cincang terdahulu seperti MD5, ia tidak diterima pakai secara meluas untuk PKI atau skim tandatangan digital kerana kebaharuan relatifnya dan kekurangan penerimaan komuniti kriptografi yang luas.",
    "MD6-Process-008": "MD6 memproses mesej input melalui satu siri fungsi mampatan yang digunakan dalam struktur seperti pokok. Algoritma boleh beroperasi secara selari, yang menyumbang kepada prestasinya untuk input yang lebih besar.",
    "MD6-Purpose-003": "MD6 bertujuan untuk menyediakan ciri keselamatan yang teguh dan prestasi yang dipertingkatkan berbanding pendahulunya, menjadikannya sesuai untuk pelbagai aplikasi yang memerlukan pencincangan tahan perlanggaran dan semakan integriti mesej.",
    "MD6-Rounds-009": "Setiap nod dalam pepohon MD6 menjalani beberapa pusingan operasi pencampuran yang melibatkan penambahan modular, XOR bitwise dan pilih atur bukan linear. Nilai nod akar akhir mewakili ringkasan cincang bagi mesej input.",
    "MD6-SecurityUpgrade-006": "Reka bentuk MD6 dibina berdasarkan konsep pencincangan berasaskan pepohon, membolehkan ia menawarkan perlindungan yang lebih baik terhadap serangan praimej dan perlanggaran berbanding algoritma MD sebelumnya, di samping menyediakan daya pemprosesan yang lebih tinggi untuk set data yang besar.",
    "MD6-StayingCurrent-030": "Adalah penting untuk sentiasa dikemas kini dengan penemuan penyelidikan dan cadangan terkini daripada pakar kriptografi apabila memilih fungsi cincang untuk sebarang aplikasi, terutamanya apabila landskap keselamatan kriptografi berkembang dari semasa ke semasa.",
    "MD6-UseInPKI-025": "Bolehkah MD6 digunakan untuk Infrastruktur Kunci Awam (PKI) atau tandatangan digital?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 telah diterima pakai sebagai standard NIST rasmi dan mendapat penggunaan meluas kerana keselamatan dan prestasinya yang teguh. MD6, walaupun secara teorinya selamat, tidak melihat tahap penerimaan atau penyeragaman yang sama.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 dan SHA-3 kedua-duanya direka bentuk dengan mengambil kira keselamatan, tetapi mereka menggunakan teknik pencincangan yang berbeza. MD6 menggunakan reka bentuk berasaskan pokok untuk keselarian yang lebih baik, manakala SHA-3 adalah berdasarkan pembinaan span.",
    "MD6-vs-SHA3-Flexibility-022": "MD6 menawarkan panjang output berubah-ubah, yang boleh memberi kelebihan untuk aplikasi yang memerlukan saiz cincang tersuai. SHA-3 juga menyokong panjang keluaran berubah-ubah, walaupun varian yang paling biasa, SHAKE, memberikan lebih fleksibiliti dengan output panjang arbitrari.",
    "SHA3-NISTStandard-024": "Penyeragaman SHA-3"
}