{
    "CSS-Advantages-010": "¿Cuáles son las ventajas de usar CSS?",
    "CSS-Advantages-Customization-012": "Otra ventaja es su capacidad para personalizar la apariencia de varias páginas a la vez, ahorrando tiempo y esfuerzo al actualizar los estilos de todo el sitio.",
    "CSS-Advantages-Separation-011": "Una ventaja es la separación de preocupaciones entre contenido y presentación, lo que mejora la mantenibilidad y escalabilidad de los sitios web.",
    "CSS-Animations-Transitions-019": "Las animaciones y transiciones CSS permiten efectos visuales fluidos sin necesidad de JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) es un lenguaje de hojas de estilo que se utiliza para describir la presentación de un documento escrito en HTML o XML.",
    "CSS-Disadvantages-013": "¿Cuáles son algunas desventajas de CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Otro problema es la compatibilidad entre navegadores, ya que diferentes navegadores pueden interpretar las reglas CSS de manera diferente. Esto requiere que los desarrolladores utilicen prefijos de proveedores o técnicas de detección de funciones para una representación coherente en todos los navegadores.",
    "CSS-Disadvantages-Cascade-014": "Un desafío es gestionar la naturaleza en cascada de los estilos, que a veces puede generar problemas inesperados de herencia y especificidad.",
    "CSS-Evolution-006": "Desde entonces, ha evolucionado a través de CSS2 (1998), CSS2.1 (2007), CSS3 (desarrollo continuo), introduciendo características como selectores, animaciones, diseño responsivo y más.",
    "CSS-Future-020": "¿Cuál es el futuro de la tecnología CSS?",
    "CSS-Future-Houdini-022": "Houdini, por ejemplo, tiene como objetivo proporcionar API de bajo nivel para personalizar el proceso de renderizado del navegador, brindando a los desarrolladores un control sin precedentes sobre el estilo y el diseño.",
    "CSS-Future-Progress-021": "El grupo de trabajo de CSS continúa trabajando en nuevos módulos como variables CSS (propiedades personalizadas), Houdini y consultas de contenedor.",
    "CSS-Hist-Origin-005": "CSS fue propuesto por primera vez por Håkon Wium Lie en octubre de 1994 y se convirtió en una recomendación oficial del W3C en diciembre de 1996 con CSS1.",
    "CSS-History-004": "¿Cuál es la historia de CSS?",
    "CSS-History-W3C": "Cronología de recomendaciones CSS del W3C",
    "CSS-Key-Features-016": "¿Cuáles son algunas de las características clave de CSS?",
    "CSS-Layouts-018": "Los sistemas de diseño Flexbox y Grid proporcionan herramientas poderosas para crear diseños de página flexibles y responsivos.",
    "CSS-MDN-Animations": "Guía MDN para animaciones CSS",
    "CSS-MDN-Flexbox": "Guía MDN para Flexbox",
    "CSS-MDN-Grid": "Guía MDN para cuadrícula CSS",
    "CSS-MDN-Houdini": "MDN Introducción a Houdini",
    "CSS-Purpose-003": "Permite a los desarrolladores separar el contenido de la presentación, definiendo estilos como diseño, colores y fuentes, haciendo que las páginas web sean visualmente atractivas y consistentes en diferentes dispositivos y pantallas.",
    "CSS-Selectors-017": "Los selectores permiten apuntar a elementos HTML específicos según su tipo, clase, ID, atributos y más.",
    "CSS-Tech-History-001": "¿Qué es CSS?",
    "CSS-Usage-007": "¿Cómo uso CSS en mis proyectos web?",
    "CSS-Usage-Basics-008": "Para usar CSS, crea un archivo separado (por ejemplo, style.css) que contiene sus estilos y luego lo vincula a su archivo HTML usando el elemento <link> dentro de la sección <head>.",
    "CSS-Usage-Inline-009": "Alternativamente, puede incluir estilos en línea directamente en elementos HTML usando el atributo 'estilo' o incrustar CSS en la etiqueta <style> dentro de la sección <head>.",
    "CSS-Vendor-Prefixes": "Guía de MDN sobre prefijos de proveedores",
    "CSS-W3C-Selectors": "Especificaciones de nivel 4 de selectores W3C",
    "CSS-WG-Future-Modules": "Trabajo actual de CSS del W3C"
}