{
    "CSS-Advantages-010": "Quels sont les avantages de l’utilisation du CSS ?",
    "CSS-Advantages-Customization-012": "Un autre avantage est sa capacité à personnaliser l'apparence de plusieurs pages à la fois, ce qui permet d'économiser du temps et des efforts lors de la mise à jour des styles à l'échelle du site.",
    "CSS-Advantages-Separation-011": "L'un des avantages est la séparation des préoccupations entre le contenu et la présentation, ce qui améliore la maintenabilité et l'évolutivité des sites Web.",
    "CSS-Animations-Transitions-019": "Les animations et transitions CSS permettent des effets visuels fluides sans nécessiter JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) est un langage de feuille de style utilisé pour décrire la présentation d'un document écrit en HTML ou XML.",
    "CSS-Disadvantages-013": "Quels sont les inconvénients du CSS ?",
    "CSS-Disadvantages-Browser-Compat-015": "Un autre problème est la compatibilité entre navigateurs, car différents navigateurs peuvent interpréter différemment les règles CSS. Cela oblige les développeurs à utiliser des préfixes de fournisseur ou des techniques de détection de fonctionnalités pour un rendu cohérent sur tous les navigateurs.",
    "CSS-Disadvantages-Cascade-014": "L’un des défis consiste à gérer la nature en cascade des styles, qui peut parfois entraîner des problèmes inattendus d’héritage et de spécificité.",
    "CSS-Evolution-006": "Depuis lors, il a évolué via CSS2 (1998), CSS2.1 (2007), CSS3 (développement en cours), introduisant des fonctionnalités telles que des sélecteurs, des animations, un design réactif, etc.",
    "CSS-Future-020": "Quel est l’avenir de la technologie CSS ?",
    "CSS-Future-Houdini-022": "Houdini, par exemple, vise à fournir des API de bas niveau pour personnaliser le processus de rendu du navigateur, offrant ainsi aux développeurs un contrôle sans précédent sur le style et la mise en page.",
    "CSS-Future-Progress-021": "Le groupe de travail CSS continue de travailler sur de nouveaux modules tels que les variables CSS (propriétés personnalisées), Houdini et les requêtes de conteneur.",
    "CSS-Hist-Origin-005": "CSS a été proposé pour la première fois par Håkon Wium Lie en octobre 1994 et est devenu une recommandation officielle du W3C en décembre 1996 avec CSS1.",
    "CSS-History-004": "Quelle est l’histoire du CSS ?",
    "CSS-History-W3C": "Chronologie des recommandations CSS du W3C",
    "CSS-Key-Features-016": "Quelles sont les fonctionnalités clés de CSS ?",
    "CSS-Layouts-018": "Les systèmes de mise en page Flexbox et Grid fournissent des outils puissants pour créer des mises en page réactives et flexibles.",
    "CSS-MDN-Animations": "Guide MDN des animations CSS",
    "CSS-MDN-Flexbox": "Guide MDN de Flexbox",
    "CSS-MDN-Grid": "Guide MDN de la grille CSS",
    "CSS-MDN-Houdini": "MDN Introduction à Houdini",
    "CSS-Purpose-003": "Il permet aux développeurs de séparer le contenu de la présentation, en définissant des styles tels que la mise en page, les couleurs et les polices, rendant les pages Web visuellement attrayantes et cohérentes sur différents appareils et écrans.",
    "CSS-Selectors-017": "Les sélecteurs permettent de cibler des éléments HTML spécifiques en fonction de leur type, classe, ID, attributs, etc.",
    "CSS-Tech-History-001": "Qu’est-ce que CSS ?",
    "CSS-Usage-007": "Comment utiliser CSS dans mes projets web ?",
    "CSS-Usage-Basics-008": "Pour utiliser CSS, vous créez un fichier séparé (par exemple, style.css) contenant vos styles, puis vous le liez à votre fichier HTML à l'aide de l'élément <link> dans la section <head>.",
    "CSS-Usage-Inline-009": "Alternativement, vous pouvez inclure des styles en ligne directement dans les éléments HTML à l'aide de l'attribut « style » ou intégrer du CSS dans la balise <style> à l'intérieur de la section <head>.",
    "CSS-Vendor-Prefixes": "Guide MDN sur les préfixes des fournisseurs",
    "CSS-W3C-Selectors": "Spécifications des sélecteurs W3C niveau 4",
    "CSS-WG-Future-Modules": "Travaux actuels du W3C CSS"
}