{
    "CSS-Advantages-010": "Apa keuntungan menggunakan CSS?",
    "CSS-Advantages-Customization-012": "Keuntungan lainnya adalah kemampuannya untuk menyesuaikan tampilan dan nuansa beberapa halaman sekaligus, menghemat waktu dan tenaga saat memperbarui gaya seluruh situs.",
    "CSS-Advantages-Separation-011": "Salah satu keuntungannya adalah pemisahan perhatian antara konten dan presentasi, yang meningkatkan pemeliharaan dan skalabilitas situs web.",
    "CSS-Animations-Transitions-019": "Animasi dan Transisi CSS memungkinkan efek visual yang halus tanpa memerlukan JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) adalah bahasa stylesheet yang digunakan untuk mendeskripsikan presentasi dokumen yang ditulis dalam HTML atau XML.",
    "CSS-Disadvantages-013": "Apa saja kelemahan CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Masalah lainnya adalah kompatibilitas lintas-browser, karena browser yang berbeda mungkin menafsirkan aturan CSS secara berbeda. Hal ini mengharuskan pengembang untuk menggunakan awalan vendor atau teknik deteksi fitur untuk rendering yang konsisten di seluruh browser.",
    "CSS-Disadvantages-Cascade-014": "Salah satu tantangannya adalah mengelola sifat gaya yang berjenjang, yang terkadang dapat menyebabkan masalah pewarisan dan kekhususan yang tidak terduga.",
    "CSS-Evolution-006": "Sejak itu, ia telah berkembang melalui CSS2 (1998), CSS2.1 (2007), CSS3 (pengembangan berkelanjutan), memperkenalkan fitur-fitur seperti penyeleksi, animasi, desain responsif, dan banyak lagi.",
    "CSS-Future-020": "Bagaimana masa depan teknologi CSS?",
    "CSS-Future-Houdini-022": "Houdini, misalnya, bertujuan untuk menyediakan API tingkat rendah untuk menyesuaikan proses rendering browser, memberdayakan pengembang dengan kontrol yang belum pernah ada sebelumnya terhadap gaya dan tata letak.",
    "CSS-Future-Progress-021": "Kelompok Kerja CSS terus mengerjakan modul baru seperti Variabel CSS (Properti Khusus), Houdini, dan Kueri Kontainer.",
    "CSS-Hist-Origin-005": "CSS pertama kali diusulkan oleh Håkon Wium Lie pada bulan Oktober 1994 dan menjadi Rekomendasi resmi W3C pada bulan Desember 1996 dengan CSS1.",
    "CSS-History-004": "Bagaimana sejarah CSS?",
    "CSS-History-W3C": "Garis Waktu Rekomendasi CSS W3C",
    "CSS-Key-Features-016": "Apa sajakah fitur utama dalam CSS?",
    "CSS-Layouts-018": "Sistem tata letak Flexbox dan Grid menyediakan alat canggih untuk membuat tata letak halaman yang responsif dan fleksibel.",
    "CSS-MDN-Animations": "Panduan MDN untuk Animasi CSS",
    "CSS-MDN-Flexbox": "Panduan MDN untuk Flexbox",
    "CSS-MDN-Grid": "Panduan MDN untuk CSS Grid",
    "CSS-MDN-Houdini": "Pengantar MDN tentang Houdini",
    "CSS-Purpose-003": "Hal ini memungkinkan pengembang untuk memisahkan konten dari presentasi, menentukan gaya seperti tata letak, warna, dan font, membuat halaman web menarik secara visual dan konsisten di berbagai perangkat dan layar.",
    "CSS-Selectors-017": "Penyeleksi memungkinkan penargetan elemen HTML tertentu berdasarkan jenis, kelas, ID, atribut, dan lainnya.",
    "CSS-Tech-History-001": "Apa itu CSS?",
    "CSS-Usage-007": "Bagaimana cara menggunakan CSS dalam proyek web saya?",
    "CSS-Usage-Basics-008": "Untuk menggunakan CSS, Anda membuat file terpisah (misalnya, style.css) yang berisi gaya Anda, lalu menautkannya ke file HTML menggunakan elemen <link> di bagian <head>.",
    "CSS-Usage-Inline-009": "Alternatifnya, Anda dapat memasukkan gaya sebaris langsung ke dalam elemen HTML menggunakan atribut 'style' atau menyematkan CSS di tag <style> di dalam bagian <head>.",
    "CSS-Vendor-Prefixes": "Panduan MDN tentang Awalan Vendor",
    "CSS-W3C-Selectors": "Spesifikasi W3C Selector Level 4",
    "CSS-WG-Future-Modules": "W3C CSS Pekerjaan Saat Ini"
}