{
    "CSS-Advantages-010": "Apakah kelebihan menggunakan CSS?",
    "CSS-Advantages-Customization-012": "Kelebihan lain ialah keupayaannya untuk menyesuaikan rupa dan rasa berbilang halaman sekaligus, menjimatkan masa dan usaha semasa mengemas kini gaya seluruh tapak.",
    "CSS-Advantages-Separation-011": "Satu kelebihan ialah pengasingan kebimbangan antara kandungan dan persembahan, yang meningkatkan kebolehselenggaraan dan kebolehskalaan tapak web.",
    "CSS-Animations-Transitions-019": "Animasi dan Peralihan CSS membolehkan kesan visual yang lancar tanpa memerlukan JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) ialah bahasa lembaran gaya yang digunakan untuk menerangkan pembentangan dokumen yang ditulis dalam HTML atau XML.",
    "CSS-Disadvantages-013": "Apakah beberapa kelemahan CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Isu lain ialah keserasian merentas pelayar, kerana penyemak imbas yang berbeza mungkin mentafsir peraturan CSS secara berbeza. Ini memerlukan pembangun menggunakan awalan vendor atau teknik pengesanan ciri untuk pemaparan yang konsisten merentas penyemak imbas.",
    "CSS-Disadvantages-Cascade-014": "Satu cabaran ialah mengurus sifat gaya yang melata, yang kadangkala boleh membawa kepada isu pewarisan dan kekhususan yang tidak dijangka.",
    "CSS-Evolution-006": "Sejak itu, ia telah berkembang melalui CSS2 (1998), CSS2.1 (2007), CSS3 (pembangunan berterusan), memperkenalkan ciri seperti pemilih, animasi, reka bentuk responsif dan banyak lagi.",
    "CSS-Future-020": "Apakah masa depan teknologi CSS?",
    "CSS-Future-Houdini-022": "Houdini, misalnya, bertujuan untuk menyediakan API peringkat rendah untuk menyesuaikan proses pemaparan penyemak imbas, memperkasakan pembangun dengan kawalan yang tidak pernah berlaku sebelum ini ke atas penggayaan dan reka letak.",
    "CSS-Future-Progress-021": "Kumpulan Kerja CSS terus mengusahakan modul baharu seperti Pembolehubah CSS (Sifat Tersuai), Houdini dan Pertanyaan Kontainer.",
    "CSS-Hist-Origin-005": "CSS pertama kali dicadangkan oleh Håkon Wium Lie pada Oktober 1994 dan menjadi Pengesyoran W3C rasmi pada Disember 1996 dengan CSS1.",
    "CSS-History-004": "Apakah sejarah CSS?",
    "CSS-History-W3C": "Garis Masa Syor W3C CSS",
    "CSS-Key-Features-016": "Apakah beberapa ciri utama dalam CSS?",
    "CSS-Layouts-018": "Sistem susun atur Flexbox dan Grid menyediakan alatan berkuasa untuk mencipta reka letak halaman yang responsif dan fleksibel.",
    "CSS-MDN-Animations": "Panduan MDN untuk Animasi CSS",
    "CSS-MDN-Flexbox": "Panduan MDN untuk Flexbox",
    "CSS-MDN-Grid": "Panduan MDN untuk Grid CSS",
    "CSS-MDN-Houdini": "MDN Pengenalan kepada Houdini",
    "CSS-Purpose-003": "Ia membolehkan pembangun mengasingkan kandungan daripada pembentangan, mentakrifkan gaya seperti reka letak, warna dan fon, menjadikan halaman web menarik secara visual dan konsisten merentas peranti dan skrin yang berbeza.",
    "CSS-Selectors-017": "Pemilih membenarkan penyasaran elemen HTML tertentu berdasarkan jenis, kelas, ID, atribut dan banyak lagi.",
    "CSS-Tech-History-001": "Apakah CSS?",
    "CSS-Usage-007": "Bagaimanakah cara saya menggunakan CSS dalam projek web saya?",
    "CSS-Usage-Basics-008": "Untuk menggunakan CSS, anda membuat fail berasingan (cth., style.css) yang mengandungi gaya anda, kemudian memautkannya ke fail HTML anda menggunakan elemen <link> dalam bahagian <head>.",
    "CSS-Usage-Inline-009": "Sebagai alternatif, anda boleh memasukkan gaya sebaris terus dalam elemen HTML menggunakan atribut 'gaya' atau benamkan CSS dalam teg <style> di dalam bahagian <head>.",
    "CSS-Vendor-Prefixes": "Panduan MDN tentang Awalan Vendor",
    "CSS-W3C-Selectors": "Spesifikasi Pemilih W3C Tahap 4",
    "CSS-WG-Future-Modules": "Kerja Semasa W3C CSS"
}