{
    "MySQL-Performance-Tuning": "Mẹo điều chỉnh hiệu suất MySQL",
    "OWASP-SQL-Injection": "Hướng dẫn tiêm SQL OWASP",
    "SQL-Basics-001": "SQL là gì?",
    "SQL-Beautifier-Example": "Trình định dạng SQL trực tuyến",
    "SQL-Beautify-006": "Làm đẹp SQL là gì?",
    "SQL-Beautify-Def-007": "Làm đẹp SQL là quá trình định dạng mã SQL để cải thiện khả năng đọc bằng cách áp dụng các quy ước thụt lề, giãn cách và viết hoa nhất quán.",
    "SQL-Beautify-Purpose-008": "Cũng giống như các công cụ làm đẹp mã chung, nó giúp các nhà phát triển hiểu các truy vấn phức tạp dễ dàng hơn và duy trì tính nhất quán trên các tập lệnh hoặc dự án SQL của họ.",
    "SQL-Commands-005": "SQL bao gồm một số loại lệnh: DDL (Ngôn ngữ định nghĩa dữ liệu - CREATE, ALTER, DROP), DML (Ngôn ngữ thao tác dữ liệu - SELECT, INSERT, UPDATE, DELETE) và DCL (Ngôn ngữ điều khiển dữ liệu - GRANT, REVOKE).",
    "SQL-Components-004": "Các thành phần chính của SQL là gì?",
    "SQL-Components-Wikipedia": "Thành phần SQL trên Wikipedia",
    "SQL-Def-002": "SQL (Ngôn ngữ truy vấn có cấu trúc) là ngôn ngữ lập trình tiêu chuẩn để quản lý và truy vấn cơ sở dữ liệu quan hệ.",
    "SQL-Indexing-016": "Chỉ mục trong SQL là gì và tại sao chúng quan trọng?",
    "SQL-Indexing-Benefit-018": "Việc tạo chỉ mục trên các cột được sử dụng thường xuyên cho các điều kiện của mệnh đề WHERE sẽ tăng tốc đáng kể các truy vấn CHỌN nhưng có thể làm chậm các hoạt động CHÈN, CẬP NHẬT và XÓA do nhu cầu duy trì cấu trúc chỉ mục.",
    "SQL-Indexing-Explanation-017": "Chỉ mục là cấu trúc dữ liệu (ví dụ: cây B) giúp cải thiện tốc độ hoạt động truy xuất dữ liệu trong bảng bằng cách cho phép công cụ cơ sở dữ liệu nhanh chóng xác định vị trí các hàng dựa trên các giá trị cột cụ thể.",
    "SQL-Indexing-MDN": "Tài liệu web MDN về chỉ mục",
    "SQL-Injection-019": "SQL Tiêm là gì và làm cách nào để ngăn chặn nó?",
    "SQL-Injection-Def-020": "SQL Tiêm là một lỗ hổng bảo mật trong đó kẻ tấn công có thể chèn mã SQL độc hại vào các trường đầu vào để thao tác hoặc trích xuất dữ liệu từ cơ sở dữ liệu.",
    "SQL-Injection-Prevention-021": "Các phương pháp ngăn ngừa bao gồm sử dụng các truy vấn được tham số hóa, câu lệnh đã chuẩn bị sẵn hoặc thư viện ORM tự động thoát khỏi dữ liệu đầu vào của người dùng, cũng như hạn chế quyền cơ sở dữ liệu và áp dụng các nguyên tắc đặc quyền tối thiểu.",
    "SQL-Joins-011": "THAM GIA trong SQL là gì?",
    "SQL-Joins-Explanation-012": "THAM GIA được sử dụng để kết hợp các hàng từ hai hoặc nhiều bảng dựa trên một cột có liên quan giữa chúng. Ví dụ: INNER JOIN, LEFT JOIN, RIGHT JOIN và FULL JOIN.",
    "SQL-Joins-Tutorial": "Hướng dẫn tham gia SQL",
    "SQL-Perf-Tuning-Methods-024": "Các kỹ thuật khác bao gồm phân vùng các bảng lớn, sử dụng các kiểu dữ liệu thích hợp và lưu kết quả vào bộ đệm khi khả thi.",
    "SQL-Perf-Tuning-Overview-023": "Tối ưu hóa hiệu suất truy vấn SQL bao gồm việc phân tích các kế hoạch thực hiện, lập chỉ mục phù hợp, giảm thiểu các phép nối và truy vấn con không cần thiết cũng như viết các mệnh đề WHERE hiệu quả.",
    "SQL-Performance-Tuning-022": "Làm cách nào để tối ưu hóa hiệu suất truy vấn SQL?",
    "SQL-Purpose-003": "Nó được sử dụng để tạo, đọc, cập nhật, xóa và truy vấn dữ liệu trong bảng cũng như quản lý cấu trúc và quyền của cơ sở dữ liệu.",
    "SQL-Select-009": "Làm cách nào để viết câu lệnh CHỌN cơ bản?",
    "SQL-Select-Example-0210": "Một câu lệnh SELECT đơn giản lấy dữ liệu từ một bảng. Ví dụ: {0}', 'CHỌN cột1, cột2 TỪ my_table;",
    "SQL-Transactions-013": "Giao dịch trong SQL là gì?",
    "SQL-Transactions-Def-014": "Giao dịch là một đơn vị công việc logic chứa một hoặc nhiều câu lệnh SQL. Nó đảm bảo rằng tất cả các hoạt động bên trong nó được hoàn thành thành công (tính nguyên tử), tách biệt với các giao dịch khác và bền vững ngay cả trong trường hợp hệ thống bị lỗi.",
    "SQL-Transactions-Example-015": "Để bắt đầu giao dịch, hãy sử dụng lệnh BẮT ĐẦU GIAO DỊCH; cam kết các thay đổi bằng COMMIT hoặc quay trở lại trạng thái trước đó bằng ROLLBACK.",
    "SQL-Transactions-W3Schools": "Giao dịch SQL trên W3Schools"
}