{
    "123e4567": "¿Qué es Base64?",
    "1a2b3c4d": "¿Por qué utilizar Base64?",
    "23fgh456": "Historia de Base64",
    "2bcde3fg": "Desventajas de Base64",
    "34wxyz56": "¿Cómo codificar/decodificar Base64 en JavaScript?",
    "4hijk5lm": "Aumento de tamaño: los datos codificados son aproximadamente un 33% más grandes que los datos binarios originales.",
    "5e6f7g8h": "Base64 se utiliza cuando es necesario transmitir datos binarios a través de protocolos basados ​​en texto como correo electrónico o JSON, o incrustarlos en lugares donde solo se permite texto.",
    "6nopqrst": "Sin cifrado: Base64 no es un método de cifrado; se decodifica fácilmente y no proporciona seguridad.",
    "78abcdef": "JavaScript ofrece funciones integradas como btoa() y atob() para codificación y decodificación Base64 respectivamente.",
    "78ijk9lm": "Base64 se definió por primera vez en RFC 1421 (1993) y luego se estandarizó en RFC 4648 (2006).",
    "9i0j1k2l": "También se utiliza para incrustar imágenes pequeñas directamente en HTML o CSS como URL de datos.",
    "ab9c0d1e": "Las operaciones principales incluyen codificación (convertir binario a Base64) y decodificación (convertir Base64 nuevamente a binario).",
    "abc12345": "Base64 es un esquema de codificación que representa datos binarios como una secuencia de caracteres ASCII.",
    "abcdef12": "¿Cómo funciona Base64?",
    "bcdef01a": "Base64 funciona dividiendo datos binarios en grupos de 6 bits y asignando cada grupo a un carácter específico de un alfabeto de 64 caracteres (A-Za-z0-9+/).",
    "cbaq54321": "No, Base64 no es una técnica de compresión, solo cambia la representación de los datos, no su tamaño.",
    "cdefg234": "Se agregan caracteres de relleno (=) al final para garantizar que la longitud de los datos codificados sea un múltiplo de 4 caracteres.",
    "efg45678": "Comparación con Base32",
    "efghi678": "Esta variante se utiliza a menudo para nombres de archivos, URL o situaciones en las que se deben evitar los caracteres especiales.",
    "fghi6789": "Se utiliza para transmitir o almacenar archivos binarios en formatos basados ​​en texto, lo que garantiza la compatibilidad entre varios sistemas.",
    "hij90klm": "Base32 utiliza un alfabeto más pequeño (A-Z2-7), lo que da como resultado cadenas más largas pero más legibles para los humanos.",
    "mno34567": "Ventajas de Base64",
    "mnoijklm": "¿Existen otras codificaciones BaseXX?",
    "n0pqrstu": "Ejemplo de uso de Base64",
    "nopqrs01": "Si bien Base64 optimiza la compacidad, se elige Base32 cuando minimizar los errores de entrada, como la entrada manual, es crucial.",
    "pqrs890t": "Compatibilidad universal: Base64 es ampliamente reconocido y compatible con todos los principales lenguajes de programación.",
    "qrstuvwx": "Sí, además de Base64 y Base32, también existen Base16 (Hexadecimal), Base58 y Base85, cada una diseñada para diferentes escenarios.",
    "tuv23456": "Variante segura de URL Base64",
    "u7vwx8yz": "Operaciones comunes de Base64",
    "uvwxyza1": "Sin pérdida de datos: dado que es un proceso reversible, la codificación Base64 no produce ninguna pérdida de información.",
    "vwx1yza2": "Un ejemplo es codificar un archivo de imagen para incrustarlo en una etiqueta HTML <img>:",
    "wxyzabcd": "Existe una versión segura para URL de Base64 que reemplaza '+' por '-' y '/' por '_', y omite el relleno '=', lo que la hace adecuada para URL web.",
    "zyx98765": "¿Se puede utilizar Base64 para compresión?"
}