{
    "123e4567": "Mikä on Base64?",
    "1a2b3c4d": "Miksi käyttää Base64:ää?",
    "23fgh456": "Base64:n historia",
    "2bcde3fg": "Base64:n haitat",
    "34wxyz56": "Kuinka koodata / purkaa Base64 JavaScriptissä?",
    "4hijk5lm": "Koon lisäys: Koodattu data on noin 33 % suurempi kuin alkuperäinen binääridata.",
    "5e6f7g8h": "Base64:ää käytetään, kun binaaridataa on siirrettävä tekstipohjaisten protokollien, kuten sähköpostin tai JSONin, kautta tai upotettava paikkoihin, joissa vain teksti on sallittu.",
    "6nopqrst": "Ei salausta: Base64 ei ole salausmenetelmä; se on helppo purkaa, eikä se tarjoa turvaa.",
    "78abcdef": "JavaScript tarjoaa sisäänrakennettuja toimintoja, kuten btoa() ja atob() Base64-koodaukseen ja vastaavasti dekoodaukseen.",
    "78ijk9lm": "Base64 määriteltiin ensin RFC 1421:ssä (1993) ja standardisoitiin myöhemmin RFC 4648:ssa (2006).",
    "9i0j1k2l": "Sitä käytetään myös pienten kuvien upottamiseen suoraan HTML- tai CSS-muotoon data-URL-osoitteina.",
    "ab9c0d1e": "Ensisijaisiin toimintoihin kuuluvat koodaus (binäärin muuntaminen Base64:ksi) ja dekoodaus (Base64:n muuntaminen takaisin binääriksi).",
    "abc12345": "Base64 on koodausmalli, joka esittää binääridataa ASCII-merkkijonona.",
    "abcdef12": "Miten Base64 toimii?",
    "bcdef01a": "Base64 toimii jakamalla binaaridatan 6-bittisiin ryhmiin ja yhdistämällä kunkin ryhmän tiettyyn 64 merkin aakkosesta (A-Za-z0-9+/) olevaan tiettyyn merkkiin.",
    "cbaq54321": "Ei, Base64 ei ole pakkaustekniikka, se muuttaa vain tiedon esitystapaa, ei sen kokoa.",
    "cdefg234": "Täytemerkit (=) lisätään loppuun sen varmistamiseksi, että koodatun datan pituus on 4 merkin kerrannainen.",
    "efg45678": "Vertailu Base32:een",
    "efghi678": "Tätä muunnelmaa käytetään usein tiedostonimille, URL-osoitteille tai tilanteisiin, joissa erikoismerkkejä on vältettävä.",
    "fghi6789": "Sitä käytetään binääritiedostojen lähettämiseen tai tallentamiseen tekstipohjaisissa muodoissa, mikä varmistaa yhteensopivuuden eri järjestelmien välillä.",
    "hij90klm": "Base32 käyttää pienempiä aakkosia (A-Z2-7), mikä johtaa pidempiin, mutta ihmisten luettavissa oleviin merkkijonoihin.",
    "mno34567": "Base64:n edut",
    "mnoijklm": "Onko muita BaseXX-koodauksia?",
    "n0pqrstu": "Esimerkki Base64:n käytöstä",
    "nopqrs01": "Vaikka Base64 optimoi kompaktiuden, Base32 valitaan, kun syöttövirheiden minimoiminen, kuten manuaalinen syöttäminen, on ratkaisevan tärkeää.",
    "pqrs890t": "Universaali yhteensopivuus: Base64 on laajalti tunnustettu ja tuettu kaikilla tärkeimmillä ohjelmointikielillä.",
    "qrstuvwx": "Kyllä, Base64:n ja Base32:n lisäksi on myös Base16 (heksadesimaali), Base58 ja Base85, jotka on suunniteltu eri skenaarioihin.",
    "tuv23456": "Base64 URL turvallinen variantti",
    "u7vwx8yz": "Yleiset Base64-toiminnot",
    "uvwxyza1": "Ei tietojen häviämistä: Koska Base64-koodaus on palautuva prosessi, se ei aiheuta tiedon menetystä.",
    "vwx1yza2": "Esimerkki on kuvatiedoston koodaus sen upottamiseksi HTML <img> -tunnisteeseen:",
    "wxyzabcd": "Base64:stä on URL-suojattu versio, joka korvaa merkin '+':lla '-' ja '/':llä '_', ja jättää pois täytön '=', joten se sopii verkko-URL-osoitteisiin.",
    "zyx98765": "Voidaanko Base64:ää käyttää pakkaamiseen?"
}