{
    "123e4567": "Base64 คืออะไร?",
    "1a2b3c4d": "ทำไมต้องใช้ Base64?",
    "23fgh456": "ประวัติความเป็นมาของ Base64",
    "2bcde3fg": "ข้อเสียของ Base64",
    "34wxyz56": "จะเข้ารหัส / ถอดรหัส Base64 ใน JavaScript ได้อย่างไร",
    "4hijk5lm": "การเพิ่มขนาด: ข้อมูลที่เข้ารหัสมีขนาดใหญ่กว่าข้อมูลไบนารีดั้งเดิมประมาณ 33%",
    "5e6f7g8h": "Base64 ถูกใช้เมื่อจำเป็นต้องส่งข้อมูลไบนารีผ่านโปรโตคอลแบบข้อความ เช่น อีเมลหรือ JSON หรือฝังไว้ในตำแหน่งที่อนุญาตเฉพาะข้อความเท่านั้น",
    "6nopqrst": "ไม่มีการเข้ารหัส: Base64 ไม่ใช่วิธีการเข้ารหัส ถอดรหัสได้ง่ายและไม่มีความปลอดภัย",
    "78abcdef": "JavaScript มีฟังก์ชันในตัว เช่น btoa() และ atob() สำหรับการเข้ารหัสและถอดรหัส Base64 ตามลำดับ",
    "78ijk9lm": "Base64 ถูกกำหนดครั้งแรกใน RFC 1421 (1993) และต่อมาเป็นมาตรฐานใน RFC 4648 (2006)",
    "9i0j1k2l": "นอกจากนี้ยังใช้สำหรับการฝังรูปภาพขนาดเล็กลงใน HTML หรือ CSS โดยตรงเป็น URL ข้อมูล",
    "ab9c0d1e": "การดำเนินการหลัก ได้แก่ การเข้ารหัส (การแปลงไบนารีเป็น Base64) และการถอดรหัส (การแปลง Base64 กลับเป็นไบนารี)",
    "abc12345": "Base64 เป็นรูปแบบการเข้ารหัสที่แสดงข้อมูลไบนารีเป็นลำดับของอักขระ ASCII",
    "abcdef12": "Base64 ทำงานอย่างไร?",
    "bcdef01a": "Base64 ทำงานโดยการแบ่งข้อมูลไบนารีออกเป็นกลุ่มๆ 6 บิต และแมปแต่ละกลุ่มกับอักขระเฉพาะจากตัวอักษร 64 ตัว (A-Za-z0-9+/)",
    "cbaq54321": "ไม่ Base64 ไม่ใช่เทคนิคการบีบอัด เพียงแต่เปลี่ยนการแสดงข้อมูล ไม่ใช่ขนาดของมัน",
    "cdefg234": "อักขระเสริม (=) จะถูกเพิ่มที่ส่วนท้ายเพื่อให้แน่ใจว่าความยาวของข้อมูลที่เข้ารหัสเป็นจำนวนทวีคูณของ 4 อักขระ",
    "efg45678": "เปรียบเทียบกับ Base32",
    "efghi678": "รูปแบบนี้มักใช้กับชื่อไฟล์ URL หรือสถานการณ์ที่ต้องหลีกเลี่ยงอักขระพิเศษ",
    "fghi6789": "ใช้ในการส่งหรือจัดเก็บไฟล์ไบนารี่ในรูปแบบข้อความ เพื่อให้มั่นใจถึงความเข้ากันได้ในระบบต่างๆ",
    "hij90klm": "Base32 ใช้ตัวอักษรที่มีขนาดเล็กกว่า (A-Z2-7) ส่งผลให้สตริงยาวขึ้นแต่มนุษย์สามารถอ่านได้มากขึ้น",
    "mno34567": "ข้อดีของ Base64",
    "mnoijklm": "มีการเข้ารหัส BaseXX อื่น ๆ หรือไม่",
    "n0pqrstu": "ตัวอย่างการใช้งาน Base64",
    "nopqrs01": "แม้ว่า Base64 จะปรับให้เหมาะสมกับความกะทัดรัด แต่ Base32 จะถูกเลือกเมื่อลดข้อผิดพลาดในการป้อนข้อมูลให้เหลือน้อยที่สุด เช่น การป้อนข้อมูลด้วยตนเอง ซึ่งถือเป็นสิ่งสำคัญ",
    "pqrs890t": "ความเข้ากันได้สากล: Base64 ได้รับการยอมรับและรองรับอย่างกว้างขวางในภาษาการเขียนโปรแกรมหลักๆ ทั้งหมด",
    "qrstuvwx": "ใช่ นอกเหนือจาก Base64 และ Base32 แล้ว ยังมี Base16 (เลขฐานสิบหก), Base58 และ Base85 ซึ่งแต่ละประเภทได้รับการออกแบบมาสำหรับสถานการณ์ที่แตกต่างกัน",
    "tuv23456": "รูปแบบที่ปลอดภัยของ URL Base64",
    "u7vwx8yz": "การดำเนินการ Base64 ทั่วไป",
    "uvwxyza1": "ไม่มีการสูญเสียข้อมูล: เนื่องจากเป็นกระบวนการที่สามารถย้อนกลับได้ การเข้ารหัส Base64 จึงไม่ส่งผลให้ข้อมูลสูญหาย",
    "vwx1yza2": "ตัวอย่างคือการเข้ารหัสไฟล์รูปภาพเพื่อฝังไว้ในแท็ก HTML <img>:",
    "wxyzabcd": "มี Base64 เวอร์ชันที่ปลอดภัยสำหรับ URL ซึ่งแทนที่ '+' ด้วย '-' และ '/' ด้วย '_' และละเว้นช่องว่างภายใน '=' ทำให้เหมาะสำหรับ URL ของเว็บ",
    "zyx98765": "Base64 สามารถใช้สำหรับการบีบอัดได้หรือไม่?"
}