{
    "123e4567": "Base64 là gì?",
    "1a2b3c4d": "Tại sao nên sử dụng Base64?",
    "23fgh456": "Lịch sử của Base64",
    "2bcde3fg": "Nhược điểm của Base64",
    "34wxyz56": "Làm cách nào để mã hóa/giải mã Base64 trong JavaScript?",
    "4hijk5lm": "Tăng kích thước: Dữ liệu được mã hóa lớn hơn khoảng 33% so với dữ liệu nhị phân ban đầu.",
    "5e6f7g8h": "Base64 được sử dụng khi dữ liệu nhị phân cần được truyền qua các giao thức dựa trên văn bản như email hoặc JSON hoặc được nhúng ở những nơi chỉ cho phép văn bản.",
    "6nopqrst": "Không mã hóa: Base64 không phải là phương thức mã hóa; nó dễ dàng được giải mã và không cung cấp bảo mật.",
    "78abcdef": "JavaScript cung cấp các hàm tích hợp sẵn như btoa() và atob() để mã hóa và giải mã Base64 tương ứng.",
    "78ijk9lm": "Base64 lần đầu tiên được định nghĩa trong RFC 1421 (1993) và sau đó được chuẩn hóa trong RFC 4648 (2006).",
    "9i0j1k2l": "Nó cũng được sử dụng để nhúng các hình ảnh nhỏ trực tiếp vào HTML hoặc CSS dưới dạng URL dữ liệu.",
    "ab9c0d1e": "Các hoạt động chính bao gồm mã hóa (chuyển đổi nhị phân sang Base64) và giải mã (chuyển đổi Base64 trở lại nhị phân).",
    "abc12345": "Base64 là sơ đồ mã hóa biểu diễn dữ liệu nhị phân dưới dạng một chuỗi các ký tự ASCII.",
    "abcdef12": "Base64 hoạt động như thế nào?",
    "bcdef01a": "Base64 hoạt động bằng cách chia dữ liệu nhị phân thành các nhóm 6 bit và ánh xạ mỗi nhóm tới một ký tự cụ thể từ bảng chữ cái gồm 64 ký tự (A-Za-z0-9+/).",
    "cbaq54321": "Không, Base64 không phải là một kỹ thuật nén, nó chỉ thay đổi cách biểu diễn dữ liệu chứ không thay đổi kích thước của nó.",
    "cdefg234": "Các ký tự đệm (=) được thêm vào cuối để đảm bảo độ dài dữ liệu được mã hóa là bội số của 4 ký tự.",
    "efg45678": "So sánh với Base32",
    "efghi678": "Biến thể này thường được sử dụng cho tên tệp, URL hoặc các tình huống phải tránh các ký tự đặc biệt.",
    "fghi6789": "Nó được sử dụng để truyền hoặc lưu trữ các tệp nhị phân ở định dạng dựa trên văn bản, đảm bảo khả năng tương thích trên nhiều hệ thống khác nhau.",
    "hij90klm": "Base32 sử dụng bảng chữ cái nhỏ hơn (A-Z2-7), dẫn đến các chuỗi dài hơn nhưng dễ đọc hơn.",
    "mno34567": "Ưu điểm của Base64",
    "mnoijklm": "Có mã hóa BaseXX nào khác không?",
    "n0pqrstu": "Ví dụ sử dụng Base64",
    "nopqrs01": "Trong khi Base64 tối ưu hóa để thu gọn thì Base32 được chọn khi việc giảm thiểu các lỗi đầu vào, chẳng hạn như nhập thủ công, là rất quan trọng.",
    "pqrs890t": "Khả năng tương thích toàn cầu: Base64 được công nhận và hỗ trợ rộng rãi trong tất cả các ngôn ngữ lập trình chính.",
    "qrstuvwx": "Có, ngoài Base64 và Base32, còn có Base16 (Thập lục phân), Base58 và Base85, mỗi loại được thiết kế cho các tình huống khác nhau.",
    "tuv23456": "Biến thể an toàn URL Base64",
    "u7vwx8yz": "Hoạt động Base64 phổ biến",
    "uvwxyza1": "Không mất dữ liệu: Vì đây là quy trình có thể đảo ngược nên mã hóa Base64 không dẫn đến bất kỳ mất mát thông tin nào.",
    "vwx1yza2": "Một ví dụ là mã hóa một tệp hình ảnh để nhúng nó vào thẻ HTML <img>:",
    "wxyzabcd": "Có một phiên bản Base64 an toàn cho URL thay thế '+' bằng '-' và '/' bằng '_', đồng thời bỏ qua phần đệm '=', làm cho phiên bản này phù hợp với URL web.",
    "zyx98765": "Base64 có thể được sử dụng để nén không?"
}