{
    "15424": "Esse é todo o problema da ciência. Você tem um bando de empiristas tentando descrever coisas de maravilhas inimagináveis. –Bill Watterson",
    "15999": "Inovação é o processo de fazer mudanças em algo estabelecido. -Equipe de definição de inovação",
    "16987": "Às vezes vale a pena ficar na cama na segunda-feira, em vez de passar o resto da semana depurando o código de segunda-feira. –Dan Salomão",
    "19775": "A ciência é um modo de vida. É uma perspectiva. A ciência é o processo que nos leva da confusão à compreensão de uma forma precisa, preditiva e fiável – uma transformação, para aqueles que têm a sorte de a experimentar, que é fortalecedora e emocional. -Brian Greene",
    "38127": "Teste é o processo de tentar quebrar o código – Anônimo",
    "42641": "O desenvolvimento da Web é difícil, só que é divertido de fazer. Você apenas precisa definir seus padrões. Se fosse fácil, alguém faria isso? - Olawale Daniel",
    "46367": "A inovação é a chave para desbloquear o potencial de crescimento. -Omar Ishrak",
    "57225": "A inovação é a força vital de um negócio próspero. -Michael Dell",
    "63470": "Um verdadeiro cientista resolve problemas, não lamenta que sejam insolúveis. –Anne McCaffrey",
    "66187": "Falar é fácil. Mostre-me o código. - Linus Torvalds",
    "68518": "Software e catedrais são praticamente a mesma coisa – primeiro nós os construímos, depois oramos.",
    "77528": "A inovação é a força motriz do progresso. -John F. Kennedy",
    "80972": "É claro que códigos incorretos podem ser eliminados. Mas é muito caro. -Robert C. Martin",
    "85805": "Um especialista é uma pessoa que cometeu todos os erros que podem ser cometidos em uma área muito restrita. – Neils Bohr",
    "92941": "Existe poesia real no mundo real. A ciência é a poesia da realidade. - Richard dawkins",
    "-wHWkv2OC": "Por que não consigo fazer login?",
    "-wdkeq": "Esta comunidade não tem fins lucrativos?",
    "00d36": "A melhor maneira de prever o futuro é inventá-lo. -Alan Kay",
    "09m6vG51A": "em desenvolvimento",
    "0a310": "Não existe um caminho real para a ciência, e apenas aqueles que não temem a subida cansativa dos seus caminhos íngremes têm a oportunidade de alcançar os seus cumes luminosos. - Karl Marx",
    "0a710": "A inovação é a força vital de qualquer organização. -Dr. RL Bhatia",
    "0ba15": "A inovação bem-sucedida exige assumir riscos calculados. -Harvard Pruden",
    "0e299": "Tudo é teoricamente impossível até que seja feito. –Robert A. Heinlein",
    "114ee": "A codificação como a poesia deve ser curta e concisa. - Santosh Kalwar",
    "13pmE": "Apoie-nos",
    "149c0": "Em questões de ciência, a autoridade de mil não vale o raciocínio humilde de um único indivíduo. – Galileu Galilei",
    "1883d": "A ciência é muito mais estimulante para a imaginação do que os clássicos. – JBS Haldane",
    "188cd": "A programação é aprendida escrevendo programas. -Brian Kernighan",
    "18f46": "Foguetes são legais. Não há como evitar isso. -Elon Musk",
    "1a8b9": "O cientista não é uma pessoa que dá as respostas certas, é alguém que faz as perguntas certas. – Claude Lévi-Strauss",
    "1d71a": "Nascemos num determinado momento, num determinado local, e tal como os anos de colheita do vinho, temos as qualidades do ano e da estação em que nascemos. A astrologia não reivindica mais nada. –Carl Jung",
    "1da5a": "A inovação é a base do progresso e do sucesso no mundo empresarial moderno. -Larry Página",
    "1ff27": "Ciência é o que entendemos bem o suficiente para ser explicado a um computador; arte é todo o resto. -Donald E. Knuth",
    "22f3a": "A inovação é a questão central da prosperidade económica. –Michael Porter",
    "23f61": "A inovação não consiste apenas em ter uma boa ideia; trata-se de tornar essa ideia uma realidade. -Erik Qualman",
    "277a9": "A ciência não pode resolver o mistério final da natureza. E isso porque, em última análise, nós próprios fazemos parte do mistério que tentamos resolver. - Max Planck",
    "27ef9": "Inovação é a capacidade de converter ideias em faturas. -EU. Duncan",
    "2S_7EVIsK": "Validador JSON",
    "2b7f7": "Tenho certeza de que o universo está cheio de vida inteligente. Foi muito inteligente vir aqui. -Arthur C. Clarke",
    "321e0": "A depuração é duas vezes mais difícil do que escrever o código. Portanto, se você escrever o código da maneira mais inteligente possível, você não será, por definição, inteligente o suficiente para depurá-lo - Brian W. Kernighan",
    "32c8d": "Se a depuração é o processo de remoção de bugs, então a programação deve ser o processo de colocá-los. – Sam Redwine",
    "33aa4": "A ciência é apenas puro empirismo e, em virtude do seu método, exclui a metafísica. –Steve Martin",
    "380da": "A programação hoje é uma corrida entre engenheiros de software que se esforçam para construir programas maiores e melhores à prova de idiotas e o Universo que tenta produzir idiotas maiores e melhores. Até agora, o Universo está vencendo. -Rick Cook",
    "394b6": "Se você pensasse que a ciência era certa? bem, isso é apenas um erro de sua parte. -Richard Feynman",
    "398cc": "Os programadores parecem estar mudando o mundo. Seria um alívio, para eles e para todos nós, se soubessem algo sobre isso. –Ellen Ullman",
    "3I-dkqkwr": "Observe que NÃO oferecemos nenhum curso comercial de treinamento para exames de inglês ou quaisquer outros exames de disciplinas neste site, e não planejamos fazê-lo no futuro.",
    "3d297": "O que adoro na ciência é que, à medida que você aprende, você realmente não obtém respostas. Você apenas recebe perguntas melhores. -John Verde",
    "40b7f": "A inovação é a única maneira de vencer no longo prazo. -Jeff Immelt",
    "420b0": "A inovação bem-sucedida requer um compromisso com a colaboração e a comunicação aberta. -Rachel D. Ellison",
    "43be5": "Diário",
    "43e45": "Não há lei, exceto a lei de que não há lei. –John Archibald Wheeler",
    "45cb0": "A inovação não consiste apenas em criar novas ideias, mas também em executá-las com sucesso. -Arun Pandit",
    "4N79HNWiA": "Para garantir que seja uma comunidade sem fins lucrativos, também abrimos todo o seu código-fonte no GitHub, que pode ser encontrado no rodapé desta página.",
    "4PIqD": "Revisão de código",
    "4cf03": "Na verdade, tudo o que pode ser conhecido como número; pois é impossível compreender qualquer coisa com a mente ou reconhecê-la sem ela. – Filolau",
    "4d389": "A inovação é um modo de vida para o empreendedor de sucesso. -John Rampton",
    "4da84": "Você pode não pensar que programadores são artistas, mas programar é uma profissão extremamente criativa. É criatividade baseada na lógica. – João Romero",
    "4sQWoTgfr": "O código de verificação expirou. Atualize a página e tente novamente",
    "4sdQWoTgfr": "O código de verificação expirou. Atualize a página e tente novamente.",
    "4vdfwf": "OK",
    "532fd": "Inovação é a capacidade de ver a mudança como uma oportunidade e não como uma ameaça. -Steve Jobs",
    "57eaa": "Somos apenas uma raça avançada de macacos num planeta menor de uma estrela muito comum. Mas podemos entender o Universo. Isso nos torna algo muito especial. -Stephen Hawking",
    "58c03": "A inovação é um fator chave para o sucesso de qualquer negócio. -Ravi Venkatesan",
    "58c5f": "Se, a princípio, você não conseguir, chame-a de versão 1.0. - Khayri R.R. Woulfe",
    "59f7d": "A inovação é o catalisador do progresso e do crescimento. -John Donahoe",
    "5a8a1": "Inovação é o processo de pegar uma ideia e transformá-la em realidade. -Kevin O'Leary",
    "5db54": "A ciência é o grande antídoto para o veneno do entusiasmo e da superstição. - Adam Smith",
    "5qPOJL": "Para oferecer suporte ao LafTools, considere dar uma estrela ao nosso repositório no GitHub ou atualizar para a nossa versão profissional por meio de uma assinatura mensal. Agradeceríamos muito a sua ajuda e prometemos que o LafTools ficará ainda melhor com os fundos arrecadados.",
    "626bf": "Se soubéssemos o que estávamos fazendo, isso não se chamaria pesquisa, certo? - Albert Einstein",
    "63d47": "A qualidade é produto de um conflito entre programadores e testadores. - Yegor Bugayenk",
    "662f9": "Você só vive uma vez, mas se você viver certo, uma vez é o bastante. -Mae Oeste",
    "66ef1": "Um bom código é sua melhor documentação. Ao adicionar um comentário, pergunte-se: ‘Como posso melhorar o código para que este comentário não seja necessário? ' -Steve McConnell",
    "66f12": "Ciência é conhecimento organizado. Sabedoria é vida organizada. -Will Durant",
    "6a0da": "A arte e a ciência de fazer perguntas são a fonte de todo conhecimento. –Thomas Berger",
    "6hsnqWe": "Embora o LafTools seja gratuito e de código aberto, mantê-lo ainda requer uma quantidade significativa de tempo e energia. Em particular, precisamos de fundos para pagar certas APIs em nuvem. Se você aprecia o LafTools, considere nos apoiar.",
    "71L3OI9T7": "Examinar a paz, promover a cooperação e buscar o desenvolvimento tornou-se o tema da era atual.",
    "72bee": "Não sou um grande programador; Sou apenas um bom programador com ótimos hábitos. -Kent Beck",
    "74a91": "Testar leva ao fracasso e o fracasso leva à compreensão - Burt Rutan",
    "74f90": "A ciência de hoje é a tecnologia de amanhã. –Edward Teller",
    "7714b": "A inovação é a chave para desbloquear novas oportunidades e impulsionar o crescimento.",
    "79f2d": "A maioria dos bons programadores programa não porque espera ser pago ou adulado pelo público, mas porque é divertido programar. - Linus Torvalds",
    "7affb": "O mundo não vai esperar por nós. A revolução tecnológica deixar-nos-á para trás se não conseguirmos alcançá-la. –Kofi Annan",
    "7c59e": "Experiência é o nome que todos dão aos seus erros. – Oscar Wilde",
    "7d4e4": "Inovação significa encontrar maneiras novas e melhores de fazer as coisas. -Jim Rohn",
    "7e19d": "A confusão faz parte da programação. - Felienne Hermans",
    "7flKa": "LafTools – O Onipotente para todos os Profissionais e Engenheiros",
    "7zqdufsdddJ": "Sim com certeza. O site ELB3.com é derivado do grupo de bate-papo WeChat sem fins lucrativos, {0}, que visa criar uma atmosfera de aprendizado de inglês amigável, confortável e sem anúncios.",
    "8259a": "Programador: Máquina que transforma café em código. – Anônimo",
    "850c1": "O cientista impõe apenas duas coisas, nomeadamente a verdade e a sinceridade, e impõe-nas a si mesmo e a outros cientistas. –Erwin Schrodinger",
    "8582b": "Se quisermos que os usuários gostem do nosso software, devemos projetá-lo para se comportar como uma pessoa agradável. -Alan Cooper",
    "8692e": "Há muitos tagarelas, totalmente ignorantes em matemática, que ousam condenar a minha hipótese, com base na autoridade de alguma parte da Bíblia distorcida para se adequar ao seu propósito. Eu não os valorizo ​​e desprezo seu julgamento infundado. – Nicolau Copérnico",
    "886d1": "Sentimos que mesmo que todas as questões científicas possíveis sejam respondidas, os problemas da vida ainda não foram tocados. –Ludwig Wittgenstein",
    "8HcQxKgho": "Acesso rápido",
    "8c224": "Não importa qual área de trabalho você queira atuar, é de grande importância aprender pelo menos uma linguagem de programação. -Ram Ray",
    "8e5d0": "A inovação é a chamada do futuro. –Kofi Annan",
    "90b5e": "Não é um bug; é um recurso não documentado. - Anônimo",
    "91f08": "A melhor coisa sobre a tecnologia é que ela permite que você se concentre na sua visão e esqueça o maquinário. –John Landis",
    "9251d": "A inovação é um fator chave na capacidade de qualquer empresa ter sucesso no longo prazo. -Elon Musk",
    "92b29": "Inovação é o processo de pegar uma ideia criativa e transformá-la em um sucesso comercial. -Richard Branson",
    "9334e": "A maior glória de viver não reside em nunca cair, mas em levantar-nos sempre que caímos. -Nelson Mandela",
    "9412b": "Primeiro, resolva o problema. Em seguida, escreva o código. –John Johnson",
    "9469a": "Todo mundo deveria aprender a programar um computador porque ele ensina como pensar. - Steve Jobs",
    "98d3f": "A ciência é uma magia que funciona. – Kurt Vonnegut",
    "9YPgsPid2M": "Código SMS",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Codificador Base64",
    "9b_7a0sdf": "Decodificador Base64",
    "9cb71": "Inovação significa criar valor para os clientes e melhorar suas vidas. -Reed Hastings",
    "9d18a": "O software vem do céu quando você tem um bom hardware. –Ken Olsen",
    "Abi2k2cP7": "Desculpe, esta página ainda não foi concluída.",
    "BP2jBlIE0": "Alguns links ainda estão indisponíveis porque o LafTools ainda está em desenvolvimento. Dê-nos uma estrela para assinar a atualização mais recente no GitHub.",
    "BQs6go-dk": "Baixe gratuitamente LafTools para Windows, Linux e macOS.",
    "Bz_WdwvAPn": "Verifique se o CAPTCHA foi fornecido corretamente.",
    "C_qzLO7yw": "Use Chrome, Firefox ou Edge para obter a melhor experiência.",
    "CidOqAZ": "Como criador do LafTools, estou muito emocionado por você estar disposto a nos apoiar. Temos boas pessoas em nossa equipe que trabalham duro para melhorar continuamente o LafTools.",
    "CqFdiBu6M": "Visualizar",
    "CuHqw9m": "{0} não é um número de telefone válido. Atualmente o sistema aceita apenas números de telefone de 11 dígitos.",
    "Ezsn81tfc": "Visualizar",
    "GaySMPQHo": "Tendendo",
    "H39ddc0df": "Tente fazer login mais tarde se falhar muitas vezes.",
    "HaU4NMabv": "O código de verificação está incorreto. Insira novamente ou atualize a imagem.",
    "HckK__LH2": "Mais",
    "Ibzs2-Ho1": "Ferramentas CSV",
    "IugAFc4OT": "Ocorreu um problema ao enviar seus dados.",
    "Jbor69IBw": "Formatadores",
    "N9bCERU1Q": "Página de operação interna para LafTools",
    "NdqZcRL2QN": "Caso você tenha esquecido sua senha, você pode redefini-la clicando no link ‘Esqueci minha senha’.",
    "OBjaZqTvx": "Lar",
    "OQWm4": "Reportar um erro",
    "TET4xnxBT": "ovos de pascoa",
    "TmvHUnZzQ": "Copiou o URL da página para a área de transferência",
    "UED59zbd-": "LafFerramentas",
    "UjkOS50wO": "Lar",
    "V6U_f": "Termos de serviço",
    "WKG7e": "Regras",
    "ZCzH8": "O mais novo",
    "ZaS8MP8cr": "Observação: o código de verificação foi atualizado. Ajuste os valores do formulário e insira o código novamente para continuar.",
    "ZbD3F": "{0}, criado pela equipe LafTools",
    "a0ab0": "A arte é a árvore da vida. A ciência é a árvore da morte. -William Blake",
    "a2849": "Ciência é a aceitação do que funciona e a rejeição do que não funciona. Isso requer mais coragem do que imaginamos. -Jacob Bronowski",
    "a3508": "Equipado com seus cinco sentidos, o homem explora o universo ao seu redor e chama a aventura de Ciência. -Edwin Hubble",
    "a5354": "É estranho que apenas as descobertas extraordinárias feitas pelo homem mais tarde pareçam tão fáceis e simples. –George C. Lichtenberg",
    "a7062": "A inovação é a faísca que acende o progresso. -Robyn M. D'Angelo",
    "a8a34": "A inovação é o cartão de visita do futuro. -Anna Eshoo",
    "a8dd9": "A vida não pode ter um começo aleatório... o problema é que existem cerca de 2.000 enzimas, e a chance de obter todas elas em um teste aleatório é apenas uma parte em 10^40.000, uma probabilidade escandalosamente pequena que não poderia ser enfrentada mesmo que todo o universo consistia em sopa orgânica. – Fred Hoyle",
    "aUdtds_qwY": "Normalmente, você pode entrar com seu ID de usuário ou número de telefone com sucesso, mesmo se tiver violado as regras desta comunidade.",
    "aa2f1": "Exploração é o que você faz quando não sabe o que está fazendo. Isso é o que os cientistas fazem todos os dias. Se um cientista já soubesse o que está fazendo, não estaria descobrindo nada, porque já sabia o que estava fazendo. – Neil de Grasse Tyson",
    "aa3a4": "Código é como humor. Quando você tem que explicar, é ruim. – Casa Cory",
    "ab5f7": "O aspecto mais triste da vida neste momento é que a ciência reúne conhecimento mais rápido do que a sociedade reúne sabedoria. – Isaac Asimov",
    "ac615": "Faça funcionar, faça certo, faça rápido. –Kent Beck",
    "adcca": "Qualquer idiota pode escrever um código que um computador possa entender. Bons programadores escrevem códigos que os humanos podem entender. - Martin Fowler",
    "af3158": "Tudo é determinado... por forças sobre as quais não temos controle. -Albert Einstein",
    "afcb9": "Nada tem tanto poder de ampliar a mente quanto a capacidade de investigar sistemática e verdadeiramente tudo o que está sob sua observação na vida. – Marco Aurélio",
    "afe52": "Sempre há mais um bug para corrigir. –Ellen Ullman",
    "announcement": "Anúncio",
    "b194e": "A inovação vem do produtor – não do cliente. -C. Eduardo Deming",
    "b19bb": "No dia em que a ciência começar a estudar fenómenos não-físicos, fará mais progressos numa década do que em todos os séculos anteriores da sua existência. - Nikola Tesla",
    "b2724": "Programar é a arte de dizer a outro ser humano o que se deseja que o computador faça. -Donald Ervin Knuth",
    "b4603": "A vida é o que acontece quando você está ocupado fazendo outros planos. - John Lennon",
    "b5014": "Muitos dos fracassos da vida são de pessoas que não perceberam o quão perto estavam do sucesso quando desistiram. – Thomas A. Edison",
    "b7wgrhuXl": "Tecnologia",
    "bc574": "A inovação é a força vital de um negócio saudável. -Mark Cubano",
    "bc92f": "A inovação bem-sucedida começa com a necessidade do cliente. -Michael Dell",
    "beb6e": "As ideias são fáceis. A implementação é difícil. -Guy Kawasaki",
    "bfb8e": "A inovação é a chave para se manter relevante e competitivo no mercado. -Mark Zuckerberg",
    "bjaEuT-cU": "Hospedado em {0}",
    "c7cfc": "Um bom teste é aquele que tem alta probabilidade de quebrar o código se houver algum problema - Michael Bolton",
    "cae2c": "Inovação é o processo de pegar ideias e transformá-las em realidade. -Neil Lawrence",
    "cd4d1": "A inovação é a chave para o crescimento dos negócios. -André R. Steinberg",
    "d0624": "A inovação não consiste apenas em apresentar novas ideias, mas em executá-las de forma eficaz. -Jeff Bezos",
    "d10c9": "A inovação é a chave para desbloquear novos potenciais e desbloquear novos mercados. -Tim cook",
    "d1820": "Até que o homem duplique uma folha de grama, a natureza poderá rir do seu chamado conhecimento científico. –Thomas Edison",
    "d366a": "A inovação é a chave para desbloquear um novo crescimento. -Philip Kotler",
    "d5LAU": "Licenciado sob AGPLv3",
    "d7dc4": "Teste é o processo de avaliação de um sistema ou de seu(s) componente(s) com a intenção de descobrir se ele satisfaz ou não os requisitos especificados - Anônimo",
    "dO6b2Tkqwe": "Ferramentas usadas recentemente",
    "da74c": "A especulação e a exploração de ideias além do que sabemos com certeza são o que leva ao progresso. –Lisa Randall",
    "dc662": "O único erro real é aquele com o qual nada aprendemos - John Powell",
    "dcebe": "Se a depuração é o processo de remoção de bugs de software, então a programação deve ser o processo de inseri-los - Edsger Dijkstra",
    "ddcc7": "A inovação é a chave para o sucesso na economia moderna. -Satya Nadella",
    "ddsdf3159": "A física nada mais é do que uma busca pela simplicidade máxima, mas até agora tudo o que temos é uma espécie de bagunça elegante. -Bill Bryson",
    "de47c": "Testar é a arte de encontrar uma caixa preta e fazê-la cantar - James Bach",
    "dldeoeqwc": "Lembretes amigáveis",
    "dnsz7fwNx": "O ID do usuário diferencia maiúsculas de minúsculas.",
    "e097e": "Inovação significa criar novas possibilidades e não apenas novos produtos. -Tony Robbins",
    "e2379": "Vivemos numa sociedade extremamente dependente da ciência e da tecnologia, na qual quase ninguém sabe alguma coisa sobre ciência e tecnologia. - Carl sagan",
    "e984f": "O código limpo sempre parece ter sido escrito por alguém que se importa. -Robert C. Martin",
    "ea227": "A melhor maneira de prever o futuro é criá-lo. -Peter Drucker",
    "ee7d0": "O sentimento de admiração que a ciência pode nos proporcionar é uma das experiências mais elevadas de que a psique humana é capaz. - Richard dawkins",
    "englishcorner": "Inglês",
    "f0d15": "Os computadores são rápidos; os desenvolvedores os mantêm lentos. – Anônimo",
    "f12bb": "A inovação é a força motriz do progresso no mundo dos negócios. É o processo de gerar novas ideias e transformá-las em produtos, serviços ou processos tangíveis que agreguem valor aos clientes.",
    "f23c2": "Inovação distingue um líder de um seguidor. -Steve Jobs",
    "f29b1": "O progresso é feito por tentativa e fracasso; os fracassos são geralmente cem vezes mais numerosos que os sucessos, mas geralmente não são registrados. –William Ramsay",
    "f3151": "O maior risco é não correr nenhum risco. -Mark Zuckerberg",
    "f3159": "A matemática é um jogo jogado de acordo com certas regras simples, com marcas sem sentido no papel. -David Hilbert",
    "f315e7": "A matemática não conhece raças ou fronteiras geográficas. -David Hilbert",
    "f3160": "A matemática é o juiz supremo; de suas decisões não há recurso. -Tobias Dantzig",
    "f3161": "Em matemática, a arte de propor uma questão deve ser considerada de maior valor do que resolvê-la. -Georg Cantor",
    "f3162": "A matemática é um lugar onde você pode fazer coisas que não pode fazer no mundo real. -Marcus du Sautoy",
    "f3163": "O avanço e o aperfeiçoamento da matemática estão intimamente ligados à prosperidade do estado. -Napoleão Bonaparte",
    "f3164": "A essência da matemática reside na sua liberdade. -Georg Cantor",
    "f3165": "A matemática é a ciência do que é claro por si só. -Carl Jacobi",
    "f3166": "A matemática, vista corretamente, possui não apenas a verdade, mas também a beleza suprema. -Bertrand Russel",
    "f3167": "A matemática é a ferramenta especialmente adequada para lidar com conceitos abstratos de qualquer tipo. -P. Dirac",
    "f3168": "A matemática revela os seus segredos apenas a quem a aborda com puro amor, pela sua própria beleza. -Arquimedes",
    "f3169": "A matemática é a criação mais bela e poderosa do espírito humano. -Stefan Banach",
    "f3170": "O matemático não estuda matemática pura porque é útil; ele estuda porque se deleita com isso e se deleita porque é lindo. -Henri Poincaré",
    "f3171": "O estudo da matemática, como o Nilo, começa na minúcia, mas termina na magnificência. -Charles Caleb Colton",
    "f318e4": "A biologia é a tecnologia mais poderosa já criada. DNA é software, proteínas são hardware, células são fábricas. -Arvind Gupta",
    "f31d71": "A física é, esperançosamente, simples. Os físicos não são. -Edward Teller",
    "f31d75": "A física nada mais é do que uma busca pela simplicidade máxima, mas até agora tudo o que temos é uma espécie de bagunça elegante. -Bill Bryson",
    "f31e53": "A matemática é a rainha das ciências. -Carl Friedrich Gauss",
    "f31q52": "A matemática pura é, à sua maneira, a poesia das ideias lógicas. -Albert Einstein",
    "f31q54": "O livro da natureza está escrito na linguagem da matemática. -Galileu Galilei",
    "f31q56": "A matemática é a música da razão. -James Joseph Sylvester",
    "f31q58": "A matemática não trata de números, equações, cálculos ou algoritmos: trata-se de compreensão. -William Paul Thurston",
    "f31q70": "Biologia é a ciência. A evolução é o conceito que torna a biologia única. -Jared Diamante",
    "f31q72": "A biologia é a poesia do mundo físico e a biologia humana é a poesia do nosso universo. -Julian Casablancas",
    "f31q74": "A biologia é apenas a física que começou a cheirar mal. -Nigel Calder",
    "f31q81": "A física é a ciência dos movimentos e ações dos corpos físicos concebidos em termos de causa e efeito. -Arthur Compton",
    "f31qe82": "Biologia é um processo de software. Nossos corpos são compostos de trilhões de células, cada uma governada por esse processo. Você e eu andamos por aí com softwares desatualizados rodando em nossos corpos, que evoluíram em uma era muito diferente. -Ray Kurzweil",
    "f31r83": "A física está se tornando muito difícil para os físicos. -David Hilbert",
    "f31sq66": "A biologia é realmente química, a química é realmente física, a física é realmente matemática. -Matt Ridley",
    "f31x76": "Biologia é o estudo das coisas complexas do Universo. A física é o estudo dos simples. -Richard dawkins",
    "f31x77": "A física é experiência, organizada em ordem econômica. -Ernst Mach",
    "f3d169": "A física é a única ciência real. O resto são apenas colecionadores de selos. -Ernest Rutherford",
    "f3d179": "A física está se tornando tão incrivelmente complexa que leva cada vez mais tempo para treinar um físico. Na verdade, está demorando tanto para treinar um físico até o ponto em que ele entenda a natureza dos problemas físicos que ele já está velho demais para resolvê-los. -Eugene Wigner",
    "f3d180": "A biologia é a ciência da vida, mas muitos de nós não entendemos os fundamentos do nosso próprio corpo. -Kathy Reichs",
    "f3e155": "A matemática é a porta e a chave das ciências. -Roger Bacon",
    "f3q178": "Biologia não é destino. Nunca foi mais do que uma tendência. Foi apenas a primeira maneira rápida e suja da natureza de calcular a carne. Chips são destino. -Bart Kosko",
    "f3sd162": "Biologia é o estudo de coisas complicadas que parecem ter sido projetadas com um propósito. -Richard dawkins",
    "f3sd164": "A biologia lhe dá um cérebro. A vida transforma isso em uma mente. -Jeffrey Eugenides",
    "f3sd165": "Na física, você não precisa sair por aí criando problemas para si mesmo - a natureza faz isso por você. -Frank Wilczek",
    "f3sq167": "O bom da ciência é que ela é verdade, quer você acredite nela ou não. -Neil de Grasse Tyson",
    "f477b": "A programação é a arte do design de algoritmos e a arte de depurar códigos errôneos. –Ellen Ullman",
    "f7cf7": "Na verdade, existem duas coisas: ciência e opinião; o primeiro gera conhecimento, o segundo, ignorância. – Hipócrates",
    "f814a": "Quando escrevi este código, somente Deus e eu entendemos o que fiz. Agora só Deus notools. – Anônimo",
    "f96ff": "A inovação é o motor do progresso e do sucesso nos negócios. -Satya Nadella",
    "fa94e": "A inovação é a chave para permanecer à frente na corrida competitiva. -Paul Sloane",
    "fc805": "Inovação é criatividade com uma tarefa a cumprir. –Tom Peters.",
    "fd3173": "Física é imaginação em camisa de força. -John Moffat",
    "fdd2b": "Ciência é conhecimento organizado. Sabedoria é vida organizada. – Emanuel Kant",
    "forever-foss": "Para sempre FOSS!",
    "giveas3tar": "Dê-nos uma estrela no GitHub se você gosta do LafTools.",
    "groupnote": "Memorando",
    "hbvxdivMHi": "{0} ferramentas no total",
    "iZXig7E2JF": "LafTools oferece um conjunto abrangente de utilitários de desenvolvimento, incluindo codecs, formatadores, ferramentas de processamento de imagens e soluções de gerenciamento de recursos de computador. Projetado para agilizar e aprimorar seu fluxo de trabalho de desenvolvimento, o LafTools é o recurso ideal para desenvolvimento de software eficiente e de alta qualidade.",
    "jRFk519Bj-": "Esta comunidade é impulsionada por um projeto de código-fonte aberto totalmente internacional e gratuito.",
    "jr_7Y98yZ": "LafFerramentas",
    "kUSuP_S-Y": "Experimente com a IU do cliente",
    "lWqYc": "Este site fornece ferramentas JSON, incluindo JSON para XML, JSON para CSV, JSON para YAML.",
    "laftoolstitle": "Jogar Online LafTools",
    "lu2T6idPY": "Se você acha que há um problema com sua conta, entre em contato com o webmaster.",
    "nh1W-": "Os testes só podem provar a presença de bugs, não a sua ausência - Edsger Dijkstra",
    "nncQE": "Vida",
    "o1ikM3T4c": "Ajudantes do programador",
    "ob1q-I7s-": "Sobre LafTools",
    "pNwe3": "Outro",
    "q0zA1kML_": "Caixa de ferramentas on-line",
    "q3VjkLMsP": "Amizade, intercâmbio, cooperação e desenvolvimento",
    "qHoktx": "Obrigado!",
    "qWemXE4": "1º de janeiro de 2024",
    "quality-first": "Qualidade em primeiro lugar",
    "rK6cx": "{0}, projetado e desenvolvido pela equipe LafTools",
    "rzoFmjStq": "Ferramentas relevantes",
    "sdf3160": "A tarefa dos teóricos, especialmente na biologia, é sugerir novos experimentos. Uma boa teoria não faz apenas previsões, mas previsões surpreendentes que depois se revelam verdadeiras. -Francisco Crick",
    "t8DUz20a-": "Formatador JSON",
    "title-laftools": "LafTools – A caixa de ferramentas multifuncional líder para programadores",
    "wCcPJZK": "{0} não é um e-mail válido",
    "wCctGPJZK": "{0} não deve estar vazio",
    "wYsKTq7nK": "Clique em mim para ver o código-fonte",
    "wi28h5_S2": "Codecs",
    "yCsTC": "Otimização prematura é a raiz de todo o mal.",
    "zmDWx": "Contate-nos",
    "zuxd0y-kmA": "ID de usuário ou número de telefone não possui espaços em branco."
}