{
    "JS-Basics-001": "Что такое JavaScript?",
    "JS-DOM-API-007": "Как JavaScript взаимодействует с DOM?",
    "JS-DOM-API-Explanation-008": "JavaScript предоставляет API объектной модели документа (DOM) для управления HTML и CSS, что позволяет разработчикам динамически изменять содержимое, стиль и прослушиватели событий.",
    "JS-DOM-Example-009": "Например, вы можете выбрать элемент и изменить его текстовое содержимое: `document.getElementById('myElement').textContent = 'New Text';`",
    "JS-Data-Types-010": "Какие типы данных существуют в JavaScript?",
    "JS-Data-Types-List-011": "JavaScript поддерживает различные типы данных, включая примитивные, такие как строка, число, логическое значение, значение NULL, неопределенное значение и символ, а также сложные типы, такие как объект и массив.",
    "JS-Def-002": "JavaScript (JS) — это интерпретируемый язык программирования высокого уровня, который широко используется для создания веб-приложений, улучшения пользовательских интерфейсов и построения серверной логики с помощью Node.js.",
    "JS-Event-Loop-013": "Что такое цикл событий в JavaScript?",
    "JS-Event-Loop-Explanation-014": "Цикл событий — это основная часть модели параллелизма JavaScript, которая обеспечивает асинхронное выполнение посредством обратных вызовов, обещаний и async/await.",
    "JS-Event-Loop-Process-015": "Сначала он запускает основной сценарий, затем выполняет любые функции обратного вызова при возникновении связанных с ними событий (например, ввода пользователя или ответов сети), управляя ими через систему очередей.",
    "JS-Function-Syntax-006": "Функции определяются с помощью ключевого слова function, за которым следуют имя функции и параметры, заключенные в круглые скобки. Тело функции заключено в фигурные скобки: `function Greeting(name) { console.log(`Hello, ${name}!`); }`",
    "JS-Purpose-003": "Первоначально он был разработан Бренданом Эйхом из Netscape в 1995 году и с тех пор превратился в один из самых популярных языков, поддерживаемый всеми основными веб-браузерами и платформами, такими как Electron и React Native.",
    "JS-Syntax-004": "Каков основной синтаксис JavaScript?",
    "JS-Type-Checking-012": "Проверка типа может выполняться с помощью конструкторов («typeof value === 'string'») или оператора «instanceof» для объектов, наследуемых от встроенных конструкторов (например, «value instanceof Array»).",
    "MDN-DOM-API": "Веб-документы MDN — работа с документами",
    "MDN-Event-Loop": "Веб-документы MDN — цикл событий",
    "MDN-JS-Guide": "Веб-документы MDN — Руководство по JavaScript",
    "MDN-JS-Types": "Веб-документы MDN — типы данных и структуры данных"
}