{
    "123e4567": "Apa itu Base64?",
    "1a2b3c4d": "Mengapa menggunakan Base64?",
    "23fgh456": "Sejarah Base64",
    "2bcde3fg": "Kekurangan Base64",
    "34wxyz56": "Bagaimana cara menyandikan/mendekode Base64 dalam JavaScript?",
    "4hijk5lm": "Peningkatan Ukuran: Data yang dikodekan kira-kira 33% lebih besar dari data biner asli.",
    "5e6f7g8h": "Base64 digunakan ketika data biner perlu dikirim melalui protokol berbasis teks seperti email atau JSON, atau disematkan di tempat yang hanya mengizinkan teks.",
    "6nopqrst": "Tanpa Enkripsi: Base64 bukanlah metode enkripsi; itu mudah diterjemahkan dan tidak memberikan keamanan.",
    "78abcdef": "JavaScript menawarkan fungsi bawaan seperti btoa() dan atob() untuk pengkodean dan decoding Base64.",
    "78ijk9lm": "Base64 pertama kali didefinisikan dalam RFC 1421 (1993) dan kemudian distandarisasi dalam RFC 4648 (2006).",
    "9i0j1k2l": "Ini juga digunakan untuk menyematkan gambar kecil langsung ke HTML atau CSS sebagai URL data.",
    "ab9c0d1e": "Operasi utama meliputi pengkodean (mengonversi biner ke Base64) dan decoding (mengonversi Base64 kembali ke biner).",
    "abc12345": "Base64 adalah skema pengkodean yang merepresentasikan data biner sebagai rangkaian karakter ASCII.",
    "abcdef12": "Bagaimana cara kerja Base64?",
    "bcdef01a": "Base64 bekerja dengan membagi data biner menjadi kelompok 6 bit dan memetakan setiap kelompok ke karakter tertentu dari alfabet 64 karakter (A-Za-z0-9+/).",
    "cbaq54321": "Tidak, Base64 bukanlah teknik kompresi, ini hanya mengubah representasi data, bukan ukurannya.",
    "cdefg234": "Karakter padding (=) ditambahkan di akhir untuk memastikan panjang data yang dikodekan adalah kelipatan 4 karakter.",
    "efg45678": "Perbandingan dengan Base32",
    "efghi678": "Varian ini sering digunakan untuk nama file, URL, atau situasi di mana karakter khusus harus dihindari.",
    "fghi6789": "Ini digunakan untuk mengirimkan atau menyimpan file biner dalam format berbasis teks, memastikan kompatibilitas di berbagai sistem.",
    "hij90klm": "Base32 menggunakan alfabet yang lebih kecil (A-Z2-7), menghasilkan string yang lebih panjang namun lebih mudah dibaca manusia.",
    "mno34567": "Keuntungan Base64",
    "mnoijklm": "Apakah ada pengkodean BaseXX lainnya?",
    "n0pqrstu": "Contoh penggunaan Base64",
    "nopqrs01": "Meskipun Base64 mengoptimalkan kekompakan, Base32 dipilih ketika meminimalkan kesalahan input, seperti entri manual, sangatlah penting.",
    "pqrs890t": "Kompatibilitas Universal: Base64 dikenal luas dan didukung di semua bahasa pemrograman utama.",
    "qrstuvwx": "Ya, selain Base64 dan Base32, ada juga Base16 (Heksadesimal), Base58, dan Base85, masing-masing dirancang untuk skenario berbeda.",
    "tuv23456": "Varian aman URL Base64",
    "u7vwx8yz": "Operasi umum Base64",
    "uvwxyza1": "Tidak Ada Kehilangan Data: Karena ini adalah proses yang dapat dibalik, pengkodean Base64 tidak mengakibatkan hilangnya informasi apa pun.",
    "vwx1yza2": "Contohnya adalah menyandikan file gambar untuk menyematkannya dalam tag HTML <img>:",
    "wxyzabcd": "Ada versi Base64 yang aman untuk URL yang menggantikan '+' dengan '-' dan '/' dengan '_', dan menghilangkan padding '=', sehingga cocok untuk URL web.",
    "zyx98765": "Bisakah Base64 digunakan untuk kompresi?"
}