{
    "123e4567": "O que é Base64?",
    "1a2b3c4d": "Por que usar Base64?",
    "23fgh456": "História da Base64",
    "2bcde3fg": "Desvantagens do Base64",
    "34wxyz56": "Como codificar/decodificar Base64 em JavaScript?",
    "4hijk5lm": "Aumento de tamanho: os dados codificados são aproximadamente 33% maiores que os dados binários originais.",
    "5e6f7g8h": "Base64 é usado quando dados binários precisam ser transmitidos por meio de protocolos baseados em texto, como e-mail ou JSON, ou incorporados em locais onde apenas texto é permitido.",
    "6nopqrst": "Sem criptografia: Base64 não é um método de criptografia; é facilmente decodificado e não oferece segurança.",
    "78abcdef": "JavaScript oferece funções integradas como btoa() e atob() para codificação e decodificação Base64, respectivamente.",
    "78ijk9lm": "Base64 foi definido pela primeira vez na RFC 1421 (1993) e posteriormente padronizado na RFC 4648 (2006).",
    "9i0j1k2l": "Também é usado para incorporar pequenas imagens diretamente em HTML ou CSS como URLs de dados.",
    "ab9c0d1e": "As operações primárias incluem codificação (conversão de binário em Base64) e decodificação (conversão de Base64 de volta em binário).",
    "abc12345": "Base64 é um esquema de codificação que representa dados binários como uma sequência de caracteres ASCII.",
    "abcdef12": "Como funciona o Base64?",
    "bcdef01a": "Base64 funciona dividindo dados binários em grupos de 6 bits e mapeando cada grupo para um caractere específico de um alfabeto de 64 caracteres (A-Za-z0-9+/).",
    "cbaq54321": "Não, Base64 não é uma técnica de compactação, apenas altera a representação dos dados e não o seu tamanho.",
    "cdefg234": "Caracteres de preenchimento (=) são adicionados no final para garantir que o comprimento dos dados codificados seja um múltiplo de 4 caracteres.",
    "efg45678": "Comparação com Base32",
    "efghi678": "Esta variante é frequentemente usada para nomes de arquivos, URLs ou situações em que caracteres especiais devem ser evitados.",
    "fghi6789": "É usado para transmitir ou armazenar arquivos binários em formatos baseados em texto, garantindo compatibilidade entre vários sistemas.",
    "hij90klm": "Base32 usa um alfabeto menor (A-Z2-7), resultando em strings mais longas, porém mais legíveis por humanos.",
    "mno34567": "Vantagens do Base64",
    "mnoijklm": "Existem outras codificações BaseXX?",
    "n0pqrstu": "Exemplo de uso de Base64",
    "nopqrs01": "Embora o Base64 otimize a compactação, o Base32 é escolhido quando minimizar erros de entrada, como entrada manual, é crucial.",
    "pqrs890t": "Compatibilidade Universal: Base64 é amplamente reconhecido e suportado em todas as principais linguagens de programação.",
    "qrstuvwx": "Sim, além de Base64 e Base32, também existem Base16 (Hexadecimal), Base58 e Base85, cada uma projetada para cenários diferentes.",
    "tuv23456": "Variante segura de URL Base64",
    "u7vwx8yz": "Operações Base64 comuns",
    "uvwxyza1": "Sem perda de dados: por ser um processo reversível, a codificação Base64 não resulta em perda de informações.",
    "vwx1yza2": "Um exemplo é codificar um arquivo de imagem para incorporá-lo em uma tag HTML <img>:",
    "wxyzabcd": "Existe uma versão segura para URL do Base64 que substitui '+' por '-' e '/' por '_' e omite o preenchimento '=', tornando-o adequado para URLs da web.",
    "zyx98765": "O Base64 pode ser usado para compactação?"
}