{
    "BLAKE2-021": "BLAKE2 on toinen moderni vaihtoehto, joka tarjoaa nopeammat nopeudet verrattuna SHA-2:een säilyttäen samalla korkean tietoturvatason. Se tarjoaa useita muunnelmia, mukaan lukien BLAKE2b ja BLAKE2s.",
    "BLAKE2_Info-023": "BLAKE2 tiedot",
    "MD5-Advantages-012": "Mitä etuja MD5:n käytöstä on?",
    "MD5-AlgorithmDetails-011": "MD5-algoritmin tiedot",
    "MD5-Alternatives-019": "Mitä vaihtoehtoja MD5:lle on turvallista hajautusjärjestelmää varten?",
    "MD5-Applications-024": "Mitkä muut sovellukset käyttävät tai ovat käyttäneet MD5:tä?",
    "MD5-Breakdown-017": "MD5:ssä on havaittu useita salausheikkouksia ajan mittaan, ja tutkijat ovat osoittaneet käytännön esimerkkejä törmäysten luomisesta, mikä edelleen vaarantaa sen eheyden ja turvallisuuden.",
    "MD5-Collision-016": "MD5 on alttiina törmäyshyökkäyksille, mikä tarkoittaa, että kaksi eri tuloa voivat tuottaa saman hash-tulosteen. Tämä tekee siitä epävarman sellaisille sovelluksille kuin digitaaliset allekirjoitukset tai salasanan tallennus.",
    "MD5-CollisionExample-007": "MD5 törmäysesimerkki",
    "MD5-DataIntegrity-026": "Sitä käytettiin myös yleisesti tietojen eheyden tarkistamiseen lähetyksen ja tallennuksen aikana, kuten käytettäessä rsyncia tiedostojen synkronointiin tai suurten tietojoukkojen tarkistussummaamiseen.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) on laajalti käytetty kryptografinen hajautusfunktio, joka ottaa syötetyn viestin ja tuottaa kiinteän koon 128-bittisen hash-arvon.",
    "MD5-DigitalSignature-Risks-027": "MD5:n käytön riskit digitaalisiin allekirjoituksiin",
    "MD5-Disadvantages-015": "Mitkä ovat MD5:n haitat ja turvallisuusongelmat?",
    "MD5-FAQ-001": "Mikä on MD5?",
    "MD5-FileChecksum-005": "MD5:tä käytetään usein tiedostojen eheyden tarkistamiseen ladattaessa ohjelmistoja tai suuria tiedostoja. Se luo tarkistussumman, jota voidaan verrata lähteen tarjoamaan summaan varmistaakseen, että ladattua tiedostoa ei ole peukaloitu.",
    "MD5-Future-028": "Onko MD5 edelleen ajankohtainen?",
    "MD5-InsecurityExamples-018": "Esimerkkejä MD5:n tietoturvahäiriöistä",
    "MD5-Operation-008": "Miten MD5:n toiminta toimii?",
    "MD5-PKI-025": "MD5:tä on käytetty julkisen avaimen infrastruktuurissa (PKI) digitaalisten allekirjoitusten luomiseen, vaikka sen käyttö on suurelta osin vanhentunut turvallisuussyistä. Useimmat nykyaikaiset järjestelmät eivät enää luota MD5:llä allekirjoitettuihin sertifikaatteihin.",
    "MD5-PasswordHashing-006": "Sitä käytettiin historiallisesti myös salasanojen hajauttamisessa, mutta sitä pidetään nyt epävarmana törmäysalttiuden ja murtamisen helpon vuoksi. Nykyaikaiset järjestelmät ovat siirtyneet vahvempiin vaihtoehtoihin, kuten bcrypt tai Argon2.",
    "MD5-Process-009": "MD5 toimii jakamalla syöttösanoman paloiksi ja kuljettamalla jokaisen palan useiden käsittelykierrosten läpi, jotka sisältävät loogisia toimintoja, modulaarista aritmetiikkaa ja bittikohtaisia ​​operaatioita. Tulos ketjutetaan lopullisen 128-bittisen hash-arvon tuottamiseksi.",
    "MD5-Purpose-003": "Sen tarkoituksena on varmistaa tietojen eheys luomalla yksilöllinen digitaalinen sormenjälki mille tahansa tiedolle. Jos edes yksi bitti alkuperäisessä tiedossa muuttuu, MD5-tiiviste on täysin erilainen.",
    "MD5-Relevance-029": "MD5:tä ei pidetä enää turvallisena salaustarkoituksiin, etenkään uusissa sovelluksissa, jotka vaativat törmäyskestävyyttä tai vahvaa viestien eheyttä. Se saattaa kuitenkin löytyä vanhoista järjestelmistä tai ei-salaussovelluksista, joissa nopeus on turvallisuuden edelle.",
    "MD5-Rounds-010": "Algoritmi koostuu neljästä päävaiheesta, jotka suoritetaan 128-bittisessä sisäisessä tilassa, joka alustetaan vakioilla. Käsittelykierroksia on yhteensä 64, joissa jokainen kierros muuttaa sisäisen tilan syöttöviestilohkojen perusteella.",
    "MD5-Speed-013": "MD5 on suhteellisen nopea, mikä teki siitä suositun sovelluksissa, joissa nopea hajautus oli välttämätöntä.",
    "MD5-Standardization-014": "Se on laajalti standardoitu ja toteutettu useilla ohjelmointikielillä ja -alustoilla, mikä tekee siitä helpon integroinnin olemassa oleviin järjestelmiin ja työkaluihin.",
    "MD5-Summary-031": "Yhteenvetona, mitä avainkohtia minun pitäisi muistaa MD5:stä?",
    "MD5-Summary-Point1-032": "MD5 on nopea mutta epävarma kryptografinen hajautustoiminto, joka on alttiina törmäyshyökkäyksille.",
    "MD5-Summary-Point2-033": "Sen ensisijaiset käyttötarkoitukset olivat tietojen eheyden varmistaminen ja eräät salaustoiminnot, mutta se on suurelta osin korvattu vahvemmilla vaihtoehdoilla, kuten SHA-256 ja BLAKE2.",
    "MD5-Summary-Point3-034": "Vaikka saatat kohdata MD5:n vanhoissa järjestelmissä tai ei-turvallisissa skenaarioissa, on erittäin tärkeää välttää sen käyttöä uusissa projekteissa, jotka vaativat salaussuojausta.",
    "MD5-Transition-030": "Kun uudemmat, turvallisemmat algoritmit, kuten SHA-256 ja BLAKE2, tulevat laajalti saataville ja paremmin ymmärretyiksi, on suositeltavaa siirtyä pois MD5:stä kaikissa tilanteissa, joissa turvallisuus on huolenaihe.",
    "MD5-Usage-004": "Miten MD5:tä käytetään käytännössä?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) on laajalti käytetty vaihtoehto, joka tarjoaa vahvemman suojauksen kuin MD5. Se luo suuremman 256-bittisen hash-arvon ja on osa SHA-2-perhettä.",
    "SHA-2_Info-022": "SHA-2 tiedot"
}