{
    "BLAKE2-021": "BLAKE2 è un'altra alternativa moderna che fornisce velocità più elevate rispetto a SHA-2 mantenendo elevati livelli di sicurezza. Offre molteplici varianti tra cui BLAKE2b e BLAKE2s.",
    "BLAKE2_Info-023": "BLAKE2 Informazioni",
    "MD5-Advantages-012": "Quali sono i vantaggi dell’utilizzo di MD5?",
    "MD5-AlgorithmDetails-011": "Dettagli dell'algoritmo MD5",
    "MD5-Alternatives-019": "Quali sono alcune alternative a MD5 per l'hashing sicuro?",
    "MD5-Applications-024": "Quali altre applicazioni utilizzano o hanno utilizzato MD5?",
    "MD5-Breakdown-017": "Nel corso del tempo sono state scoperte diverse debolezze crittografiche in MD5 e i ricercatori hanno dimostrato esempi pratici di creazione di collisioni, compromettendone ulteriormente l’integrità e la sicurezza.",
    "MD5-Collision-016": "MD5 è vulnerabile agli attacchi di collisione, il che significa che due input diversi possono produrre lo stesso output hash. Ciò lo rende insicuro per applicazioni come firme digitali o archiviazione di password.",
    "MD5-CollisionExample-007": "Esempio di collisione MD5",
    "MD5-DataIntegrity-026": "Era anche comunemente utilizzato per verificare l'integrità dei dati durante la trasmissione e l'archiviazione, ad esempio quando si utilizza rsync per la sincronizzazione dei file o il checksum di set di dati di grandi dimensioni.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) è una funzione hash crittografica ampiamente utilizzata che accetta un messaggio di input e produce un valore hash di dimensione fissa a 128 bit.",
    "MD5-DigitalSignature-Risks-027": "Rischi dell'utilizzo di MD5 per le firme digitali",
    "MD5-Disadvantages-015": "Quali sono gli svantaggi e i problemi di sicurezza di MD5?",
    "MD5-FAQ-001": "Cos'è MD5?",
    "MD5-FileChecksum-005": "MD5 viene spesso utilizzato per verificare l'integrità dei file durante il download di software o file di grandi dimensioni. Genera un checksum che può essere confrontato con quello fornito dalla fonte per garantire che il file scaricato non sia stato manomesso.",
    "MD5-Future-028": "MD5 è ancora attuale oggi?",
    "MD5-InsecurityExamples-018": "Esempi di guasti alla sicurezza MD5",
    "MD5-Operation-008": "Come funziona il funzionamento MD5?",
    "MD5-PKI-025": "MD5 è stato utilizzato nell'infrastruttura a chiave pubblica (PKI) per la creazione di firme digitali, sebbene il suo utilizzo sia stato in gran parte deprecato a causa di problemi di sicurezza. I certificati firmati con MD5 non sono più considerati affidabili dalla maggior parte dei sistemi moderni.",
    "MD5-PasswordHashing-006": "Storicamente veniva utilizzato anche per l'hashing delle password, ma ora è considerato insicuro a causa della sua vulnerabilità alle collisioni e alla facilità di cracking. I sistemi moderni sono passati ad alternative più potenti come bcrypt o Argon2.",
    "MD5-Process-009": "MD5 opera suddividendo il messaggio di input in blocchi e facendo passare ciascun blocco attraverso diversi cicli di elaborazione che coinvolgono funzioni logiche, aritmetica modulare e operazioni bit a bit. Il risultato viene concatenato per produrre il valore hash finale a 128 bit.",
    "MD5-Purpose-003": "Il suo scopo è garantire l'integrità dei dati generando un'impronta digitale unica per ogni dato dato. Se cambia anche un solo bit nei dati originali, l'hash MD5 sarà completamente diverso.",
    "MD5-Relevance-029": "MD5 non è più considerato sicuro per scopi crittografici, soprattutto per le nuove applicazioni che richiedono resistenza alle collisioni o una forte integrità dei messaggi. Tuttavia, potrebbe ancora essere presente in sistemi legacy o in applicazioni non crittografiche in cui la velocità è una priorità rispetto alla sicurezza.",
    "MD5-Rounds-010": "L'algoritmo è costituito da quattro fasi principali eseguite su uno stato interno a 128 bit che viene inizializzato con costanti. Sono presenti 64 cicli di elaborazione in totale, in cui ogni ciclo trasforma lo stato interno in base ai blocchi di messaggi di input.",
    "MD5-Speed-013": "MD5 è relativamente veloce, il che lo ha reso popolare per le applicazioni in cui l'hashing rapido era essenziale.",
    "MD5-Standardization-014": "È stato ampiamente standardizzato e implementato in vari linguaggi e piattaforme di programmazione, facilitandone l'integrazione in sistemi e strumenti esistenti.",
    "MD5-Summary-031": "In sintesi, quali punti chiave dovrei ricordare sull’MD5?",
    "MD5-Summary-Point1-032": "MD5 è una funzione hash crittografica veloce ma insicura suscettibile agli attacchi di collisione.",
    "MD5-Summary-Point2-033": "I suoi usi principali erano garantire l'integrità dei dati e alcune operazioni crittografiche, ma è stato in gran parte sostituito da alternative più potenti come SHA-256 e BLAKE2.",
    "MD5-Summary-Point3-034": "Anche se potresti incontrare MD5 in sistemi legacy o scenari non sensibili alla sicurezza, è fondamentale evitare di utilizzarlo per nuovi progetti che richiedono sicurezza crittografica.",
    "MD5-Transition-030": "Man mano che algoritmi più nuovi e più sicuri come SHA-256 e BLAKE2 diventano ampiamente disponibili e meglio compresi, si consiglia di abbandonare MD5 in tutti i contesti in cui la sicurezza è un problema.",
    "MD5-Usage-004": "Come viene utilizzato nella pratica MD5?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) è un'alternativa ampiamente utilizzata che offre una sicurezza maggiore rispetto a MD5. Genera un valore hash più grande a 256 bit e fa parte della famiglia SHA-2.",
    "SHA-2_Info-022": "Informazioni SHA-2"
}