{
    "BLAKE2-021": "BLAKE2 ialah satu lagi alternatif moden yang memberikan kelajuan lebih pantas berbanding SHA-2 sambil mengekalkan tahap keselamatan yang tinggi. Ia menawarkan pelbagai varian termasuk BLAKE2b dan BLAKE2s.",
    "BLAKE2_Info-023": "Maklumat BLAKE2",
    "MD5-Advantages-012": "Apakah kelebihan menggunakan MD5?",
    "MD5-AlgorithmDetails-011": "Butiran Algoritma MD5",
    "MD5-Alternatives-019": "Apakah beberapa alternatif kepada MD5 untuk pencincangan selamat?",
    "MD5-Applications-024": "Apakah aplikasi lain yang menggunakan atau telah menggunakan MD5?",
    "MD5-Breakdown-017": "Beberapa kelemahan kriptografi telah ditemui dalam MD5 dari semasa ke semasa, dan penyelidik telah menunjukkan contoh praktikal untuk mencipta perlanggaran, seterusnya menjejaskan integriti dan keselamatannya.",
    "MD5-Collision-016": "MD5 terdedah kepada serangan perlanggaran, bermakna dua input berbeza boleh menghasilkan output cincang yang sama. Ini menjadikannya tidak selamat untuk aplikasi seperti tandatangan digital atau storan kata laluan.",
    "MD5-CollisionExample-007": "Contoh Perlanggaran MD5",
    "MD5-DataIntegrity-026": "Ia juga biasa digunakan untuk mengesahkan integriti data semasa penghantaran dan penyimpanan, seperti semasa menggunakan rsync untuk penyegerakan fail atau checksumming set data yang besar.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) ialah fungsi cincang kriptografi yang digunakan secara meluas yang mengambil mesej input dan menghasilkan nilai cincang 128-bit saiz tetap.",
    "MD5-DigitalSignature-Risks-027": "Risiko Menggunakan MD5 untuk Tandatangan Digital",
    "MD5-Disadvantages-015": "Apakah kelemahan dan kebimbangan keselamatan dengan MD5?",
    "MD5-FAQ-001": "Apakah MD5?",
    "MD5-FileChecksum-005": "MD5 sering digunakan untuk mengesahkan integriti fail semasa memuat turun perisian atau fail besar. Ia menghasilkan jumlah semak yang boleh dibandingkan dengan yang disediakan oleh sumber untuk memastikan fail yang dimuat turun tidak diusik.",
    "MD5-Future-028": "Adakah MD5 masih relevan hari ini?",
    "MD5-InsecurityExamples-018": "Contoh Pecahan Keselamatan MD5",
    "MD5-Operation-008": "Bagaimanakah operasi MD5 berfungsi?",
    "MD5-PKI-025": "MD5 telah digunakan dalam Infrastruktur Kunci Awam (PKI) untuk mencipta tandatangan digital, walaupun penggunaannya sebahagian besarnya telah ditamatkan kerana kebimbangan keselamatan. Sijil yang ditandatangani dengan MD5 tidak lagi dipercayai oleh kebanyakan sistem moden.",
    "MD5-PasswordHashing-006": "Ia juga digunakan secara sejarah dalam pencincangan kata laluan tetapi kini dianggap tidak selamat kerana terdedah kepada perlanggaran dan mudah retak. Sistem moden telah beralih kepada alternatif yang lebih kukuh seperti bcrypt atau Argon2.",
    "MD5-Process-009": "MD5 beroperasi dengan memecahkan mesej input kepada ketulan dan menghantar setiap ketul melalui beberapa pusingan pemprosesan yang melibatkan fungsi logik, aritmetik modular dan operasi bitwise. Hasilnya digabungkan untuk menghasilkan nilai cincang 128-bit akhir.",
    "MD5-Purpose-003": "Tujuannya adalah untuk memastikan integriti data dengan menjana cap jari digital yang unik untuk mana-mana data yang diberikan. Sekiranya sedikit pun dalam data asal berubah, cincangan MD5 akan berbeza sama sekali.",
    "MD5-Relevance-029": "MD5 tidak dianggap selamat untuk tujuan kriptografi lagi, terutamanya untuk aplikasi baharu yang memerlukan rintangan perlanggaran atau integriti mesej yang kuat. Walau bagaimanapun, ia mungkin masih ditemui dalam sistem warisan atau aplikasi bukan kriptografi di mana kelajuan adalah keutamaan berbanding keselamatan.",
    "MD5-Rounds-010": "Algoritma ini terdiri daripada empat peringkat utama yang dilakukan pada keadaan dalaman 128-bit yang dimulakan dengan pemalar. Terdapat 64 pusingan pemprosesan secara keseluruhan, di mana setiap pusingan mengubah keadaan dalaman berdasarkan blok mesej input.",
    "MD5-Speed-013": "MD5 agak pantas, yang menjadikannya popular untuk aplikasi yang memerlukan pencincangan pantas.",
    "MD5-Standardization-014": "Ia telah diseragamkan secara meluas dan dilaksanakan dalam pelbagai bahasa dan platform pengaturcaraan, menjadikannya mudah untuk disepadukan ke dalam sistem dan alatan sedia ada.",
    "MD5-Summary-031": "Secara ringkasnya, apakah perkara penting yang perlu saya ingat tentang MD5?",
    "MD5-Summary-Point1-032": "MD5 ialah fungsi cincang kriptografi yang pantas tetapi tidak selamat yang terdedah kepada serangan perlanggaran.",
    "MD5-Summary-Point2-033": "Kegunaan utamanya adalah untuk memastikan integriti data dan untuk beberapa operasi kriptografi, tetapi sebahagian besarnya telah digantikan dengan alternatif yang lebih kukuh seperti SHA-256 dan BLAKE2.",
    "MD5-Summary-Point3-034": "Walaupun anda mungkin menghadapi MD5 dalam sistem warisan atau senario sensitif bukan keselamatan, adalah penting untuk mengelak daripada menggunakannya untuk sebarang projek baharu yang memerlukan keselamatan kriptografi.",
    "MD5-Transition-030": "Memandangkan algoritma yang lebih baharu dan lebih selamat seperti SHA-256 dan BLAKE2 tersedia secara meluas dan difahami dengan lebih baik, adalah disyorkan untuk beralih daripada MD5 dalam semua konteks di mana keselamatan menjadi kebimbangan.",
    "MD5-Usage-004": "Bagaimanakah MD5 digunakan dalam amalan?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) ialah alternatif yang digunakan secara meluas yang menawarkan keselamatan yang lebih kukuh daripada MD5. Ia menjana nilai cincang 256-bit yang lebih besar dan merupakan sebahagian daripada keluarga SHA-2.",
    "SHA-2_Info-022": "Maklumat SHA-2"
}