{
    "BLAKE2-021": "BLAKE2 é outra alternativa moderna que oferece velocidades mais rápidas em comparação ao SHA-2, mantendo altos níveis de segurança. Oferece múltiplas variantes, incluindo BLAKE2b e BLAKE2s.",
    "BLAKE2_Info-023": "Informações do BLAKE2",
    "MD5-Advantages-012": "Quais são as vantagens de usar MD5?",
    "MD5-AlgorithmDetails-011": "Detalhes do algoritmo MD5",
    "MD5-Alternatives-019": "Quais são algumas alternativas ao MD5 para hashing seguro?",
    "MD5-Applications-024": "Quais outros aplicativos usam ou usaram MD5?",
    "MD5-Breakdown-017": "Várias fraquezas criptográficas foram descobertas no MD5 ao longo do tempo, e os pesquisadores demonstraram exemplos práticos de criação de colisões, comprometendo ainda mais sua integridade e segurança.",
    "MD5-Collision-016": "MD5 é vulnerável a ataques de colisão, o que significa que duas entradas diferentes podem produzir a mesma saída hash. Isso o torna inseguro para aplicativos como assinaturas digitais ou armazenamento de senhas.",
    "MD5-CollisionExample-007": "Exemplo de colisão MD5",
    "MD5-DataIntegrity-026": "Também era comumente usado para verificar a integridade dos dados durante a transmissão e armazenamento, como ao usar o rsync para sincronização de arquivos ou soma de verificação de grandes conjuntos de dados.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) é uma função hash criptográfica amplamente utilizada que recebe uma mensagem de entrada e produz um valor hash de tamanho fixo de 128 bits.",
    "MD5-DigitalSignature-Risks-027": "Riscos do uso de MD5 para assinaturas digitais",
    "MD5-Disadvantages-015": "Quais são as desvantagens e preocupações de segurança do MD5?",
    "MD5-FAQ-001": "O que é MD5?",
    "MD5-FileChecksum-005": "MD5 é frequentemente usado para verificar a integridade de arquivos ao baixar software ou arquivos grandes. Ele gera uma soma de verificação que pode ser comparada àquela fornecida pela fonte para garantir que o arquivo baixado não foi adulterado.",
    "MD5-Future-028": "O MD5 ainda é relevante hoje?",
    "MD5-InsecurityExamples-018": "Exemplos de detalhamento de segurança MD5",
    "MD5-Operation-008": "Como funciona a operação MD5?",
    "MD5-PKI-025": "O MD5 tem sido usado em Infraestrutura de Chave Pública (PKI) para criar assinaturas digitais, embora seu uso tenha sido em grande parte obsoleto devido a questões de segurança. Os certificados assinados com MD5 não são mais confiáveis ​​pela maioria dos sistemas modernos.",
    "MD5-PasswordHashing-006": "Também foi historicamente usado em hash de senhas, mas agora é considerado inseguro devido à sua vulnerabilidade a colisões e facilidade de quebra. Os sistemas modernos migraram para alternativas mais fortes, como bcrypt ou Argon2.",
    "MD5-Process-009": "O MD5 opera dividindo a mensagem de entrada em partes e passando cada parte por várias rodadas de processamento envolvendo funções lógicas, aritmética modular e operações bit a bit. O resultado é concatenado para produzir o valor hash final de 128 bits.",
    "MD5-Purpose-003": "Seu objetivo é garantir a integridade dos dados, gerando uma impressão digital exclusiva para quaisquer dados. Se mesmo um único bit nos dados originais mudar, o hash MD5 será completamente diferente.",
    "MD5-Relevance-029": "O MD5 não é mais considerado seguro para fins criptográficos, especialmente para novos aplicativos que exigem resistência a colisões ou forte integridade de mensagens. No entanto, ainda pode ser encontrado em sistemas legados ou aplicações não criptográficas onde a velocidade é uma prioridade sobre a segurança.",
    "MD5-Rounds-010": "O algoritmo consiste em quatro estágios principais executados em um estado interno de 128 bits que é inicializado com constantes. São 64 rodadas de processamento no total, onde cada rodada transforma o estado interno com base nos blocos de mensagens de entrada.",
    "MD5-Speed-013": "O MD5 é relativamente rápido, o que o tornou popular para aplicações onde o hash rápido era essencial.",
    "MD5-Standardization-014": "Foi amplamente padronizado e implementado em diversas linguagens e plataformas de programação, facilitando a integração em sistemas e ferramentas existentes.",
    "MD5-Summary-031": "Em resumo, quais pontos-chave devo lembrar sobre o MD5?",
    "MD5-Summary-Point1-032": "MD5 é uma função hash criptográfica rápida, mas insegura, suscetível a ataques de colisão.",
    "MD5-Summary-Point2-033": "Seus principais usos eram para garantir a integridade dos dados e para algumas operações criptográficas, mas foi amplamente substituído por alternativas mais fortes, como SHA-256 e BLAKE2.",
    "MD5-Summary-Point3-034": "Embora você possa encontrar o MD5 em sistemas legados ou em cenários não sensíveis à segurança, é crucial evitar usá-lo em novos projetos que exijam segurança criptográfica.",
    "MD5-Transition-030": "À medida que algoritmos mais novos e mais seguros, como SHA-256 e BLAKE2, se tornam amplamente disponíveis e melhor compreendidos, é recomendável fazer a transição do MD5 em todos os contextos onde a segurança é uma preocupação.",
    "MD5-Usage-004": "Como o MD5 é usado na prática?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) é uma alternativa amplamente utilizada que oferece segurança mais forte que o MD5. Ele gera um valor hash maior de 256 bits e faz parte da família SHA-2.",
    "SHA-2_Info-022": "Informações SHA-2"
}