{
    "JSON-Advantages-011": "JSON è generalmente più piccolo e più veloce da analizzare rispetto a XML, rendendolo ideale per la comunicazione client-server in cui la larghezza di banda e la velocità sono cruciali.",
    "JSON-Basics-001": "Cos'è JSON?",
    "JSON-Beautify-007": "Cos'è l'abbellimento JSON?",
    "JSON-Beautify-Def-008": "L'abbellimento JSON si riferisce al processo di formattazione dei dati JSON in un formato più leggibile dall'uomo con rientro e interruzioni di riga corretti, semplificando l'analisi e il debug.",
    "JSON-Beautify-Example-009": "Prima: '{\\\"key\\\":\\\"value\\\",\\\"array\\\":[1,2,3]}', Dopo: '{\\n \\\"key\\\": \\\"value\\\", \\n \\\"array\\\": [\\n 1,\\n 2,\\n 3\\n ]\\n}'",
    "JSON-Def-002": "JSON (JavaScript Object Notation) è un formato di interscambio di dati leggero e basato su testo, facile da leggere e scrivere per gli esseri umani e facile da analizzare e generare per le macchine.",
    "JSON-JavaScript-Support-020": "JSON è supportato nativamente da JavaScript tramite gli oggetti globali `JSON.parse()` e `JSON.stringify()`. Qualsiasi JSON valido è anche un oggetto o array letterale JavaScript valido, che consente la conversione senza interruzioni tra i due formati.",
    "JSON-JavaScript-Usage-021": "Nello sviluppo web, JSON viene comunemente utilizzato per richieste AJAX, rendering lato server e archiviazione di dati (ad esempio, archiviazione locale o IndexedDB).",
    "JSON-Linting-022": "Cos'è l'linting JSON e perché è importante?",
    "JSON-Linting-Benefit-024": "I linter possono prevenire errori di runtime dovuti a JSON non validi, garantendo uno scambio di dati fluido e risparmiando tempo nel debug di potenziali problemi.",
    "JSON-Linting-Explanation-023": "L'linting JSON è il processo di verifica se un documento JSON aderisce alla specifica JSON. Aiuta a identificare gli errori di sintassi prima di tentare di analizzare i dati.",
    "JSON-Path-013": "Cos'è il percorso JSON?",
    "JSON-Path-Example-015": "$.store.book[0].title seleziona il titolo del primo libro in un oggetto JSON con un negozio che contiene l'array di libri.",
    "JSON-Path-Explanation-014": "JSON Path è un linguaggio di query simile a XPath per XML, che consente di estrarre dati da documenti JSON utilizzando una notazione simile a un percorso.",
    "JSON-Path-Guide": "JSONPath: XPath per JSON",
    "JSON-Purpose-003": "Viene utilizzato principalmente per trasmettere dati tra un server e un'applicazione web come alternativa a XML, con supporto nativo in JavaScript tramite i metodi `JSON.parse()` e `JSON.stringify()`.",
    "JSON-Scope-in-JavaScript-019": "Come si inserisce JSON in JavaScript?",
    "JSON-Security-025": "Quali sono alcuni problemi di sicurezza quando si lavora con JSON?",
    "JSON-Security-Impact-026": "I potenziali rischi per la sicurezza includono attacchi JSON injection, in cui vengono inviati dati dannosi che potrebbero causare comportamenti non desiderati quando analizzati/eseguiti.",
    "JSON-Security-Prevention-027": "Per mitigare questi rischi, disinfetta sempre l'input dell'utente e utilizza librerie che analizzano in modo sicuro JSON senza eseguirne il contenuto (come JSON.parse() integrato in JavaScript). Inoltre, evitare di utilizzare eval() per l'analisi di JSON.",
    "JSON-Serialization-016": "Cos'è la serializzazione e la deserializzazione JSON?",
    "JSON-Serialization-Def-017": "La serializzazione JSON è il processo di conversione di un oggetto JavaScript in una stringa JSON, mentre la deserializzazione è il contrario: trasformare una stringa JSON in un oggetto JavaScript.",
    "JSON-Serialization-W3Schools": "Serializzazione JSON su W3Schools",
    "JSON-Syntax-004": "Qual è la sintassi di base di JSON?",
    "JSON-Syntax-Example-f005": "Un oggetto JSON è costituito da coppie chiave-valore racchiuse tra parentesi graffe {0}. Ogni chiave deve essere una stringa racchiusa tra virgolette doppie, seguita da due punti e quindi dal relativo valore.",
    "JSON-Syntax-Reference": "Documenti Web MDN su JSON",
    "JSON-Value-Types-006": "I valori possono essere stringhe, numeri, booleani, matrici (racchiusi tra parentesi quadre",
    "JSON-vs-XML-010": "Come si confronta JSON con XML?",
    "JSON-vs-XML-Article": "Confronto tra JSON e XML",
    "MDN-JSON-in-JavaScript": "Documenti Web MDN - Lavorare con JSON",
    "OWASP-JSON-Injection": "OWASP - Iniezione JSON",
    "XML-Advantages-012": "XML fornisce maggiore flessibilità strutturale e supporta gli spazi dei nomi, il che può essere utile per strutture di documenti complesse e interoperabilità tra sistemi."
}