{
    "R_S7_CLAo": "Příklad: Ke kódování 'TEST12345' v Base32 můžete použít knihovny jako base32-encode v Node.js nebo vestavěné funkce v jiných jazycích, jako je base64.b32encode Pythonu.",
    "a4s6x": "Jak Base32 funguje?",
    "a8b7z": "Výplň je tedy nutná pouze v případě, že poslední skupina kódovaných bitů není dělitelná 40 bity (protože 8 znaků Base32 představuje 40 bitů). Výplň se bude skládat z nula až šesti znaků '=' na konci zakódovaného řetězce.",
    "b8g2k": "Scénáře použití pro Base32",
    "c0v2p": "Běžné operace s Base32",
    "d1x7v": "Dalším příkladem je Git, kde jsou hashované objekty někdy uloženy ve formátu Base32, aby se předešlo problémům s koncovkami řádků a omezeními souborů. HashiCorp Vault také používá Base32 pro odvození klíče.",
    "d9w7m": "Navíc, protože používá pouze velká písmena, nemůže využívat všechny možné kombinace rozlišení malých a velkých písmen jako dodatečné bezpečnostní opatření, jako Base64 někdy dělá se skládáním malých a velkých písmen během dekódování.",
    "e5c7r": "Base32 je schéma binárního kódování na text, které představuje data v řetězci ASCII pomocí podmnožiny 32 znaků. Je navržen tak, aby byl čitelný pro člověka a bezpečný pro URL.",
    "f0q4w": "Jedním z populárních scénářů použití je generování tajných klíčů pro dvoufaktorové ověřování (2FA), kde služby jako Google Authenticator a Yubikey používají tajemství kódovaná Base32.",
    "f5a0s": "Base32 navíc produkuje delší výstup, ale může být vhodnější pro specifické aplikace, jako jsou názvy souborů, kvůli nedostatku speciálních znaků, které by mohly být v rozporu s pravidly souborového systému.",
    "g8r3e": "Hlavní nevýhodou Base32 je relativně nízká prostorová efektivita; rozšiřuje vstupní data přibližně o 25 % více než Base64. To znamená, že pro stejné množství kódovaných dat zabere více místa nebo šířky pásma.",
    "h4e1b": "Je také užitečné v situacích, kdy se s alfanumerickými řetězci rozlišujícími velká a malá písmena manipuluje snadněji než s hexadecimálními nebo base64, které mohou obsahovat nealfanumerické znaky, které by mohly v určitých kontextech způsobit problémy (jako jsou adresy URL nebo názvy souborů).",
    "h9j3m": "Výplň v Base32",
    "i9o7k": "Výhody Base32 oproti Base64",
    "j1b5k": "Mezi nejběžnější operace zahrnující Base32 patří kódování binárních dat do řetězce Base32 a dekódování řetězce Base32 zpět do jeho původního binárního formátu.",
    "k7g0n": "V Base32 je každých 5 bitů vstupních dat mapováno na jeden z 32 znaků ze sady 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "l1p9z": "Co je Base32?",
    "m6d8b": "Každá 5bitová hodnota je reprezentována jedním znakem, což umožňuje efektivní kódování a dekódování pro systémy, které preferují práci s oktety (8bitové jednotky).",
    "n3e7r": "Historie Base32",
    "p9s5t": "Base32 byl vyvinut Douglasem Crockfordem, známým svými příspěvky k JavaScriptu, v roce 2001. Byl vytvořen jako spolehlivější alternativa k existujícím kódování, jako je Base64, zejména pro situace vyžadující textové reprezentace binárních dat.",
    "q2w5m": "Účel použití Base32?",
    "s5t0n": "Výplň v Base32 zahrnuje přidání znaků '=', aby bylo zajištěno, že poslední část zakódovaných dat stále obsahuje násobek 8 bitů. Na rozdíl od Base64 je však odsazení Base32 minimální, protože každý znak Base32 již kóduje 5 bitů.",
    "t8z1v": "Když na konci nezbývá dostatek bitů k vyplnění celé 5bitové skupiny, jsou přidány výplňové znaky '='. Například bajt vyžaduje dva znaky Base32 a 3bajtová sekvence by potřebovala čtyři znaky Base32.",
    "u3j9p": "Base32 se často používá, když potřebujete kompaktní textovou reprezentaci binárních dat, která lze psát nebo tisknout bez ztráty informací, jako je kontrola integrity souborů, geocaching a bezpečné generování hesel.",
    "y6t1n": "Nevýhody Base32",
    "z2x8c": "Base32 má méně vizuálních nejednoznačností, protože používá pouze velká písmena a číslice, což usnadňuje čtení a přepis ručně nebo po telefonu ve srovnání s Base64, který obsahuje '+', '/' a malá písmena.",
    "z6m1c": "Pozdější variace jako z-base-32 byly představeny ke zlepšení použitelnosti, nahrazovat některé méně zapamatovatelné postavy jinými, ale Crockfordova původní specifikace zůstává dnes široce používána."
}