{
    "BLAKE2-021": "BLAKE2 es otra alternativa moderna que proporciona velocidades más rápidas en comparación con SHA-2 manteniendo altos niveles de seguridad. Ofrece múltiples variantes, incluidas BLAKE2b y BLAKE2.",
    "BLAKE2_Info-023": "BLAKE2 Información",
    "MD5-Advantages-012": "¿Cuáles son las ventajas de utilizar MD5?",
    "MD5-AlgorithmDetails-011": "Detalles del algoritmo MD5",
    "MD5-Alternatives-019": "¿Cuáles son algunas alternativas a MD5 para hash seguro?",
    "MD5-Applications-024": "¿Qué otras aplicaciones usan o han usado MD5?",
    "MD5-Breakdown-017": "A lo largo del tiempo se han descubierto varias debilidades criptográficas en MD5 y los investigadores han demostrado ejemplos prácticos de creación de colisiones, comprometiendo aún más su integridad y seguridad.",
    "MD5-Collision-016": "MD5 es vulnerable a ataques de colisión, lo que significa que dos entradas diferentes pueden producir la misma salida hash. Esto lo hace inseguro para aplicaciones como firmas digitales o almacenamiento de contraseñas.",
    "MD5-CollisionExample-007": "Ejemplo de colisión MD5",
    "MD5-DataIntegrity-026": "También se usaba comúnmente para verificar la integridad de los datos durante la transmisión y el almacenamiento, como cuando se usaba rsync para la sincronización de archivos o la suma de verificación de grandes conjuntos de datos.",
    "MD5-Def-002": "MD5 (Algoritmo 5 de resumen de mensajes) es una función hash criptográfica ampliamente utilizada que toma un mensaje de entrada y produce un valor hash de 128 bits de tamaño fijo.",
    "MD5-DigitalSignature-Risks-027": "Riesgos de utilizar MD5 para firmas digitales",
    "MD5-Disadvantages-015": "¿Cuáles son las desventajas y problemas de seguridad con MD5?",
    "MD5-FAQ-001": "¿Qué es MD5?",
    "MD5-FileChecksum-005": "MD5 se utiliza a menudo para verificar la integridad de los archivos al descargar software o archivos grandes. Genera una suma de verificación que se puede comparar con la proporcionada por la fuente para garantizar que el archivo descargado no haya sido manipulado.",
    "MD5-Future-028": "¿MD5 sigue siendo relevante hoy en día?",
    "MD5-InsecurityExamples-018": "Ejemplos de averías de seguridad MD5",
    "MD5-Operation-008": "¿Cómo funciona la operación MD5?",
    "MD5-PKI-025": "MD5 se ha utilizado en la infraestructura de clave pública (PKI) para crear firmas digitales, aunque su uso ha quedado obsoleto en gran medida debido a problemas de seguridad. La mayoría de los sistemas modernos ya no confían en los certificados firmados con MD5.",
    "MD5-PasswordHashing-006": "También se utilizó históricamente para el hash de contraseñas, pero ahora se considera inseguro debido a su vulnerabilidad a las colisiones y su facilidad de descifrado. Los sistemas modernos han pasado a alternativas más potentes como bcrypt o Argon2.",
    "MD5-Process-009": "MD5 opera dividiendo el mensaje de entrada en fragmentos y pasando cada fragmento a través de varias rondas de procesamiento que involucran funciones lógicas, aritmética modular y operaciones bit a bit. El resultado se concatena para producir el valor hash final de 128 bits.",
    "MD5-Purpose-003": "Su propósito es garantizar la integridad de los datos generando una huella digital única para cualquier dato determinado. Si cambia incluso un solo bit en los datos originales, el hash MD5 será completamente diferente.",
    "MD5-Relevance-029": "MD5 ya no se considera seguro para fines criptográficos, especialmente para nuevas aplicaciones que requieren resistencia a colisiones o una sólida integridad de los mensajes. Sin embargo, todavía se puede encontrar en sistemas heredados o aplicaciones no criptográficas donde la velocidad es una prioridad sobre la seguridad.",
    "MD5-Rounds-010": "El algoritmo consta de cuatro etapas principales realizadas en un estado interno de 128 bits que se inicializa con constantes. Hay 64 rondas de procesamiento en total, donde cada ronda transforma el estado interno en función de los bloques de mensajes de entrada.",
    "MD5-Speed-013": "MD5 es relativamente rápido, lo que lo hizo popular para aplicaciones donde el hash rápido era esencial.",
    "MD5-Standardization-014": "Se ha estandarizado e implementado ampliamente en varios lenguajes y plataformas de programación, lo que facilita su integración en sistemas y herramientas existentes.",
    "MD5-Summary-031": "En resumen, ¿qué puntos clave debo recordar sobre MD5?",
    "MD5-Summary-Point1-032": "MD5 es una función hash criptográfica rápida pero insegura, susceptible a ataques de colisión.",
    "MD5-Summary-Point2-033": "Sus usos principales eran garantizar la integridad de los datos y algunas operaciones criptográficas, pero ha sido reemplazado en gran medida por alternativas más potentes como SHA-256 y BLAKE2.",
    "MD5-Summary-Point3-034": "Si bien puede encontrar MD5 en sistemas heredados o escenarios no sensibles a la seguridad, es fundamental evitar su uso para proyectos nuevos que requieran seguridad criptográfica.",
    "MD5-Transition-030": "A medida que algoritmos más nuevos y seguros, como SHA-256 y BLAKE2, estén ampliamente disponibles y se comprendan mejor, se recomienda abandonar MD5 en todos los contextos donde la seguridad sea una preocupación.",
    "MD5-Usage-004": "¿Cómo se utiliza MD5 en la práctica?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) es una alternativa ampliamente utilizada que ofrece una seguridad más sólida que MD5. Genera un valor hash mayor de 256 bits y forma parte de la familia SHA-2.",
    "SHA-2_Info-022": "Información SHA-2"
}