{
    "BLAKE2-021": "BLAKE2 is een ander modern alternatief dat hogere snelheden biedt in vergelijking met SHA-2, terwijl het hoge beveiligingsniveau behouden blijft. Het biedt meerdere varianten, waaronder BLAKE2b en BLAKE2s.",
    "BLAKE2_Info-023": "BLAKE2-info",
    "MD5-Advantages-012": "Wat zijn de voordelen van het gebruik van MD5?",
    "MD5-AlgorithmDetails-011": "MD5-algoritmedetails",
    "MD5-Alternatives-019": "Wat zijn enkele alternatieven voor MD5 voor veilige hashing?",
    "MD5-Applications-024": "Welke andere toepassingen gebruiken of hebben MD5 gebruikt?",
    "MD5-Breakdown-017": "Er zijn in de loop van de tijd verschillende cryptografische zwakheden ontdekt in MD5, en onderzoekers hebben praktische voorbeelden gedemonstreerd van het creëren van botsingen, waardoor de integriteit en veiligheid ervan verder in gevaar worden gebracht.",
    "MD5-Collision-016": "MD5 is kwetsbaar voor botsingsaanvallen, wat betekent dat twee verschillende inputs dezelfde hash-output kunnen produceren. Dit maakt het onveilig voor toepassingen zoals digitale handtekeningen of wachtwoordopslag.",
    "MD5-CollisionExample-007": "MD5-botsingsvoorbeeld",
    "MD5-DataIntegrity-026": "Het werd ook vaak gebruikt om de integriteit van gegevens tijdens verzending en opslag te verifiëren, bijvoorbeeld bij het gebruik van rsync voor bestandssynchronisatie of het controleren van grote datasets.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) is een veelgebruikte cryptografische hashfunctie die een invoerbericht verwerkt en een 128-bits hashwaarde met een vaste grootte produceert.",
    "MD5-DigitalSignature-Risks-027": "Risico's van het gebruik van MD5 voor digitale handtekeningen",
    "MD5-Disadvantages-015": "Wat zijn de nadelen en veiligheidsproblemen van MD5?",
    "MD5-FAQ-001": "Wat is MD5?",
    "MD5-FileChecksum-005": "MD5 wordt vaak gebruikt om de bestandsintegriteit te verifiëren bij het downloaden van software of grote bestanden. Het genereert een controlesom die kan worden vergeleken met die van de bron om er zeker van te zijn dat er niet met het gedownloade bestand is geknoeid.",
    "MD5-Future-028": "Is MD5 vandaag de dag nog steeds relevant?",
    "MD5-InsecurityExamples-018": "Voorbeelden van MD5-beveiligingsanalyses",
    "MD5-Operation-008": "Hoe werkt de MD5-bediening?",
    "MD5-PKI-025": "MD5 is gebruikt in Public Key Infrastructure (PKI) voor het maken van digitale handtekeningen, hoewel het gebruik ervan grotendeels is verouderd vanwege veiligheidsoverwegingen. Met MD5 ondertekende certificaten worden door de meeste moderne systemen niet langer vertrouwd.",
    "MD5-PasswordHashing-006": "Het werd van oudsher ook gebruikt bij het hashen van wachtwoorden, maar wordt nu als onveilig beschouwd vanwege de kwetsbaarheid voor botsingen en het gemak waarmee het kan worden gekraakt. Moderne systemen zijn overgestapt op sterkere alternatieven zoals bcrypt of Argon2.",
    "MD5-Process-009": "MD5 werkt door het invoerbericht in stukjes op te splitsen en elk stuk door verschillende verwerkingsrondes te laten gaan, waarbij logische functies, modulaire rekenkunde en bitsgewijze bewerkingen betrokken zijn. Het resultaat wordt samengevoegd om de uiteindelijke 128-bits hashwaarde te produceren.",
    "MD5-Purpose-003": "Het doel ervan is om de gegevensintegriteit te waarborgen door voor alle gegevens een unieke digitale vingerafdruk te genereren. Als zelfs maar één bit in de originele gegevens verandert, zal de MD5-hash compleet anders zijn.",
    "MD5-Relevance-029": "MD5 wordt niet meer als veilig beschouwd voor cryptografische doeleinden, vooral niet voor nieuwe toepassingen die botsingsweerstand of een sterke berichtintegriteit vereisen. Het kan echter nog steeds worden aangetroffen in oudere systemen of niet-cryptografische toepassingen waarbij snelheid prioriteit heeft boven beveiliging.",
    "MD5-Rounds-010": "Het algoritme bestaat uit vier hoofdfasen die worden uitgevoerd op een interne status van 128 bits die wordt geïnitialiseerd met constanten. Er zijn in totaal 64 verwerkingsrondes, waarbij elke ronde de interne status transformeert op basis van de invoerberichtblokken.",
    "MD5-Speed-013": "MD5 is relatief snel, wat het populair maakte voor toepassingen waarbij snelle hashing essentieel was.",
    "MD5-Standardization-014": "Het is op grote schaal gestandaardiseerd en geïmplementeerd in verschillende programmeertalen en platforms, waardoor het gemakkelijk te integreren is in bestaande systemen en tools.",
    "MD5-Summary-031": "Samenvattend: welke belangrijke punten moet ik onthouden over MD5?",
    "MD5-Summary-Point1-032": "MD5 is een snelle maar onveilige cryptografische hashfunctie die vatbaar is voor botsingsaanvallen.",
    "MD5-Summary-Point2-033": "Het belangrijkste gebruik ervan was het waarborgen van de gegevensintegriteit en voor sommige cryptografische bewerkingen, maar het is grotendeels vervangen door sterkere alternatieven zoals SHA-256 en BLAKE2.",
    "MD5-Summary-Point3-034": "Hoewel je MD5 kunt tegenkomen in oudere systemen of in niet-beveiligingsgevoelige scenario's, is het van cruciaal belang om het gebruik ervan te vermijden voor nieuwe projecten die cryptografische beveiliging vereisen.",
    "MD5-Transition-030": "Naarmate nieuwere, veiligere algoritmen zoals SHA-256 en BLAKE2 algemeen beschikbaar worden en beter worden begrepen, wordt het aanbevolen om over te stappen van MD5 in alle contexten waar beveiliging een probleem is.",
    "MD5-Usage-004": "Hoe wordt MD5 in de praktijk gebruikt?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) is een veelgebruikt alternatief dat een sterkere beveiliging biedt dan MD5. Het genereert een grotere 256-bit hashwaarde en maakt deel uit van de SHA-2-familie.",
    "SHA-2_Info-022": "SHA-2-info"
}