{
    "BLAKE2-021": "BLAKE2 là một giải pháp thay thế hiện đại khác cung cấp tốc độ nhanh hơn so với SHA-2 trong khi vẫn duy trì mức độ bảo mật cao. Nó cung cấp nhiều biến thể bao gồm BLAKE2b và BLAKE2s.",
    "BLAKE2_Info-023": "Thông tin BLAKE2",
    "MD5-Advantages-012": "Ưu điểm của việc sử dụng MD5 là gì?",
    "MD5-AlgorithmDetails-011": "Chi tiết thuật toán MD5",
    "MD5-Alternatives-019": "Một số lựa chọn thay thế cho MD5 để băm an toàn là gì?",
    "MD5-Applications-024": "Những ứng dụng nào khác sử dụng hoặc đã sử dụng MD5?",
    "MD5-Breakdown-017": "Một số điểm yếu về mật mã đã được phát hiện trong MD5 theo thời gian và các nhà nghiên cứu đã chứng minh các ví dụ thực tế về việc tạo ra xung đột, làm tổn hại thêm đến tính toàn vẹn và bảo mật của nó.",
    "MD5-Collision-016": "MD5 dễ bị tấn công va chạm, nghĩa là hai đầu vào khác nhau có thể tạo ra cùng một đầu ra băm. Điều này làm cho nó không an toàn đối với các ứng dụng như chữ ký số hoặc lưu trữ mật khẩu.",
    "MD5-CollisionExample-007": "Ví dụ về va chạm MD5",
    "MD5-DataIntegrity-026": "Nó cũng thường được sử dụng để xác minh tính toàn vẹn của dữ liệu trong quá trình truyền và lưu trữ, chẳng hạn như khi sử dụng rsync để đồng bộ hóa tệp hoặc kiểm tra tổng các bộ dữ liệu lớn.",
    "MD5-Def-002": "MD5 (Thuật toán tiêu hóa thông báo 5) là hàm băm mật mã được sử dụng rộng rãi, nhận thông báo đầu vào và tạo ra giá trị băm 128 bit có kích thước cố định.",
    "MD5-DigitalSignature-Risks-027": "Rủi ro khi sử dụng MD5 cho chữ ký số",
    "MD5-Disadvantages-015": "Những nhược điểm và mối lo ngại về bảo mật với MD5 là gì?",
    "MD5-FAQ-001": "MD5 là gì?",
    "MD5-FileChecksum-005": "MD5 thường được sử dụng để xác minh tính toàn vẹn của tệp khi tải xuống phần mềm hoặc tệp lớn. Nó tạo ra một tổng kiểm tra có thể so sánh với tổng kiểm tra được cung cấp bởi nguồn để đảm bảo tệp đã tải xuống không bị giả mạo.",
    "MD5-Future-028": "Ngày nay MD5 có còn phù hợp không?",
    "MD5-InsecurityExamples-018": "Ví dụ về sự cố bảo mật MD5",
    "MD5-Operation-008": "Hoạt động của MD5 hoạt động như thế nào?",
    "MD5-PKI-025": "MD5 đã được sử dụng trong Cơ sở hạ tầng khóa công khai (PKI) để tạo chữ ký số, mặc dù việc sử dụng nó phần lớn không được chấp nhận do lo ngại về bảo mật. Các chứng chỉ được ký bằng MD5 không còn được hầu hết các hệ thống hiện đại tin cậy nữa.",
    "MD5-PasswordHashing-006": "Trước đây, nó cũng được sử dụng để băm mật khẩu nhưng hiện được coi là không an toàn do dễ bị va chạm và dễ bị bẻ khóa. Các hệ thống hiện đại đã chuyển sang các lựa chọn thay thế mạnh mẽ hơn như bcrypt hoặc Argon2.",
    "MD5-Process-009": "MD5 hoạt động bằng cách chia nhỏ thông báo đầu vào thành các đoạn và chuyển từng đoạn qua một số vòng xử lý liên quan đến các hàm logic, số học mô-đun và các phép toán theo bit. Kết quả được nối để tạo ra giá trị băm 128 bit cuối cùng.",
    "MD5-Purpose-003": "Mục đích của nó là đảm bảo tính toàn vẹn của dữ liệu bằng cách tạo dấu vân tay kỹ thuật số duy nhất cho bất kỳ dữ liệu nhất định nào. Nếu thậm chí một bit trong dữ liệu gốc thay đổi, hàm băm MD5 sẽ hoàn toàn khác.",
    "MD5-Relevance-029": "MD5 không còn được coi là an toàn cho mục đích mã hóa nữa, đặc biệt đối với các ứng dụng mới yêu cầu khả năng chống va chạm hoặc tính toàn vẹn của thông điệp mạnh mẽ. Tuy nhiên, nó vẫn có thể được tìm thấy trong các hệ thống cũ hoặc các ứng dụng không phải mật mã, nơi tốc độ được ưu tiên hơn bảo mật.",
    "MD5-Rounds-010": "Thuật toán bao gồm bốn giai đoạn chính được thực hiện trên trạng thái bên trong 128 bit được khởi tạo bằng các hằng số. Tổng cộng có 64 vòng xử lý, trong đó mỗi vòng biến đổi trạng thái bên trong dựa trên các khối thông báo đầu vào.",
    "MD5-Speed-013": "MD5 tương đối nhanh, điều này khiến nó trở nên phổ biến đối với các ứng dụng cần băm nhanh.",
    "MD5-Standardization-014": "Nó đã được chuẩn hóa và triển khai rộng rãi bằng nhiều ngôn ngữ lập trình và nền tảng khác nhau, giúp dễ dàng tích hợp vào các hệ thống và công cụ hiện có.",
    "MD5-Summary-031": "Tóm lại, tôi nên nhớ những điểm chính nào về MD5?",
    "MD5-Summary-Point1-032": "MD5 là hàm băm mật mã nhanh nhưng không an toàn, dễ bị tấn công xung đột.",
    "MD5-Summary-Point2-033": "Công dụng chính của nó là đảm bảo tính toàn vẹn dữ liệu và cho một số hoạt động mã hóa, nhưng phần lớn nó đã được thay thế bằng các lựa chọn thay thế mạnh hơn như SHA-256 và BLAKE2.",
    "MD5-Summary-Point3-034": "Mặc dù bạn có thể gặp MD5 trong các hệ thống cũ hoặc các tình huống nhạy cảm không bảo mật nhưng điều quan trọng là tránh sử dụng nó cho bất kỳ dự án mới nào yêu cầu bảo mật bằng mật mã.",
    "MD5-Transition-030": "Khi các thuật toán mới hơn, an toàn hơn như SHA-256 và BLAKE2 trở nên phổ biến rộng rãi và được hiểu rõ hơn, bạn nên chuyển đổi khỏi MD5 trong mọi bối cảnh mà vấn đề bảo mật là mối lo ngại.",
    "MD5-Usage-004": "MD5 được sử dụng trong thực tế như thế nào?",
    "SHA-256-020": "SHA-256 (Thuật toán băm an toàn) là một giải pháp thay thế được sử dụng rộng rãi mang lại khả năng bảo mật mạnh hơn MD5. Nó tạo ra giá trị băm 256-bit lớn hơn và là một phần của họ SHA-2.",
    "SHA-2_Info-022": "Thông tin SHA-2"
}