{
    "-8l11": "คัดลอกแล้ว",
    "-AaO4jF3Q": "ถึง {0}",
    "-DqwwR": "การดำเนินการเสร็จสมบูรณ์",
    "-GJ_72": "สลับไปยังพื้นที่ทำงานที่เลือก {0}",
    "-Jx4J": "บัญชีท้องถิ่น",
    "-Rj3y": "ธีมส์",
    "-XZnW": "กลับ",
    "-Yo1q29Iq": "เครื่องมือข้อความ",
    "-nL_B5PoN": "บีบอัด {0}",
    "01do0y": "กันนาดา",
    "04SSf": "ลืมรหัสผ่าน?",
    "07naT": "ข้อผิดพลาด: {0}",
    "0Ceqru": "Base64 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์ที่จำกัด ซึ่งมนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์",
    "0MO3jj": "MD5 (Message-Digest 5) เป็นฟังก์ชันแฮชที่ใช้กันอย่างแพร่หลาย มีการนำไปใช้ในแอปพลิเคชันความปลอดภัยที่หลากหลาย และยังใช้กันทั่วไปเพื่อตรวจสอบความสมบูรณ์ของไฟล์อีกด้วย อย่างไรก็ตาม MD5 ไม่ป้องกันการชนกัน และไม่เหมาะสำหรับแอปพลิเคชัน เช่น ใบรับรอง SSL/TLS หรือลายเซ็นดิจิทัลที่ต้องอาศัยคุณสมบัตินี้",
    "0MO3jj.yaml": "YAML (YAML ไม่ใช่ภาษามาร์กอัป) เป็นรูปแบบข้อมูลที่มนุษย์อ่านได้ ซึ่งนำแนวคิดจากภาษาการเขียนโปรแกรม เช่น C, Perl และ Python และแนวคิดจาก XML และรูปแบบข้อมูลของจดหมายอิเล็กทรอนิกส์ (RFC 2822)",
    "0NSerY3oe": "เข้ารหัสอักขระพิเศษทั้งหมด",
    "0PgZ_": "การแปล",
    "0YKce": "แปลงสตริง Binary-Coded Decimal (BCD) ให้เป็นเลขทศนิยม",
    "0gvcN": "ยินดีต้อนรับสู่หน้าภาพรวม มันยังอยู่ระหว่างการพัฒนา",
    "0kAE9UfwP": "แปลงข้อมูลอินพุตเป็นไบนารี",
    "0mYyJJ6Ta": "ไม่สามารถดำเนินการได้ในขณะนี้ โปรดลองอีกครั้งในภายหลัง",
    "0pfdz7": "อุซเบก",
    "0yNpSzyRG": "ฐานสิบหก",
    "1-geODUv-": "จาก {0}",
    "13pmE": "สนับสนุนเรา",
    "1507oa": "เบงกาลี",
    "19ax79Rtb": "แปลงตัวเลขเป็นทศนิยม",
    "1IrWC1qw": "ซ่อนแผงด้านล่าง",
    "1JOFP": "เปิดพื้นที่ทำงานของฉัน",
    "1NTgQ": "เปิดพื้นที่ทำงาน",
    "1Npez": "กรุณาระบุเส้นทาง",
    "1QDzaLKp0": "แปลรหัสมอร์สเป็นอักขระตัวอักษรและตัวเลข (ตัวพิมพ์ใหญ่)",
    "1SKQFHzt2": "แปลงตัวเลขเป็นไบนารี",
    "1Tuab": "คัดลอกแล้ว",
    "1X8x7": "ตัวอย่าง",
    "1X8x7dqw": "CSV เป็น JSON",
    "1Xdsqwqw": "โปรแกรมดู JSON",
    "1Xe82x7": "{0} ลดขนาด",
    "1Xe8wx7": "สตริงเลขฐานสิบหก",
    "1Xe8x7": "{0} ตกแต่งให้สวยงาม",
    "1Xe8x7qe": "บีซีดี",
    "1YmJc": "เลือกหนึ่งในตัวเลือกเป็นภาษาที่คุณต้องการ:",
    "1bd": "ขั้นตอนการทำงาน",
    "1e3e5n": "เฮาซา",
    "1fd8x7dqw": "ลบหมายเลขบรรทัด",
    "1h6jH": "คำเตือน ผลลัพธ์เป็นค่าว่างซึ่งมีความยาวเป็นศูนย์!",
    "1j62a": "ทำเช่นนี้ในเวลาอื่น",
    "1jj0ri": "ญี่ปุ่น",
    "1k_44": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII Base64 กลับเป็นรูปแบบ Raw",
    "1th2nw": "สิงหล",
    "20nmcv": "ละติน",
    "22XLF": "ยังไม่เสร็จ",
    "24vLI": "สร้าง",
    "27j7sy": "โชนา",
    "2D9a6": "ลืมรหัสผ่าน?",
    "2D9qdk6": "ปลอดภัยเพียงพอหรือไม่?",
    "2IF6A": "ดูเหมือนว่า forge save storage จะประสบปัญหาบางอย่าง",
    "2JyFN": "คัดลอกผลลัพธ์ไปยังคลิปบอร์ด",
    "2Ocbey": "เวอร์ชัน",
    "2RhAT": "ดูเหมือนว่ากระบวนการฟอร์จดึงข้อมูลจะประสบปัญหาบางอย่าง",
    "2Ruh6": "สร้างบัญชีท้องถิ่นใหม่",
    "2S5ap": "สลับโหมดเต็มหน้าจอ",
    "2Va7Txc-V": "เช่นเดียวกับยูทิลิตี้ส่วนท้ายของ UNIX<br>รับ n บรรทัดสุดท้าย<br>คุณสามารถเลือกทุกบรรทัดหลังจากบรรทัด n โดยการป้อนค่าลบสำหรับ n<br>ตัวคั่นสามารถเปลี่ยนแปลงได้ แทนที่จะใช้บรรทัด ฟิลด์ (เช่น จุลภาค) จะถูกเลือกแทน",
    "2Y2Y2Yd2Y2": "ฐาน64",
    "2Y2Y2eeeqY2Y2": "{0} ฟอร์แมตเตอร์",
    "2Y2Y2eqY2Y2": "ตัวจัดรูปแบบ SQL",
    "2Y2Y2qY2": "ตัวจัดรูปแบบ JavaScript",
    "2Y2Y2qYd2Y2": "ฟอร์แมตมาร์กดาวน์",
    "2Y2Y2qdqY2": "ตัวย่อ JavaScript",
    "2Y2Y2qqY2Y2": "ตัวจัดรูปแบบ TypeScript",
    "2Y2YY2": "ตัวย่อ SQL",
    "2Y2eY2dfY2Y2": "เข้ารหัส {0}",
    "2Y2eq2": "ตัวย่อ HTML",
    "2Y2eqY2Y2Y2": "ตัวจัดรูปแบบ HTML",
    "2Yd2Y2Y2Y2": "CSS ฟอร์แมตเตอร์",
    "2Ye2Y2Y2": "ตัวย่อ CSS",
    "2Ye2Yqw2qY2Y2": "{0} ฟอร์แมตเตอร์",
    "2Ye2dqeY2qY2Y2": "ตัวจัดรูปแบบ GraphQL",
    "2Yq2eqY2Y2": "ตัวแยกวิเคราะห์ SQL",
    "2bdqHk": "ไฟล์",
    "2e4fb7": "อิกโบ",
    "2giYv": "ทดสอบรหัสผ่าน: {0}",
    "2khdsv": "ปาสโต้",
    "2lehqwp": "ภาษาเวียดนาม",
    "2lhcqwp": "ภาษาตุรกี",
    "2lhqqwp": "ชาวอินโดนีเซีย",
    "2lhqqwqp": "มาเลย์",
    "2lhqwwp": "แบบไทย",
    "2qdin8": "กรุณากรอกรหัสยืนยัน",
    "2tib5m": "ภาษาสวีเดน",
    "2ybu7j": "ภาษานอร์เวย์",
    "30eo2v": "คุชราต",
    "32D9a6": "สร้างบัญชี",
    "33RXi": "คำขอถูกปฏิเสธเนื่องจากพารามิเตอร์ที่ไม่น่าพอใจ",
    "346qid": "ภาษารัสเซีย",
    "397ncs757": "เยื้องและปรับแต่งโค้ด TypeScript",
    "39dsCt": "คุณจะได้รับการแจ้งเตือนล่าสุดจากบริการแอพหากมี",
    "3HtA3k6Qs": "URL ปลอดภัย",
    "3TMOUekhZl": "รูปแบบ {0}",
    "3TMOUkhZl": "รูปแบบ {0}",
    "3XstvdK": "กำลังโหลดการดำเนินการด่วนที่เลือก...",
    "3g_qIW2dZ": "ถึงทศนิยม",
    "3ii2tt": "เกลิคสกอต",
    "3tsHVcKoI": "ลบหมายเลขบรรทัดออกจากจุดเริ่มต้นของแต่ละบรรทัดในข้อความ",
    "3umnB": "โทเค็นที่ไม่รู้จัก",
    "438yFc2HZ": "ลอยเครื่องมือนี้",
    "441oja": "จอร์เจีย",
    "44Ntqw-": "จัดการการดำเนินงาน",
    "459Imii79": "{0} เครื่องกำเนิด",
    "46bksi": "ลิทัวเนีย",
    "4Bcqo4Q": "ตกลง รีเซ็ต เสร็จสิ้น!",
    "4K_vhq": "ทำซ้ำแท็บนี้",
    "4M4U_9uBm": "สลับอินพุตและเอาต์พุต",
    "4PIqD": "รีวิวโค้ด",
    "4UYIJ": "ยังไม่แล้วเสร็จ.",
    "4cGA_": "กำลังดึงข้อมูลสำหรับการตั้งค่าระบบ...",
    "4kKe4": "รหัสผ่านของคุณ",
    "4tqb4x": "ภาษาฮังการี",
    "4vdfwf": "ตกลง",
    "4wlih": "คำขอถูกปฏิเสธเนื่องจากพารามิเตอร์ที่ไม่น่าพอใจ",
    "52OiQ": "คัดลอก {0} ครั้ง",
    "54cwb": "System Websocket API พบข้อผิดพลาด: {0}",
    "56iah1S9Y": "ลบช่องว่างออกจากจุดเริ่มต้นและจุดสิ้นสุดของข้อความ",
    "56ibcj": "ภาษาเวียดนาม",
    "58HQX": "หากคุณไม่ทราบคุณค่าของมัน โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอรายละเอียดเพิ่มเติม ซึ่งสามารถพบได้ในการตั้งค่าของเขา",
    "5BOhl": "รหัสการเชิญ",
    "5IGyvG7nO": "ตัวคั่นเซลล์",
    "5Ih2u": "เครื่องมือนาวิเกเตอร์",
    "5NCPT": "โหมดมืด",
    "5NJeGsu1": "อีเมล คุณสามารถจัดระเบียบกล่องจดหมายของคุณ เขียนและส่งข้อความ และติดตามการติดต่อสื่อสารของคุณได้อย่างง่ายดาย ถึงตอนนี้จะใช้เป็นเครื่องมือสื่อสารระหว่างผู้ใช้กับทีมงานของเราเท่านั้น",
    "5NJeddqGsu1": "ส่วนนี้ประกอบด้วยเอกสารเกี่ยวกับคอมพิวเตอร์ บทความ wiki คู่มือการใช้งาน และอื่นๆ",
    "5NJedqddqGsu1": "ส่วนนี้ประกอบด้วยทรัพยากรคอมพิวเตอร์ที่สามารถใช้ในการสร้างโครงการของคุณเอง",
    "5Perd": "ขออภัย ฟังก์ชัน 'ใช้ตัวแก้ไขอัจฉริยะ' ยังไม่พร้อมใช้งาน เรายังคงดำเนินการเพื่อนำไปปฏิบัติ ขอขอบคุณสำหรับความอดทนของคุณ.",
    "5RPdtVff3": "จาก เลขฐานสิบหก",
    "5ZBYR": "กลับ",
    "5_EPRncIx": "ซ่อนนาวิเกเตอร์ด้านซ้าย",
    "5dF7o": "รีเฟรช",
    "5eXVS": "เนื้อหาสคริปต์",
    "5ggegx": "เกาหลี",
    "5lW8qp": "แสดงตัวอย่างสำหรับเครื่องมือนี้",
    "5q-Zxqa": "ผู้จัดการสคริปต์",
    "5qPOJL": "เพื่อสนับสนุน LafTools ลองพิจารณาให้ดาวแก่พื้นที่เก็บข้อมูลของเราบน GitHub หรืออัปเกรดเป็นเวอร์ชันมืออาชีพผ่านการสมัครสมาชิกรายเดือน เราขอขอบคุณสำหรับความช่วยเหลือของคุณเป็นอย่างยิ่ง และเราสัญญาว่า LafTools จะดียิ่งขึ้นไปอีกด้วยเงินทุนที่ระดมทุนได้",
    "5qV5Sf": "ลบบันทึกนี้ออกจากรายการ",
    "5rg5mt": "มาลากาซี",
    "5srFq": "ลาฟทูลส์",
    "5v8jl7": "ม้ง",
    "6ClPV": "สร้าง",
    "6IHssvayw": "ไม่สามารถประมวลผลด้วย ID ข้อผิดพลาด: {0}",
    "6MrfIfGc6": "โค้ดย่อขนาด",
    "6SypzjeRz": "ค้นหาเครื่องมือที่คุณต้องการได้อย่างรวดเร็ว",
    "6T3dmF": "รีเซ็ตสำเร็จ!",
    "6UICxHdzVR.name": "รูปแบบ {0}",
    "6cOPZ": "Binary-Coded Decimal (BCD) เป็นคลาสของการเข้ารหัสไบนารีของตัวเลขทศนิยม โดยที่แต่ละหลักทศนิยมจะแสดงด้วยจำนวนบิตคงที่ ซึ่งปกติแล้วจะอยู่ที่สี่หรือแปด บางครั้งรูปแบบบิตพิเศษจะใช้สำหรับเครื่องหมาย",
    "6h0GPkCHT": "จาก {0}",
    "6hsnqWe": "แม้ว่า LafTools จะให้บริการฟรีและเป็นโอเพ่นซอร์ส แต่การบำรุงรักษายังคงต้องใช้เวลาและพลังงานเป็นจำนวนมาก โดยเฉพาะอย่างยิ่ง เราต้องการเงินทุนเพื่อชำระค่า Cloud API บางตัว หากคุณชื่นชอบ LafTools โปรดพิจารณาสนับสนุนเรา",
    "6j13s3": "ไอซ์แลนด์",
    "6qT9d-N": "สำหรับโน้ตบุ๊ก LafTools ไม่เพียงแต่จัดเตรียมตัวจัดการคำสั่งเชลล์เท่านั้น แต่ยังจะเพิ่มเครื่องมือบันทึกย่ออันทรงพลังเข้าไปในอนาคตอันใกล้นี้ เช่น MarkDown, Latex, {0} และอื่นๆ",
    "6ulj8i": "เนปาล",
    "6wdtJ4vmg.name.0912": "ย่อขนาด {0}",
    "6yOXx": "ชื่อที่ไม่รู้จัก",
    "71x7x": "ซอร์สโค้ดบน GitHub",
    "7MOO1": "เข้าสู่ระบบ",
    "7dm0d8": "จีนดั้งเดิม",
    "7dyN6HliY": "เปลี่ยนเป็น",
    "7g5w22": "ภาษานอร์เวย์",
    "7k56u3": "กาลิเซีย",
    "7n9nxrgrr": "จัดรูปแบบแล้ว",
    "7q40W": "ไม่สามารถเริ่มต้นผู้ดูแลระบบได้",
    "7u4vzu": "สโลวัก",
    "7x3f6": "แท็บ - 1",
    "7zlGdIUGvj": "สลับไปที่โหมดแนวนอน",
    "82r0C": "จัดการรายการสิ่งที่ต้องทำของคุณและทำสิ่งต่าง ๆ ได้อย่างมีประสิทธิภาพมากขึ้น",
    "8LdRj": "ภาพรวม",
    "8LdRjq": "คำนวณ",
    "8LdevRj": "บริการ",
    "8M1wY": "สถานีท้องถิ่น",
    "8OqB7hN1s": "หน้านี้แสดงรูปแบบ IDE UI สำหรับ LafTools ซึ่งเป็นระดับนามธรรมที่สูงกว่าสำหรับ LafTools",
    "8_jx_2zEw": "จาก {0}",
    "8eeL1Kk": "เกี่ยวกับ",
    "8hlgTVznY": "เลือกลบช่องว่าง การขึ้นบรรทัดใหม่ การป้อนบรรทัด แท็บ และการป้อนแบบฟอร์มทั้งหมดออกจากข้อมูลอินพุต<br><br>การดำเนินการนี้ยังรองรับการลบจุดหยุดเต็มซึ่งบางครั้งใช้เพื่อแสดงไบต์ที่ไม่สามารถพิมพ์ได้ในเอาต์พุต ASCII",
    "8mn_qa": "กำลังดึงข้อมูลจากบริการเทอร์มินัล...",
    "8mxv4e6pz": "แปลงข้อมูลที่เข้ารหัส MessagePack เป็น JSON MessagePack เป็นรูปแบบการแลกเปลี่ยนข้อมูลคอมพิวเตอร์ เป็นรูปแบบไบนารีสำหรับแสดงโครงสร้างข้อมูลอย่างง่าย เช่น อาร์เรย์ และอาร์เรย์ที่เชื่อมโยง",
    "8uf3FVuZn": "เก็บความคิดเห็น",
    "96ue2PVdh": "แปลงข้อมูล JSON เป็น CSV ตามคำจำกัดความใน RFC 4180",
    "97um9v": "ฮาวาย",
    "98KcL": "แปลงเลขทศนิยมเป็น Binary-Coded Decimal (BCD)",
    "9ElKDB5ix": "ส่วนนี้ยังอยู่ระหว่างการพัฒนา และจะเปิดตัวเร็วๆ นี้",
    "9_qaj": "ออกจากแบบฟอร์มนี้",
    "9e4fcl": "ทมิฬ",
    "9eZHM": "อ๊ะ! ดูเหมือนว่าเราพบคำเตือนหรือข้อผิดพลาดบางประการ",
    "9gqo8x": "ลัตเวีย",
    "9m85mf": "เซโซโท",
    "9qy1xn": "โปรตุเกส",
    "9tbbkt": "ภาษาฟินแลนด์",
    "9zCSc": "ไม่มีพื้นที่ทำงานที่พร้อมใช้งาน",
    "A69UZ": "ตัวแปร",
    "A8KATd2ml": "แปลงสตริงเป็นเอนทิตี HTML",
    "ACTG_e6y2": "ถึง {0}",
    "AI Development": "การพัฒนาเอไอ",
    "AI Experiments": "การทดลอง AI",
    "AI Lab": "เอไอ แล็บ",
    "AI Models": "โมเดลเอไอ",
    "AI Research": "การวิจัยเอไอ",
    "AI Tools": "เครื่องมือเอไอ",
    "AVUvu": "Base62 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์ที่จำกัด ซึ่งมนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์ ฐานตัวเลขสูงส่งผลให้สตริงสั้นกว่าระบบทศนิยมหรือฐานสิบหก",
    "AfPC0": "รหัสผ่านข้อความธรรมดาของคุณ",
    "Ahrjc": "ไม่มีไดเร็กทอรี คุณต้องการสร้างไดเร็กทอรีนี้หรือไม่?",
    "AkXgF": "อยู่ระหว่างดำเนินการ: {0}%",
    "Apx8D": "จะรีเซ็ตรหัสผ่านของคุณด้วยตนเองได้อย่างไร?",
    "AvsWiJHLZ": "ทรัพยากร",
    "B-GCloBBt": "บีบอัดโค้ด eXtensible Markup Language (XML)",
    "B0s0z": "วัตถุประสงค์ของหน้านี้:",
    "B5NLBB_Je": "เพื่อความปลอดภัย ขณะนี้เทอร์มินัลไม่สามารถใช้งานได้ กรุณาคอยติดตามการปรับปรุงขอบคุณ!",
    "BGd7P9": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบลงในสตริง ASCII Base64",
    "BGd7dP9": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบเป็นสตริง ASCII {0}",
    "BGdd7dP9": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบเป็นสตริง ASCII {0}",
    "BS4lDEO5A": "ค่าขนส่งคืน",
    "BShq3M": "ปัญหา",
    "B_ekZSOiu": "ฟังก์ชันแฮช SHA (Secure Hash Algorithm) ได้รับการออกแบบโดย NSA SHA-1 เป็นฟังก์ชันแฮช SHA ที่มีอยู่มากที่สุด และใช้ในแอปพลิเคชันและโปรโตคอลด้านความปลอดภัยต่างๆ<br><br>อย่างไรก็ตาม ความต้านทานการชนกันของ SHA-1 ลดลงเมื่อมีการค้นพบหรือปรับปรุงการโจมตีใหม่ๆ อัลกอริธึมการแยกข้อความประกอบด้วย 80 รอบตามค่าเริ่มต้น",
    "Backend": "แบ็กเอนด์",
    "BuihG": "การตั้งค่าระบบ",
    "BzA-pnK2Q": "จากเอนทิตี HTML",
    "C3L9MmdDU7": "คู่มือ",
    "CEB76UtFY": "ซ่อนการตั้งค่า",
    "CEv8B": "คุณแน่ใจที่จะลบบันทึกนี้หรือไม่? หากใช่ ให้คลิกปุ่มนี้อีกครั้ง",
    "CFg8B": "ขนาดต้องอยู่ระหว่าง 0 ถึง 512",
    "CSS": "ซีเอสเอส",
    "CVUl0": "ลาฟทูลส์",
    "CfZAX": "ไฟล์ {0} ที่เลือก เรากำลังอัปโหลดไปยังบริการหลัก",
    "ChQlUi-RC": "สร้างการถ่ายโอนข้อมูลฐานสิบหกของข้อมูลอินพุต โดยแสดงทั้งค่าฐานสิบหกของแต่ละไบต์และการแสดงค่า ASCII ควบคู่ไปกับ",
    "CidOqAZ": "ในฐานะผู้สร้าง LafTools ฉันรู้สึกประทับใจมากที่คุณยินดีสนับสนุนเรา เรามีคนดีๆ ในทีมที่ทำงานอย่างหนักเพื่อปรับปรุง LafTools อย่างต่อเนื่อง",
    "Cide2w": "เพื่อดูว่ามีปัญหาใดๆ ในขณะที่ดำเนินการหรือไม่",
    "D10ddoJDo": "แปลงสตริงอินพุตเป็นตัวพิมพ์งู\\n<br><br>\\nตัวพิมพ์งูเป็นตัวพิมพ์เล็กทั้งหมดโดยมีขีดล่างเป็นขอบเขตคำ\\n<br><br>\\ne.g. this_is_snake_case\\n<br><br>\\n'พยายามรับรู้บริบท' จะทำให้การดำเนินการพยายามแปลงชื่อตัวแปรและฟังก์ชันอย่างสวยงาม",
    "DBw_XZTr9": "ถึง {0}",
    "DIQFq": "โปรดตรวจสอบว่ามีการให้พารามิเตอร์ URL อย่างถูกต้องหรือไม่ ดูเหมือนว่าคุณไม่ได้รับอนุญาตให้กรอกแบบฟอร์มนี้ ตามค่าเริ่มต้น คุณจะสามารถดูข้อความด้านล่างในผลลัพธ์ของการบริการเมื่อเพิ่งเปิดตัว",
    "DIweGq": "รักษาความปลอดภัย LafTools ของคุณ",
    "DSEtLTxUU": "เวลาเป็นสกุลเงินของชีวิตของคุณ จงใช้มันอย่างชาญฉลาด",
    "DTTPW": "รีเซ็ตสถานะ",
    "DVoKw": "ออกจากระบบนี้",
    "DZecxBbgk": "ฟีดบรรทัด",
    "Database": "ฐานข้อมูล",
    "DhW0AdwRDi": "เปิดในแท็บใหม่",
    "DkOlPSZ0t": "ลาฟทูลส์",
    "DqFI5": "ระดับต้องมากกว่า 0",
    "DrXAq": "ยินดีต้อนรับสู่การใช้ LafTools!",
    "DrbEr": "รหัสผ่านที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "DtlAc": "กำลังโหลดทรัพยากรระบบ",
    "Dxlw0": "สมบูรณ์",
    "E62ej": "คำสั่งเชลล์กรอง",
    "EEQkeW": "อัลกอริธึม MD6 (Message-Digest 6) เป็นฟังก์ชันแฮชที่เข้ารหัส ใช้โครงสร้างคล้ายต้นไม้ของ Merkle เพื่อให้สามารถคำนวณแฮชแบบคู่ขนานมหาศาลสำหรับอินพุตที่ยาวมาก",
    "EMxvJXE9u": "ชาร์โค้ด",
    "EO6Qv5dCA": "ลดขนาดโค้ด JSON ลดขนาดบันเดิลของโค้ด JSON ของคุณ",
    "EOdsCA": "เลิกใช้อักขระพิเศษในโค้ด JSON",
    "EOdsdf": "หลีกอักขระพิเศษในโค้ด JSON",
    "EPSPCHhsa": "เข้ารหัส URL",
    "EPSdPCHhsa": "ถอดรหัส URL",
    "ERK7E": "หากคุณพบปัญหาใด ๆ หรือมีข้อเสนอแนะใด ๆ ในขณะที่ใช้ LafTools โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เรายินดีที่จะปรับปรุงอย่างเร่งด่วน",
    "EbmQAicDD": "ตัวคั่นแถว",
    "Ec-O2fmpc": "จาก ชาร์โคด",
    "EgBXL": "เลือกหรือระบุแท็ก",
    "Ewvgo": "ยังไม่ได้เริ่ม.",
    "ExqvX": "รายการคีย์ลัด",
    "Eyq856": "เรายังไม่เสร็จสิ้น - เรามุ่งมั่นที่จะนำเสนอคุณสมบัติใหม่ล่าสุดและดีที่สุด และเราจะเผยแพร่การอัปเดตต่อไปเพื่อให้แน่ใจว่าคุณได้รับประสบการณ์ที่ดีที่สุด",
    "F-OUm": "การตั้งค่าด่วนสำหรับ LafTools",
    "F0CCF": "รายการคีย์ลัด",
    "F4uS2": "ไฟล์ใหม่",
    "FBVyc": "กรุณาใส่รหัสยืนยันอีกครั้ง",
    "FDlRI": "ตั้งชื่อแท็บใหม่นี้แล้วคลิกเพื่อยืนยัน",
    "FJwkT9Tzu": "จากรหัสมอร์ส",
    "FLsbFsOZq": "ไอดี",
    "FOyHW": "ค้นหาทุกที่",
    "FYRoL": "เยื้องและปรับแต่งโค้ด Cascading Style Sheets (CSS)",
    "FhVWl": "เข้ารหัสรหัสผ่านของคุณ",
    "Frontend": "ส่วนหน้า",
    "FsrRIxrjL": "แปลงบัฟเฟอร์ไบต์ที่เข้ารหัส JSON เป็น MessagePack MessagePack เป็นรูปแบบการแลกเปลี่ยนข้อมูลคอมพิวเตอร์ เป็นรูปแบบไบนารีสำหรับแสดงโครงสร้างข้อมูลอย่างง่าย เช่น อาร์เรย์ และอาร์เรย์ที่เชื่อมโยง",
    "Fv-zz": "คัดลอกผลลัพธ์",
    "Fzp3t": "โปรดระบุค่าในช่องนี้",
    "G2dvTUljF": "เครื่องมือ",
    "G9QVo": "จัดการแท็บ",
    "GR7jK": "พิมพ์",
    "GSgmYW7Qv": "พยายามรับรู้บริบท",
    "Ggob_": "ยกเลิก",
    "GqolnOrbq": "แปลงสตริงอินพุตเป็นไบต์ฐานแปดซึ่งคั่นด้วยตัวคั่นที่ระบุ<br><br>เช่น สตริงที่เข้ารหัส UTF-8 <code>Γειά σου</code> จะกลายเป็น <code>316 223 316 265 316 271 316 254 40 317 203 316 277 317 205</code>",
    "H-Ae75": "โปรดยืนยันรหัสผ่านท้องถิ่นของคุณ",
    "H-W-_p": "ทำการแปลงในครั้งเดียว",
    "H-qA75": "กรุณาระบุรหัสผ่านท้องถิ่น",
    "H1ARNsz-l": "แปลงสตริงอินพุตเป็นตัวพิมพ์ใหญ่ โดยอาจจำกัดขอบเขตให้เหลือเพียงอักขระตัวแรกในแต่ละคำ ประโยค หรือย่อหน้าก็ได้",
    "H8fQ4": "สลับเป็นโหมดสว่างหรือมืด",
    "HEAhr": "หลังจากแปลแล้ว ผลลัพธ์จะปรากฏที่นี่",
    "HIc3c": "สมบูรณ์",
    "HNDat": "หากต้องการเปลี่ยนแปลง โปรดคลิกปุ่ม \"{0}\" หรือคลิก \"{1}\" เพื่อใช้การเปลี่ยนแปลงของคุณ ขอให้คุณมีช่วงเวลาที่ดีกับกล่องเครื่องมือนี้!",
    "HTML": "HTML",
    "Hexdump": "การถ่ายโอนข้อมูลแบบ Hexdump",
    "HjvV3": "เราจะไม่ลบไฟล์บนดิสก์ เพียงลบบันทึกนี้ออกจากรายการ",
    "HxTXHD3lc": "แปลงข้อมูลระหว่างรูปแบบต่างๆ",
    "HyIC_": "เครื่องหมายทับ (/)",
    "HyIC_d": "เครื่องหมายทับ (/)",
    "I8FLi": "ตอนนี้ถึงเวลาตั้งค่าผู้ดูแลระบบของคุณแล้ว โปรดตั้งรหัสผ่านให้ซับซ้อนที่สุดเท่าที่จะทำได้ เพื่อที่คุณจะได้สามารถสร้างความสับสนให้กับผู้โจมตีที่ไม่สุภาพเหล่านั้นได้",
    "IAC0A": "เครื่องมือค้นหา",
    "ICefi": "ยกเลิก",
    "IEFy5k39X": "เครื่องกำเนิดไฟฟ้า",
    "IEFy5k39X.long": "สร้างโค้ด UUID GUID และค่าสุ่ม ฯลฯ...",
    "IJjSINgO0": "รีเซ็ตเครื่องมือเป็นสถานะเริ่มต้น",
    "IKqqATS": "รีเฟรชข้อมูลหน้าปัจจุบัน",
    "ISMDLUbAc": "แปลงสตริงอินพุตเป็นไบต์ฐานสิบหกซึ่งคั่นด้วยตัวคั่นที่ระบุ<br><br>เช่น สตริงที่เข้ารหัส UTF-8 <code>ÎÎµÎ¹Î‚ ÏÎ¿Ï</code> จะกลายเป็น <code>ce 93 ce b5 ce b9 ce ac 20 cf 83 ce bf cf 85 0a</code>",
    "IaSyO": "ยกเลิก",
    "IdfUH5": "ตัวอย่าง",
    "IfsdGO": "รายการโปรด",
    "ImUmf": "ใหม่",
    "IxAJswoSh": "แยกวิเคราะห์และพิมพ์โค้ด JavaScript ที่ถูกต้อง ทำงานร่วมกับ JavaScript Object Notation (JSON) ได้ด้วย",
    "IzUedAcW": "ทั้งหมด",
    "IzUedAcWt": "ทั้งหมด",
    "IzUedAcsWt": "ทั้งหมด",
    "J-3KA": "โปรดระบุชื่อสคริปต์นี้ ซึ่งจะมีประโยชน์มากกว่า",
    "J164i": "เช่น. คัดลอกไฟล์ไปยังเซิร์ฟเวอร์ระยะไกล",
    "J2xoL": "โปรดดูข้อผิดพลาด: {0}",
    "JA_Bp": "โปรดระบุชื่อสำหรับแท็กใหม่ในตอนแรก",
    "JQEVK": "รหัส",
    "JQLmS": "ปรับขนาดแล้ว",
    "JQLmSq": "สมบูรณ์.",
    "JYqxz2": "ยินดีต้อนรับสู่ LafTools นี่เป็นเวอร์ชันภายใน",
    "JavaScript": "จาวาสคริปต์",
    "JdqiUE8": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII (พร้อมตัวอักษรที่คุณเลือก รวมค่าที่ตั้งไว้ล่วงหน้า) กลับเป็นรูปแบบดิบ",
    "JdqidUE8": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII (พร้อมตัวอักษรที่คุณเลือก รวมค่าที่ตั้งไว้ล่วงหน้า) กลับเป็นรูปแบบดิบ",
    "JiUE8": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII {0} กลับเป็นรูปแบบ Raw",
    "K0ATr9EhO": "แปลงข้อมูลจากอาร์เรย์จำนวนเต็มลำดับกลับเป็นรูปแบบดิบ<br><br>เช่น <code>72 101 108 108 111</code> กลายเป็น <code>สวัสดี</code>",
    "K1qJZI": "ยินดีต้อนรับสู่ LafTools ฯพณฯ",
    "KYh1N": "หมายเหตุทั้งหมด",
    "KcqrRr": "อ้างอิง",
    "KcrRr": "การดึงข้อมูลการใช้งานโค้ด",
    "Kd4QkQG2F": "เปลี่ยนเป็น",
    "KmEUF": "ให้ภาพรวมโดยย่อของเครื่องมือระบบปัจจุบัน",
    "Kw4OJr": "เทอร์มินัล",
    "Kw7oVB8kp": "ไม่สามารถโหลดการดำเนินการนี้ได้",
    "Kyd9H": "ซอร์สโค้ดบน GitHub",
    "L-p-Y": "คัดลอกเนื้อหาของคำสั่งเชลล์ปัจจุบันไปยังคลิปบอร์ด",
    "L42mxa": "กรุณากรอกข้อความต้นฉบับของคุณในช่องนี้",
    "L49kCq": "โปรดระบุและยืนยันรหัสผ่านล็อคในแบบฟอร์มนี้เพื่อรักษาความปลอดภัย LafTools ของคุณ",
    "L71q_N": "รหัสผ่านที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "L9bQku": "ถอดรหัส {0}",
    "L9qbQku": "ถอดรหัส {0}",
    "LFdvM": "ไม่ได้เข้าสู่ระบบ",
    "LM715": "กำลังดึงการกำหนดค่า i18n จาก API เซิร์ฟเวอร์ภายในเครื่อง",
    "LQQt5fQ3Q": "ตัวแปลง MessagePack",
    "LSohY6eZW": "Hex String คือสตริงของไบต์เลขฐานสิบหกที่คั่นด้วยตัวคั่น ซึ่งอาจเป็นช่องว่าง เครื่องหมายจุลภาค อัฒภาค หรือโคลอน",
    "LU9Jj": "Base85 (หรือที่เรียกว่า Ascii85) เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเอง โดยปกติแล้วจะมีประสิทธิภาพมากกว่าที่ Base64 การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII (พร้อมตัวอักษรที่คุณเลือก รวมค่าที่ตั้งล่วงหน้าไว้ด้วย) Base85 มักใช้ในรูปแบบไฟล์ PostScript และ PDF ของ Adobe",
    "LWaeFqd": "สลับเป็นภาษาที่คุณต้องการ",
    "LXs6b7cPa": "แปลงข้อมูล XML เป็นสตริง JSON",
    "Le71_N-": "รหัสผ่านที่คุณระบุไม่เหมือนกับรหัสผ่านที่ยืนยัน โปรดตรวจสอบและลองอีกครั้ง",
    "LgJAz6Xwr": "SHA-0 เป็นการเรียกชื่อซ้ำกับเวอร์ชันดั้งเดิมของฟังก์ชันแฮช 160 บิตที่เผยแพร่ในปี 1993 ภายใต้ชื่อ 'SHA' มันถูกถอนออกไม่นานหลังจากการตีพิมพ์เนื่องจากมี 'ข้อบกพร่องที่สำคัญ' ที่ไม่เปิดเผย และแทนที่ด้วยเวอร์ชัน SHA-1 ที่แก้ไขเล็กน้อย อัลกอริธึมการแยกข้อความประกอบด้วย 80 รอบตามค่าเริ่มต้น",
    "LmmJOduQpV": "ตัวแปลงชาร์โค้ด",
    "LmmJOuQpV": "แปลงสตริงเป็นชาร์โค้ด",
    "LnJ4H": "โปรดทราบว่าบัญชีท้องถิ่นนั้นไม่เหมือนกับผู้ใช้ที่ลงทะเบียนบนเว็บไซต์ของเราโดยสิ้นเชิง บัญชีแรกถูกกำหนดไว้บนพีซีของคุณเท่านั้น ในขณะที่บัญชีหลังสามารถใช้สำหรับการซิงค์บนคลาวด์ได้",
    "LqWaFd": "การตั้งค่าระบบ",
    "LxaEFHbfa": "ลดขนาดโค้ด SQL ลดขนาดบันเดิลของโค้ด SQL ของคุณ",
    "M3qytc": "เข้ารหัส {0}",
    "M3ytc": "เข้ารหัส {0}",
    "M4ywN1": "เครื่องคิดเลข ปฏิทิน นาฬิกา สภาพอากาศ และอื่นๆ",
    "M7jct": "เข้าสู่โหมดเต็มหน้าจอ",
    "MN2lT": "ความยาวของรหัสผ่านต้องไม่น้อยกว่า 6",
    "MYqdqw071": "รหัสมอร์ส",
    "Ma5mv": "สลับการมองเห็นแท็บแถบเครื่องมือ",
    "Mq9pdpT": "แสดงรายการทรัพยากรที่เกี่ยวข้องทั้งหมดสำหรับเมนูการทำงานที่คุณเลือก",
    "Mq9ppT": "ดูสถานะบริการของคุณอย่างรวดเร็ว",
    "Mqq9pdpT": "ช่วยคุณในการเริ่มต้นใช้งาน LafTools",
    "MrgmU": "ยืนยัน",
    "N6-IVLWRV": "{0} ลดขนาด",
    "N8_QO8jAt": "สร้างแฮช SHA-3 จากข้อความ SHA-3 เป็นสมาชิกล่าสุดของตระกูล Secure Hash Algorithm ไม่เสี่ยงต่อการโจมตีประเภทเดียวกันกับ SHA-1 และ SHA-2",
    "NLXUGv5gF": "เรียงลำดับคีย์วัตถุ",
    "NMLOn": "คัดลอก FilePath",
    "NMLOn1": "เปิดพื้นที่ทำงาน",
    "NNfdo": "โหลดข้อมูลจากไฟล์เป็นอินพุต",
    "N_9_M4KgI": "JSON หลบหนี",
    "N_9_dM4KgI": "JSON หลบหนี",
    "Nqc0LqwX": "หากคุณคิดว่ามีช่องโหว่ในกระบวนการนี้ โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เราต้องการปรับปรุงโดยด่วน",
    "NrQc8OJfZ": "บีบอัดโค้ด JavaScript Object Notation (JSON)",
    "O94Yx": "บน",
    "OJd-7SdMC": "การจัดการข้อความ",
    "OMrIvzpf5": "ฟังก์ชันแฮช SHA-3 (Secure Hash Algorithm 3) ได้รับการเผยแพร่โดย NIST เมื่อวันที่ 5 สิงหาคม 2558 แม้ว่าจะเป็นส่วนหนึ่งของชุดมาตรฐานเดียวกัน แต่ SHA-3 ภายในค่อนข้างแตกต่างจากโครงสร้างที่คล้าย MD5 ของ SHA-1 และ SHA -2.<br><br>SHA-3 เป็นส่วนย่อยของตระกูล Keccak ดั้งเดิมที่เข้ารหัสลับที่กว้างขึ้น ซึ่งออกแบบโดย Guido Bertoni, Joan Daemen, Micha\\xebl Peeters และ Gilles Van Assche โดยต่อยอดจาก RadioGat\\xfan",
    "OO0qPN": "ตัวอย่างโหลดแล้ว",
    "OP2Ogtd1O": "สัมผัสประสบการณ์ฟีเจอร์ AI ด้วย LafTools!",
    "OQWm4": "รายงานข้อผิดพลาด",
    "OSHOI": "ยินดีต้อนรับหน้า",
    "OSqZQM": "รหัสผ่านท้องถิ่น",
    "OeO0PeN": "เอาล่ะ ตัวอย่างจะแสดงในตัวแก้ไขอินพุต",
    "OeOQY": "ทำ",
    "OjdV1-pMy": "คุณแน่ใจหรือว่ารีเซ็ตเครื่องมือเป็นสถานะเริ่มต้น?",
    "OpPFe": "หากคุณชอบ LafTools โปรดแชร์กับเพื่อนของคุณและให้ดาวเราด้วย ขอบคุณ!",
    "Opcty": "ไฟล์",
    "OqqGx2qg": "กำลังโหลดทรัพยากรแบบคงที่ โปรดรอสักครู่...",
    "OrCD8PqwH": "ลบหมายเลขบรรทัด",
    "OrCt5": "กำลังเปลี่ยนเส้นทางไปยังโต๊ะทำงาน...",
    "Ot6EP": "เครื่องมือโปแลนด์",
    "OyZLZokUQ": "เสริมศักยภาพการพัฒนาด้วย LafTools!",
    "PM_N5": "เซสชัน - {0}",
    "PUxuU": "กำลังดึงข้อมูลสำหรับชุดภาษา...",
    "PWA": "กปภ",
    "PkIRx3hFD": "แลกเปลี่ยน",
    "PpCHA": "รหัสคำถาม(?)",
    "QB9HtMaFb": "ไบนารี่",
    "QLKzF": "มันอัดแน่นไปด้วยคุณสมบัติที่ตอบสนองความต้องการของนักพัฒนามือใหม่และนักพัฒนาที่มีประสบการณ์ ทำให้เป็นเครื่องมือที่ต้องมีในคลังแสงของโปรแกรมเมอร์",
    "QM2Ob": "เครื่องมือล่าสุด",
    "QM2Oq": "หมายเหตุล่าสุด",
    "QRAdA": "ภาษาอังกฤษเป็นภาษาจีน",
    "QZK58Gemi": "บีบอัดโค้ด Structured Query Language (SQL)",
    "Qar4RR29k": "แปลงสตริงอินพุตเป็นตัวพิมพ์เคบับ\\n<br><br>\\nตัวพิมพ์เคบับเป็นตัวพิมพ์เล็กทั้งหมดโดยมีขีดคั่นเป็นขอบเขตคำ\\n<br><br>\\ne.g. this-is-kebab-case\\n<br><br>\\n'พยายามรับรู้บริบท' จะทำให้การดำเนินการพยายามแปลงชื่อตัวแปรและฟังก์ชันอย่างสวยงาม",
    "QhdpH": "ฉบับชุมชน",
    "QkJ-TOduip6z_": "LafTools IDE",
    "QzVvoxTOo": "แปลงเอนทิตี HTML กลับไปเป็นอักขระ",
    "QzlA3": "เกิดข้อผิดพลาด",
    "R12bq": "แท็บรายการที่ไม่แสดง",
    "RNBze0": "เครื่องมือ",
    "RNeBze0": "แท็บที่เปิดอยู่",
    "RNewBze0": "การกำหนดค่าเครื่องมือ",
    "RO4ZP": "เกิดข้อผิดพลาด",
    "RPVRl": "ดูเหมือนว่าส่วนขยายนี้เข้ากันไม่ได้กับ LafTools เวอร์ชันปัจจุบัน โปรดพิจารณาติดตั้งเวอร์ชันล่าสุดเพื่อรองรับส่วนขยายนี้ หรือโปรดติดต่อเราโดยแจ้งปัญหาบน GitHub",
    "Rc_TrzJNm": "เรียกใช้ไปป์ไลน์",
    "RhqzcdD": "การตั้งค่าระบบ",
    "RjCO3": "รายการพื้นที่ทำงาน",
    "S4MMV": "อ๊ะ! เราพบปัญหาบางอย่างขณะโหลดไฟล์",
    "SAnnQ": "กำลังโหลดไฟล์ {0}",
    "SBsDz": "ตั้งค่าสำหรับบัญชีผู้ดูแลระบบของคุณ",
    "SD2VOXLGD": "ศูนย์ผู้ใช้",
    "SGalwFBxc": "สร้างแฮช SHA-1 จากข้อความ SHA-1 ไม่ปลอดภัยและไม่ควรใช้",
    "SGs7B": "ตั้งค่า LafTools ของคุณอย่างรวดเร็ว",
    "SK4DZv8zD": "บีบอัดโค้ด HyperText Markup Language (HTML)",
    "SL7RJN-sdv6": "คดีงู",
    "SMqD13": "ป้อนเพื่อกรอง",
    "SPem9": "สนามนี้ยังไม่พร้อม",
    "SQAw7": "ภาษาต้นฉบับ",
    "SYSq1": "ตัวอย่าง",
    "SZgXb": "ตั้งค่ารหัสผ่านท้องถิ่น",
    "SdGcT": "ส่วนอื่นๆ",
    "ShgVLLtWo": "ไม่พบการดำเนินการ",
    "Sm9tq": "กรุณาระบุรหัสผ่านบัญชีที่นี่",
    "Sm9tqq": "กรุณาระบุรหัสผ่านเพื่อปลดล็อค LafTools ของคุณ",
    "Spcfdee": "โหมดสว่างหรือมืด",
    "TBPqy7": "ภาษา",
    "TD7DA": "ภาษา",
    "TET4xnxBT": "ไข่อีสเตอร์",
    "TNoePE": "LafTools คลาวด์",
    "Tj2A9ou2k": "อ่านเอกสารด้วย LafTools!",
    "Ttrqqet": "เขียนและบันทึกความคิดของคุณที่นี่!",
    "TwFcr": "ภาษาเป้าหมาย",
    "TypeScript": "TypeScript",
    "TyqvWY3": "ไฟล์ในเครื่อง",
    "U-SKci0LP": "ลบช่องว่าง",
    "U2ZNl": "เรียนรู้เพิ่มเติมเกี่ยวกับวิกิพีเดีย",
    "U4qqq9": "ลบแท็บนี้ออกจากรายการ",
    "U7zP2": "กรุณาระบุชื่อผู้ใช้บัญชีที่นี่",
    "UAmIRsSWN": "ฟังก์ชันแฮช SHA-2 (Secure Hash Algorithm 2) ได้รับการออกแบบโดย NSA SHA-2 มีการเปลี่ยนแปลงที่สำคัญจาก SHA-1 รุ่นก่อน ตระกูล SHA-2 ประกอบด้วยฟังก์ชันแฮชที่มีค่าไดเจสต์ (ค่าแฮช) ที่เป็น 224, 256, 384 หรือ 512 บิต: SHA224, SHA256, SHA384, SHA512<br><br><ul><li>ทำงาน SHA-512 บนคำแบบ 64 บิต</li><li>SHA-256 ทำงานบนคำแบบ 32 บิต</li><li>SHA-384 ส่วนใหญ่เหมือนกับ SHA-512 แต่ถูกตัดทอนเหลือ 384 ไบต์</li <li>SHA-224 ส่วนใหญ่เหมือนกับ SHA-256 แต่ถูกตัดทอนเหลือ 224 ไบต์</li><li>SHA-512/224 และ SHA-512/256 เป็นเวอร์ชันที่ถูกตัดทอนของ SHA-512 แต่เป็นเวอร์ชันเริ่มต้น ค่าต่างๆ ถูกสร้างขึ้นโดยใช้วิธีที่อธิบายไว้ใน Federal Information Processing Standards (FIPS) PUB 180-4</li></ul> อัลกอริธึมการแยกข้อความสำหรับรูปแบบ SHA256 จะประกอบด้วย 64 รอบตามค่าเริ่มต้น และสำหรับรูปแบบ SHA512 โดยค่าเริ่มต้นคือ 160",
    "UF_Dp": "เกิดข้อผิดพลาด: {0} เวลาที่ปฏิเสธคือ {1}",
    "UVvJp-vtF": "{0} ลดขนาด",
    "UZ2Ig": "บัญชีท้องถิ่นใหม่",
    "UaDAW3Puf": "JSON เป็น CSV",
    "V6U_f": "เงื่อนไขการให้บริการ",
    "V6XEO": "กรอกชื่อผู้ใช้หรืออีเมล",
    "VAZq8r": "ช่วยให้นักพัฒนาสามารถรันคำสั่งต่างๆ เช่น การรันสคริปต์ การติดตั้งแพ็คเกจ และการนำทางระบบไฟล์ ทั้งหมดนี้ทำได้จากภายในตัวแก้ไข",
    "VEfeqZG": "หมายเหตุ",
    "VI6VT": "ประวัติศาสตร์",
    "VOsZc": "รายงานปัญหา",
    "VSZ": "คลิกเพื่อทริกเกอร์อีกครั้ง",
    "VWTOJobQM": "แปลงตัวเลขเป็นฐานแปด",
    "VZtqg6": "สร้างแบบฟอร์มสคริปต์ใหม่",
    "Vaf2y": "ชื่อแท็บไม่สามารถเว้นว่างได้",
    "Vc40-vfod": "ลบหมายเลขบรรทัดออกจากเอาต์พุตหากตรวจพบได้เพียงเล็กน้อย",
    "VeY9K": "ข้อกำหนดการใช้งาน",
    "VivVgJcwO": "แปลงรหัสอักขระ Unicode กลับเป็นข้อความ",
    "Vvt09V2Qo": "รหัสทั่วไป",
    "WBGdJVL93": "ฟีดแบบฟอร์ม",
    "WFUWzv_px": "แยกวิเคราะห์และพิมพ์โค้ด JavaScript ที่ถูกต้อง ทำงานร่วมกับ JavaScript Object Notation (JSON) ได้ด้วย",
    "WPrTW": "เว็บไซต์อย่างเป็นทางการ",
    "WQ7oUdMYD": "เลขฐานแปด",
    "WXo6D": "สดชื่น",
    "WYCVL": "การติดตั้งอย่างรวดเร็ว",
    "Web Assembly": "การประกอบเว็บ",
    "Web Audio": "เว็บออดิโอ",
    "Web Components": "ส่วนประกอบของเว็บ",
    "Web Storage": "ที่เก็บข้อมูลบนเว็บ",
    "WebGL": "WebGL",
    "WebRTC": "เว็บRTC",
    "WebSockets": "เว็บซ็อกเก็ต",
    "WebVR": "เว็บวีอาร์",
    "WebXR": "เว็บเอ็กซ์อาร์",
    "Webmaster": "เว็บมาสเตอร์",
    "X-u9FCh1I": "ศูนย์ผู้ใช้",
    "X6Fq4j": "หลังจากหลายปีของการพัฒนาและปรับแต่งอย่างทุ่มเท เรามั่นใจว่า LafTools สามารถปรับปรุงประสบการณ์การเขียนโปรแกรมของคุณได้อย่างมากโดยนำความสะดวกสบายและประสิทธิภาพมาสู่ขั้นตอนการทำงานของคุณมากขึ้น",
    "X6cA6FaLw": "ถึง {0}",
    "XAJIZiKtp": "ถึง MessagePack",
    "XLWoR": "เลือกอันที่คุณต้องการและดำเนินการต่อ",
    "XQxJB": "พื้นที่ทำงานของฉัน",
    "XWG2pQTu-": "ถึงกรณีอูฐ",
    "X_HGx": "LafTools เป็นกล่องเครื่องมืออเนกประสงค์ที่ออกแบบมาเพื่อตอบสนองความต้องการที่หลากหลาย เป็นโอเพ่นซอร์สเต็มรูปแบบ รับประกันความโปร่งใสและความปลอดภัย แม้จะมีรันไทม์เพียงเล็กน้อย แต่ก็ให้การสนับสนุนแพลตฟอร์มเต็มรูปแบบ รวมถึง ARMv8 และการสนับสนุน AI ดั้งเดิมที่คล้ายกับ ChatGPT LafTools ได้รับการผสานรวมกับ UI ที่มีประสิทธิภาพและได้รับการอัปเดตด้วยเครื่องมือใหม่ๆ อย่างต่อเนื่อง สามารถใช้บนเว็บและกับ Docker และให้แหล่งข้อมูลเพิ่มเติม เช่น บันทึกย่อและคู่มือ",
    "XdOYpbSeG": "ป้อนข้อมูล",
    "XdOYpsdf": "เอาท์พุต",
    "XeXF77": "การตั้งค่า",
    "XfKkqZuFU": "{0} รายการโปรด",
    "XuAHhgkpA": "โอเค อินพุตและเอาท์พุตสลับกัน",
    "Y5GAC": "ชื่อผู้ใช้ของคุณ",
    "Y9mQ2": "กรุณาระบุชื่อผู้ใช้บัญชีที่นี่",
    "YAAU3q": "รหัสผ่านท้องถิ่น",
    "YHCjT": "LafTools รองรับธีมแสงและความมืดทั่วโลก ซึ่งมีประโยชน์โดยเฉพาะกับผู้เขียนโค้ดกะกลางคืน",
    "YKnpxgWLK": "แปลงสตริงเป็นเคบับ-เคส",
    "YNwKz": "ภาษาที่ไม่สนับสนุน: {0} จะใช้ภาษาอังกฤษเป็นค่าเริ่มต้น",
    "YOYTp": "การติดตั้งอย่างรวดเร็ว",
    "YPPPL": "สลับการมองเห็นแท็บแถบเครื่องมือ",
    "YQN9u": "เกิดข้อผิดพลาดขณะโหลด {0} โปรดตรวจสอบรายละเอียดด้านล่าง",
    "Y__Zb1_4Q": "ลดขนาดโค้ด Cascading Style Sheets (CSS) โดยลบอักขระที่ไม่จำเป็นทั้งหมดออก",
    "Y_k0z": "ลืมรหัสผ่าน?",
    "Ye3TXses": "เพื่อกำหนดค่าว่าการแปลงจะดำเนินการโดยอัตโนมัติหรือไม่เมื่อข้อความที่ป้อนมีการเปลี่ยนแปลง",
    "YiyTj3bEz": "ความช่วยเหลือและข้อเสนอแนะ",
    "Ylq2X": "แก้ไขข้อผิดพลาด",
    "YpFz_Ens_": "ไข่อีสเตอร์",
    "YrTdq": "ทั้งหมด",
    "YrVq683": "จดหมาย",
    "YrVqdd683": "คู่มือ",
    "Z2QTU": "เกี่ยวกับ",
    "Z3rhY": "ข้อความ",
    "Z7ALO": "สลับไปยังพื้นที่ทำงานที่เลือก",
    "Z7OTt": "ไฟล์ที่คุณเลือกมีขนาดใหญ่เกินไป โปรดเลือกไฟล์ที่มีขนาดน้อยกว่า 30MB",
    "ZAGva": "คุณแน่ใจหรือว่าจะลบพื้นที่ทำงานนี้",
    "ZAKaFq": "บัญชีคลาวด์ของฉัน",
    "ZXRGC": "โปรดดูข้อผิดพลาด: {0}",
    "ZbD3F": "{0} สร้างขึ้นโดยทีมงาน LafTools",
    "Zk7JI": "มันยังไม่รองรับ",
    "ZrbduC": "ปิดแท็บทั้งหมด",
    "ZrbuC": "ปิดแท็บ",
    "_5OqeG": "ยกเลิกการทำเครื่องหมาย",
    "_B_gk42VH": "แปลงอักขระเป็นเอนทิตี HTML",
    "_LFF3": "หากคุณประสบปัญหาใด ๆ หรือมีข้อเสนอแนะใด ๆ ในขณะที่ใช้ LafTools โปรดติดต่อเราผ่านทางอีเมลหรือ GitHub ได้ตลอดเวลา เรายินดีที่จะปรับปรุง",
    "_trqL": "กำลังดึงข้อมูลสำหรับทรัพยากรระบบ...",
    "_z3lR": "รีเฟรชโค้ด",
    "a3yqoz": "เปอร์เซีย",
    "a3z-3k12": "เครื่องมือที่อยู่ IP",
    "a4jbpq": "เช็ก",
    "a6Q7ONGCB": "พยายามรับรู้บริบท",
    "aCkOP": "ออก",
    "aFsY0lzSw": "ไปป์ไลน์เป็นลำดับของการดำเนินการที่จะดำเนินการตามลำดับ คุณสามารถเพิ่ม ลบ และจัดลำดับการดำเนินการใหม่ในไปป์ไลน์ได้",
    "aHAfR": "กำลังเรียกข้อมูลสำหรับ {0}...",
    "aSOpr": "เครื่องสร้างแบบจำลองข้อมูล",
    "aVjps8d6V": "แสดงส่วนสุดท้ายของไฟล์หรือข้อความ",
    "about_LafTools_toolbox": "เกี่ยวกับ ลาฟทูลส์",
    "adpgq": "สร้างพื้นที่ทำงานใหม่",
    "ah-C4": "หมายเหตุใหม่",
    "aj3nhd": "เยอรมัน",
    "aked6": "อ้างอิง",
    "aked61": "การแนะนำ",
    "alloperations": "การดำเนินงาน",
    "anosdk": "ตัวอักษร",
    "asElV": "ลบ",
    "az4uS2": "คุณแน่ใจหรือว่าจะออกจากระบบนี้? โปรดทราบว่าคุณจะถูกเปลี่ยนเส้นทางไปยังหน้าเข้าสู่ระบบ",
    "azpNX": "สมบูรณ์.",
    "b6sx9b": "ฟิลิปปินส์",
    "bCBpnCWr4": "แปลงอักขระทุกตัวในอินพุตให้เป็นตัวพิมพ์เล็ก",
    "bP_6qG": "เคล็ดลับสำหรับการลืมรหัสผ่านของคุณ",
    "bT4R6": "แท็บใหม่",
    "bVlBN": "จีนเป็นอังกฤษ",
    "bWQunyU10": "ห้องปฏิบัติการเอไอ",
    "bhojei1": "จีนดั้งเดิม",
    "bjZyW": "แปลภาษา",
    "bors14": "ภาษาตุรกี",
    "bp_-b": "หากต้องการจัดการ LafTools อย่างสมบูรณ์ คุณต้องตั้งค่าผู้ดูแลระบบของคุณที่จุดเริ่มต้นของขั้นตอนการตั้งค่า เราได้ตรวจสอบการระบุตัวตนของคุณด้วยโทเค็นพารามิเตอร์ URL แล้ว โปรดมั่นใจได้ว่าไม่มีใครสามารถตั้งค่าการอนุญาตรูทของคุณได้ เว้นแต่เขาหรือเธอจะได้รับโทเค็นการตั้งค่า",
    "bqqrij": "สวาฮีลี",
    "bsWpBA73s": "บีบอัดโค้ด JavaScript",
    "btUVQx8uc": "แปลงอักขระที่เข้ารหัสเปอร์เซ็นต์ URI/URL กลับไปเป็นค่าดิบ",
    "btUVQxdq8uc": "{0} ถอดรหัส",
    "btUVqx8uc": "เข้ารหัสอักขระที่มีปัญหาเป็นการเข้ารหัสเปอร์เซ็นต์ ซึ่งเป็นรูปแบบที่ URI/URL รองรับ",
    "btUdVQx8duc": "{0} เข้ารหัส",
    "c0eCw": "แปลข้อความของคุณเป็นภาษาใดก็ได้ที่คุณต้องการ",
    "c5meku": "ซุนดา",
    "c7Uoqqe": "ก่อนที่จะใช้ LafTools โปรดระบุและยืนยันรหัสผ่านในเครื่องของคุณตามด้านล่างนี้",
    "cMBqyyFae": "เยื้องและปรับแต่งโค้ด Structured Query Language (SQL)",
    "cNQp_": "ทรัพยากร",
    "cOYuMrncv": "ความล้มเหลวในการแปลที่ไม่ทราบสาเหตุ",
    "cPS6q": "เครื่องมือทั้งหมด",
    "cQqwI8r": "กำลังโหลดสถานะของบริการเทอร์มินัล",
    "cU0YAMbxU": "แสดงข้อความในแถบด้านข้าง",
    "ciZV2": "Base32 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์ที่จำกัด ซึ่งมนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์ ใช้ชุดอักขระที่เล็กกว่า Base64 ซึ่งโดยปกติจะเป็นตัวอักษรตัวพิมพ์ใหญ่และตัวเลข 2 ถึง 7",
    "ciZV21": "Base45 เป็นสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเองโดยใช้ชุดสัญลักษณ์แบบจำกัดที่มนุษย์สามารถใช้งานได้สะดวกและประมวลผลโดยคอมพิวเตอร์ ฐานตัวเลขสูงส่งผลให้สตริงสั้นกว่าระบบทศนิยมหรือฐานสิบหก Base45 ได้รับการปรับให้เหมาะสมสำหรับการใช้งานด้วยรหัส QR",
    "ciZV2deq1": "Base58 (คล้ายกับ Base64) คือสัญลักษณ์สำหรับการเข้ารหัสข้อมูลไบต์ที่กำหนดเอง มันแตกต่างจาก Base64 โดยการลบอักขระที่อ่านผิดได้ง่าย (เช่น l, I, 0 และ O) เพื่อปรับปรุงให้มนุษย์อ่านง่ายขึ้น Base58 มักใช้ในสกุลเงินดิจิทัล (Bitcoin, Ripple ฯลฯ)",
    "cj1pd": "รีเฟรชการดำเนินการ",
    "cjzqj9": "บอสเนีย",
    "cmxzpg": "มาลายาลัม",
    "coM2I": "ใช้ตัวแก้ไขอัจฉริยะ",
    "code": "รหัส",
    "code.examples": "ตัวอย่างโค้ด",
    "code.resources": "ทรัพยากรรหัส",
    "code.samples": "ตัวอย่างโค้ด",
    "code.snippets": "ข้อมูลโค้ด",
    "code.templates": "เทมเพลตโค้ด",
    "code.tools": "เครื่องมือโค้ด",
    "codecs.seo": "ตัวแปลงสัญญาณออนไลน์ - Base64, ตัวเข้ารหัส URL, MD5, SHA1, SHA256, SHA512",
    "convert.camelcase": "การแปลงกรณีอูฐ",
    "convert.kebabcase": "การแปลงกรณีเคบับ",
    "convert.snakecase": "การแปลงกรณีงู",
    "converters.seo": "ตัวแปลงข้อมูลออนไลน์ - JSON เป็น XML, JSON เป็น CSV, JSON เป็น YAML, XML เป็น JSON, YAML เป็น JSON",
    "crZZ_WXlw": "ดูที่เกี่ยวข้อง",
    "cuRCqb": "ไม่มีหมวดหมู่",
    "cxqhqa": "เมียนมาร์ (พม่า)",
    "d-l2l": "ยืนยัน",
    "d-qPr": "รูปแบบที่ไม่รู้จัก: {0}",
    "d33qw": "จาก {0}",
    "d5KZH": "ขอขอบคุณที่ใช้ LafTools!",
    "d5LAU": "ได้รับอนุญาตภายใต้ AGPLv3",
    "d5fmq2": "ภาษาอิตาลี",
    "d5hit": "เซสชัน - {0}",
    "d5x1rl": "สเปน",
    "dCFIC": "โค้ดสวยกว่า",
    "dCFIwC": "เครื่องกำเนิดรหัส",
    "dGKMx": "เอาท์พุต",
    "dGVUB": "เครื่องมือเครือข่าย",
    "dQwjNbi0y": "เรียนรู้เพิ่มเติมเกี่ยวกับเอกสารประกอบ",
    "dV5Eq": "รีเฟรชรายการพื้นที่ทำงาน",
    "dXHovRa7X": "ไปยังเอนทิตี HTML",
    "ddf2Y2Y2": "ถอดรหัส {0}",
    "ddq.tdqwq": "หลบหนี {0}",
    "desc.less": "เยื้องและปรับแต่งโค้ด {0}",
    "desc.scss": "เยื้องและปรับแต่งโค้ด SCSS",
    "dhuZijLJ2": "แปลงสตริงเป็นเคบับ-เคส",
    "dk122q": "จัดการขั้นตอนการทำงานของคุณเพื่อรวมเครื่องมือต่างๆ เข้าด้วยกัน",
    "dkarh": "โอเค กล่องเครื่องมือเปิดไดเร็กทอรี หากไม่มีหน้าต่างป๊อปอัป โปรดตรวจสอบว่าแพลตฟอร์มของคุณรองรับฟังก์ชันนี้หรือไม่ หรือไดเร็กทอรีอยู่ในเซิร์ฟเวอร์",
    "dkkq12": "กำหนดค่าเครื่องมือของคุณในแท็บนี้",
    "dl4kr": "ลืมรหัสผ่าน?",
    "dmqwm312": "ตัวแปลงฐานแปด",
    "download-local": "ดาวน์โหลดฟรี",
    "dpRY4": "พจนานุกรม",
    "dqTqyvWY": "เมนูลิ้นชัก",
    "dqw3312": "ตัวแปลงไบนารี",
    "dqwew": "ถึง {0}",
    "dqwrq3w13": "{0} แฮช",
    "dsdpA_eJ": "ปรับขนาด",
    "dtjdt4": "คาซัค",
    "dxLQq": "การอนุญาตรูต",
    "dzjTo": "กรุณาระบุรหัสผ่านบัญชีที่นี่",
    "e3WgQaZlb": "บีบอัด {0}",
    "e4Cd8t": "เบส85",
    "e5rycw": "คีร์กีซ",
    "e7Afj0xo2": "เข้ารหัสอักขระพิเศษทั้งหมด",
    "e8Crq": "กรุณากรอกชื่อผู้ใช้และรหัสผ่านด้านล่างเพื่อดำเนินการต่อ",
    "eTJ2EDLfW": "แฮช MD5",
    "eTmq": "ประวัติความเป็นมาของกล่องเครื่องมือ CodeGen",
    "eYg7ZNBH6": "จาก เฮกซ์ดัมพ์",
    "e_8pZ": "กล่องเครื่องมืออเนกประสงค์สำหรับนักพัฒนาเพื่อปรับปรุงประสิทธิภาพการทำงาน",
    "ediql2": "ภาษาฮังการี",
    "eg18QOMrM": "สลับแล้ว",
    "egkqC8t": "เบส58",
    "egkqCd8t": "ฐาน62",
    "eifoni": "คาตาลัน",
    "encoding.seo": "เครื่องมือเข้ารหัสออนไลน์ - ตัวเข้ารหัส URL, Base64, Escape, Unescape, เข้ารหัส URI, ถอดรหัส URI",
    "eqkqd4W": "โปรดระบุชื่อสำหรับแท็กใหม่",
    "eqwwew": "เครื่องกำเนิดแบบสุ่ม",
    "etV-l": "คัดลอกไฟล์ไปยัง SIT2",
    "eu5mh0": "เบลารุส",
    "euaI8": "สร้างบัญชีท้องถิ่นใหม่",
    "eubZz3MEq": "แปลงอักขระทั้งหมด",
    "euhy9v": "เอสโตเนีย",
    "f3ttw8": "ชาวเมารี",
    "f5bLC": "เอกสารประกอบ",
    "f7Fp-L9V-": "ย้อนกลับ",
    "f7akol": "ภาษาอังกฤษ",
    "fBP5h": "ชื่อผู้ใช้",
    "fEr5j": "สร้างสคริปต์ใหม่",
    "fV_1P": "เข้าสู่ระบบ",
    "fdtedX-": "{0} หลบหนี",
    "fdxluz": "โรมาเนีย",
    "ff02c": "ยกเลิก",
    "fgj880": "เตลูกู",
    "forgot.password": "ลืมรหัสผ่าน",
    "format.code.seo": "รูปแบบ {0} โค้ด",
    "formatcsharp": "จัดรูปแบบ YAML",
    "formatcss": "จัดรูปแบบ CSS",
    "formatjavascript": "จัดรูปแบบจาวาสคริปต์",
    "formatjson": "จัดรูปแบบ JSON",
    "formatmd": "เยื้องและปรับแต่งเอกสาร Markdown",
    "formatts": "เยื้องและปรับแต่งโค้ด TypeScript",
    "formatyaml": "จัดรูปแบบ YAML",
    "fqV_1P": "ปลดล็อค LafTools ของคุณ",
    "from.022s5i1Yn": "รูปแบบฐานแปด",
    "from.02YEuozhq16": "กรณีบนและล่าง",
    "from.0s5i1Yn": "รูปแบบทศนิยม",
    "fromBinarKezpBENwt3": "จาก {0}",
    "fromBinary.text.1b6c3": "แปลงสตริงไบนารี่กลับเป็นรูปแบบดิบ",
    "fw-66JBSB": "ตัวพิมพ์ใหญ่/ตัวพิมพ์เล็ก",
    "g2_aX": "คัดลอกรหัสผ่านที่เข้ารหัสลงในไฟล์",
    "g5SK9": "เปิดล่าสุด",
    "gDjbs": "ข้อมูลทางประวัติศาสตร์",
    "gGpTg5Wn_": "รูปแบบเอนทิตี HTML",
    "gK3dNQ": "สำเนา",
    "gLs6rHJKT": "ล้มเหลวในการประมวลผลเนื่องจากข้อผิดพลาด: {0}",
    "gN5dihIY8e": "เข้ารหัสอักขระที่มีปัญหาเป็นการเข้ารหัสเปอร์เซ็นต์ ซึ่งเป็นรูปแบบที่ URI/URL รองรับ",
    "gN5idqhIY8e": "เข้ารหัสอักขระที่มีปัญหาเป็นการเข้ารหัสเปอร์เซ็นต์ ซึ่งเป็นรูปแบบที่ URI/URL รองรับ",
    "gN5ihdIY8e": "เข้ารหัสอักขระที่มีปัญหาเป็นการเข้ารหัสเปอร์เซ็นต์ ซึ่งเป็นรูปแบบที่ URI/URL รองรับ",
    "gQhfS": "เครื่องมือไฟล์",
    "gRm8pxMSS": "จัดรูปแบบแล้ว",
    "generators.seo": "ตัวสร้างออนไลน์ - ตัวสร้าง UUID, ตัวสร้าง GUID, ตัวสร้างแบบสุ่ม",
    "generic-NI-UFPTe0": "ตกแต่งรหัสทั่วไปให้สวยงาม",
    "generic-code-beautify.desc.2b3c": "การดำเนินการนี้จะจัดรูปแบบโค้ดในภาษาการเขียนโปรแกรมต่างๆ เพื่อปรับปรุงให้อ่านง่ายขึ้นโดยการใช้การเยื้อง การขึ้นบรรทัดใหม่ที่สอดคล้องกัน และการปฏิบัติตามแนวทางสไตล์เฉพาะภาษา",
    "gkC8t": "ฐาน64",
    "gkdqqC8t": "เบส45",
    "gkqC8t": "ฐาน32",
    "gms7_9n5v": "แปลงสตริงไบต์ฐานสิบหกกลับเป็นค่าดิบ",
    "gnKMZ": "สดชื่น",
    "graphql.format.btn": "รูปแบบ {0}",
    "graphql.format.desc": "เยื้องและปรับแต่งโค้ด GraphQL",
    "h2Y2Y2Yeq2Y": "YAML ฟอร์แมตเตอร์",
    "h6AeI": "การเชื่อมต่อ Websocket ปิดเมื่อ {0}",
    "h97aov0Ab": "สร้างแฮช SHA-0 จากข้อความ SHA-0 ไม่ปลอดภัยและไม่ควรใช้",
    "hAK6Q4uV0": "เลขฐานแปด",
    "hJUMN": "ภาษาเป้าหมาย",
    "hMvh1": "ฐานข้อมูลสำรอง",
    "hQX9jlm9F": "ถึง {0}",
    "hRFxV": "สำหรับข้อมูลเพิ่มเติม กรุณาเยี่ยมชมเว็บไซต์ของเรา",
    "hX1CWGAhl": "เยื้องและปรับแต่งโค้ด eXtensible Markup Language (XML)",
    "hZo9cdqwX": "แสดงการดำเนินการอื่น ๆ",
    "hZo9cqwX": "แสดงทางเลือกอื่นๆ",
    "hcnt1k": "มาซิโดเนีย",
    "hhOT3": "ค้นหาตามชื่อ",
    "htTmvWjsS": "บีบอัดโค้ด Cascading Style Sheets (CSS)",
    "html-beautify.desc.2a5f9": "ตกแต่ง XML อินพุตให้สวยงามด้วยการเพิ่มการเยื้องและการขึ้นบรรทัดใหม่เพื่อให้อ่านง่ายขึ้น",
    "htt1d2": "เอสเปรันโต",
    "hu-iz": "ตัวจับเวลา",
    "huE6U": "ตัวแปร",
    "hyV-d": "เสร็จแล้ว",
    "hyirc0": "ภาษาสวีเดน",
    "i27qmr": "ฟริเซียน",
    "i6hMN": "รหัสยืนยันรูปภาพ",
    "i88tb": "ส่งออกผลลัพธ์เป็นไฟล์",
    "iLYwoR0xe": "จาก {0}",
    "iNqF1T": "จัดการบัญชีคลาวด์",
    "iOEjZ": "ไม่มีรหัสที่ใช้ได้",
    "iVfYXX1C5": "ป้อนชื่อไฟล์",
    "i_lang_": "ชุดภาษา",
    "iknTS": "ผู้จัดการรหัสผ่าน",
    "init_env": "กำลังโหลดทรัพยากรระบบ",
    "ip2g1": "คัดลอกแล้ว",
    "ipOSQE": "รุ่นโปร",
    "isti": "เยื้องสตริง",
    "istqwi": "เยื้องสตริง",
    "it8ths": "ชาวอินโดนีเซีย",
    "ixyP0": "ประมวลผลการดำเนินการแบบเรียลไทม์โดยอัตโนมัติ",
    "j5KxYotVC": "MessagePack",
    "j7Ja3E8kT": "รูปแบบ",
    "jFdaRPHE6": "ถึง {0}",
    "jIe5giARD": "กลับลำดับของอักขระในข้อความ",
    "jJuNz": "ภาษาต้นฉบับ",
    "jO5eP": "ตกลง",
    "jPNCb": "ลองใหม่แล้ว",
    "jPU1nKpNP": "เยื้องและปรับแต่งโค้ด HyperText Markup Language (HTML)",
    "jQXdi": "โหมดแสง",
    "jR1zX": "เอไอ แล็บ",
    "jSZmia6Zl": "แผงควบคุม",
    "jb392": "ชื่อ",
    "jfpqt": "ตัวนำทางหมายเหตุ",
    "jgDoEq": "ไม่มีข้อมูลคำถามที่พบบ่อย",
    "jhDoE": "การดึงข้อมูลคำถามที่พบบ่อย",
    "jlxvpk": "เกาหลี",
    "json-beautify.desc.0912": "การดำเนินการนี้จะจัดรูปแบบข้อมูล JSON เพื่อปรับปรุงให้อ่านง่ายขึ้นโดยการเพิ่มการเยื้อง การขึ้นบรรทัดใหม่ และการเรียงลำดับคีย์ที่เหมาะสมอย่างสม่ำเสมอ",
    "json-beautify.name.0912": "จัดรูปแบบ SQL",
    "json-beautify.text.93kq": "ตกแต่งข้อมูล JSON ให้สวยงาม",
    "json2csv.31": "CSV เป็น JSON",
    "json2xml.t": "JSON เป็น XML",
    "json2yaml.t": "JSON เป็น YAML",
    "jsondf2csv.31": "JSON เป็น CSV",
    "jsonescapeandunescape": "Escape และ Escape สตริง JSON ทำให้ปลอดภัยที่จะรวมในการสืบค้น URL",
    "k12k3": "เรียงลำดับคีย์วัตถุ",
    "k17PG": "การเชื่อมต่อ Websocket ปิดแล้ว",
    "k2SVY": "ปิด",
    "k2ku5p": "เช็ก",
    "k41a5": "ลาฟทูลส์",
    "k4s5rx": "ภาษาสโลเวเนีย",
    "kLH79": "อีเมล",
    "kOi5A": "พิมพ์หน้า",
    "kPD22": "พจนานุกรม",
    "kPJ-A4": "รีเฟรช",
    "kRvYRzTAF": "แปลงข้อมูลไบนารีเป็น Hexdump และในทางกลับกัน",
    "kcHxr": "กรุณาระบุชื่อผู้ใช้บัญชีผู้ดูแลระบบที่นี่",
    "kjks1": "กำลังดึงการกำหนดค่า i18n จาก API เซิร์ฟเวอร์ภายในเครื่อง",
    "kqv5ht": "ภาษายิดดิช",
    "krxSK": "ผู้ช่วยเอไอ",
    "ks12d": "ความปลอดภัยทางไซเบอร์",
    "kv4wag": "ภาษาดัตช์",
    "kz7jdyWRq": "แปลงค่าที่คั่นด้วยจุลภาค (CSV) เป็นรูปแบบ JavaScript Object Notation (JSON)",
    "l3akoa": "อัมฮาริก",
    "l3k11X8qw": "JSON หลบหนี",
    "l6Djb": "เลือกหนึ่งในตัวเลือกเป็นธีมที่คุณต้องการ:",
    "lBOiJaOU1": "เกี่ยวกับ {0}",
    "lIn3_": "ชื่อผู้ใช้ของผู้ดูแลระบบ",
    "lQFII": "ทริกเกอร์การเริ่มต้นอีกครั้ง",
    "lRHDQ": "ออกจากโหมดเต็มหน้าจอ",
    "lTmHBSlw8": "แปลง Hexdump เป็นข้อมูลไบนารีและในทางกลับกัน",
    "lUh5c": "เครื่องกำเนิดไฟฟ้า",
    "l_mqgrQPlq": "ซ่อนการดำเนินการอื่น ๆ",
    "less.format.btn": "รูปแบบ {0}",
    "less.format.desc": "เยื้องและปรับแต่งโค้ดให้น้อยลง",
    "lkuulh": "ภาษาฝรั่งเศส",
    "lp0qmd0": "ทำเครื่องหมายว่าเป็นรายการโปรด",
    "lpKAz": "การตั้งค่า",
    "lpzg83": "ซามัว",
    "m0106": "ตัวแปลง",
    "m0107": "เครื่องกำเนิดไฟฟ้า",
    "m0108": "ฟอร์แมตเตอร์",
    "m7WZw": "ระบบ Websocket ใช้งานไม่ได้",
    "m8rTc1": "เมื่อใช้งานตัวจัดการเชลล์สคริปต์แล้ว คุณจะสามารถใช้เพื่อจัดการคำสั่งเชลล์ของคุณได้",
    "mBgF1": "การกระทำของเมาส์",
    "mSFei": "ซอร์สโค้ดบน GitHub",
    "mWXeh": "รหัสพื้นที่ทำงาน: {0}",
    "mabHq": "ค้นหาไฟล์เก่า",
    "mbzCv": "เกิดข้อผิดพลาด: {0} เวลาที่ปฏิเสธคือ {1}",
    "md2.desc.1039": "การดำเนินการนี้แฮชข้อมูลลงในแฮช {0}",
    "md2.text.192d3": "สร้างแฮช {0}",
    "md2aO2NaJITm": "เยื้องและปรับแต่งโค้ด Cascading Style Sheets (CSS) ทำให้อ่านและทำความเข้าใจได้ง่ายขึ้น",
    "md2aO2NaJqITm": "เยื้องและปรับแต่งเอกสาร Markdown",
    "md4.desc.1039": "การดำเนินการนี้แฮชข้อมูลลงในแฮช {0}",
    "md4.text.192d3": "สร้างแฮช {0}",
    "md5.desc.rxsHq": "การดำเนินการนี้แฮชข้อมูลลงในแฮช {0}",
    "md5.textiDjMIo": "สร้างแฮช {0}",
    "md6.desc.1039": "การดำเนินการนี้แฮชข้อมูลลงในแฮช {0}",
    "md6.text.192d3": "สร้างแฮช {0}",
    "mdAX47hMZ": "แปลงสตริงเป็น Snake_case",
    "mdhWk4dtid": "ตัวเข้ารหัส URL",
    "meeMC1Uk7.text.93kq": "ย่อขนาด {0}",
    "mhWk4ddtid": "การเข้ารหัส",
    "mhWk4ddtid.long": "เครื่องมือเข้ารหัสและถอดรหัส",
    "mihc3": "เสร็จสิ้นการดำเนินการนี้",
    "mjHoR": "นอกจากนี้ ในทางเทคนิคแล้ว ไม่มีใครสามารถอ่านโทเค็นนี้ได้ ไม่เช่นนั้นเขาจะโจมตีและควบคุมคอมพิวเตอร์ของคุณ",
    "mnb19i": "เยอรมัน",
    "mslw4o": "กรีก",
    "mwn7iv": "ซูลู",
    "myxedr": "มองโกเลีย",
    "n1jA9": "ยืนยัน",
    "n24tes": "โปรตุเกส (บราซิล)",
    "n28g4di0L": "คู่มือ",
    "n8vUMLVSV": "กฎการตั้งชื่อ",
    "n94an4": "ขัด",
    "nSeIq8-": "สิ่งสำคัญที่สุดคือเป็นบริการฟรีและโอเพ่นซอร์ส คุณสามารถใช้มันเพื่อวัตถุประสงค์ส่วนตัวหรือเชิงพาณิชย์ของคุณ",
    "nTvw4": "เพื่อปกป้องและบันทึกข้อมูลและการตั้งค่าของคุณแยกกัน คุณสามารถใช้บัญชีท้องถิ่นของคุณเพื่อบรรลุเป้าหมายดังกล่าว นอกจากนี้ LafTools จะรองรับวิดเจ็ตข้อความโต้ตอบแบบทันทีในหมู่ผู้ใช้ในอนาคต",
    "nmb1wx": "โยรูบา",
    "nodBw": "การดำเนินการนี้จะเข้ารหัสข้อมูลดิบเป็นสตริง ASCII {0}",
    "nrix6l": "ชิเชวา",
    "nskqw": "ลบตัวอักษรที่ไม่ใช่ตัวอักษร",
    "o1umzi": "ภาษาฝรั่งเศส",
    "o52xW": "ส่งออก",
    "o8xyzu": "ภาษาลักเซมเบิร์ก",
    "oBz8D": "กำลังโหลด",
    "oINAgNij0": "แปลงข้อมูลอินพุตเป็นอาร์เรย์จำนวนเต็มลำดับ<br><br>เช่น <code>สวัสดี</code> กลายเป็น <code>72 101 108 108 111</code>",
    "oNLxH": "ชื่อผู้ใช้",
    "oNg3f": "เว็บไซต์อย่างเป็นทางการ",
    "ocxsw3": "ไอริช",
    "of_ox": "โดยรวมแล้ว LafTools เป็นโซลูชั่นแบบครบวงจรสำหรับทุกความต้องการของคุณ",
    "oj23X": "กู้คืนฐานข้อมูล",
    "ojCWEFdVe": "บีบอัดโค้ด JavaScript ลบอักขระที่ไม่จำเป็นทั้งหมด",
    "ooiFU": "เริ่มบริการ Java ใหม่",
    "opdddkqw": "แปลงข้อมูล JSON เป็นสตริง XML",
    "opddkqw": "แปลงข้อมูล JSON เป็น CSV ตามคำจำกัดความใน RFC 4180",
    "opdqdkqw": "XML เป็น JSON",
    "opqdkqw": "JSON เป็น CSV",
    "oqHqVq": "เรียงตาม",
    "oqHqqV": "ทั้งหมด: {0} คำสั่ง",
    "oqHqqVq": "คัดลอกไทม์ส",
    "oqjbcj": "ลาว",
    "os8h6u": "ภาษาเดนมาร์ก",
    "p8Exxc1s": "มีเครื่องมือมากมายที่ใช้ประโยชน์จากเทคโนโลยี AI เพื่อทำงานอย่างมีประสิทธิภาพมากขึ้นในห้องปฏิบัติการ AI",
    "pANmj": "แท็กสามารถกำหนดได้ตามประเภทเซิร์ฟเวอร์ การใช้สคริปต์ หรือเกณฑ์อื่นๆ ที่คุณต้องการ",
    "pA_deJ": "ส่งออกไปยังคลิปบอร์ด",
    "pA_feeJ": "เชื่อมต่อเทอร์มินัลอีกครั้ง",
    "pA_qweJ": "ล้างบัฟเฟอร์",
    "pDBSWq": "ไม่มีเนื้อหาสำหรับแผงด้านขวา",
    "pENGfAKuz": "แสดงแผงด้านล่าง",
    "pEk1kk": "LafTools นำเสนอฟังก์ชันการทำงานที่เป็นประโยชน์สำหรับคุณที่นี่",
    "pEk1qkk": "แสดงรายการแท็บที่เปิดอยู่ทั้งหมด",
    "pJoOz": "เปิดไฟล์",
    "pKHRT": "ไปที่เครื่องมือ",
    "pKqHRq": "ค้นหาหมายเหตุ",
    "pL6qH": "สมบูรณ์.",
    "parsers.seo": "ตัวแยกวิเคราะห์ SQL ออนไลน์",
    "ph5jH": "จัดการในส่วนนี้",
    "piih4x": "ทาจิก",
    "pkP920Upx": "แปลงสตริงเป็น MessagePack",
    "pkprdvdA2O": "ตัวย่อ JSON",
    "pkprvdA2O": "JSON ฟอร์แมตเตอร์",
    "pmnp4b": "ภาษายูเครน",
    "ppmz8e": "ชาวเฮติครีโอล",
    "pqs7y3": "โปรดพิจารณาลงทะเบียนหน้าเว็บนี้เป็น PWA เพื่อรับการสนับสนุนคีย์แมปเต็มรูปแบบ",
    "psA_eJ": "ส่งออกเป็นไฟล์",
    "psZoP": "วางไฟล์ที่นี่เพื่อประมวลผล",
    "psqqpq_o": "เอาล่ะ ผลลัพธ์ถูกคัดลอกไปยังคลิปบอร์ดของคุณแล้ว {0} ครั้ง",
    "pzn2IpkDo": "เยื้องและพิมพ์โค้ด JavaScript Object Notation (JSON) อย่างสวยงาม<br><br>Tags: โปรแกรมดู json, ปรับให้สวยงาม, การเน้นไวยากรณ์",
    "q12beqwR": "ไม่มีเครื่องมือที่ใช้ได้",
    "q29t31": "ขัด",
    "q9iuti": "เวลส์",
    "qDrbEr": "ชื่อผู้ใช้ที่คุณระบุว่างเปล่า โปรดตรวจสอบและลองอีกครั้ง",
    "qF4uS2": "สร้างพื้นที่ทำงาน",
    "qF4uS23": "หน้าต่างใหม่",
    "qHoktx": "ขอบคุณ!",
    "qMhNfAmTL": "เป็นตัวพิมพ์ใหญ่",
    "qN1LdZ2": "แก้ไขครั้งล่าสุด",
    "qQmBr": "การแปลข้อความ",
    "qTqyvWdY": "ยังไม่เสร็จ",
    "qWemXE4": "1 ม.ค. 2024",
    "qWw3eTH": "ส่วนนี้ช่วยรักษาไฟล์บนดิสก์ภายในเครื่องหรือคลาวด์ดิสก์ของคุณ",
    "qdeFXx": "ขณะนี้ หน้านี้ที่คุณกำลังมองหายังใช้งานไม่ครบถ้วน",
    "qeeqw": "เครื่องกำเนิด GUID",
    "qm6Fy9AB2": "แสดงนาวิเกเตอร์ด้านซ้าย",
    "qpDBSW": "ไม่มีแผงที่ใช้ได้",
    "qpDBSWe1": "ไม่มีแผงที่ใช้ได้",
    "qqK_x_": "เข้าสู่ระบบ",
    "qqqwYoz": "ช่วย",
    "qqwYoz": "แท็บ",
    "qqwYqwe": "พื้นที่ทำงาน",
    "qtpmvP": "ยืนยันรหัสผ่านท้องถิ่น",
    "qwwqee": "เครื่องกำเนิด UUID",
    "qyAroN_NT": "มาตรฐาน",
    "qzshys": "ภาษาอูรดู",
    "r0NL0Semh": "แปลงสตริงอินพุตเป็นตัวพิมพ์แบบ Camel\\n<br><br>\\nตัวพิมพ์แบบ Camel เป็นตัวพิมพ์เล็กทั้งหมด ยกเว้นตัวอักษรที่อยู่หลังขอบเขตคำซึ่งเป็นตัวพิมพ์ใหญ่\\n<br><br>\\ne.g. thisIsCamelCase\\n<br><br>\\n'พยายามรับรู้บริบท' จะทำให้การดำเนินการพยายามแปลงชื่อตัวแปรและฟังก์ชันอย่างสวยงาม",
    "r0aK8uIdB": "เป็นตัวพิมพ์เล็ก",
    "r1GLS": "แท็ก",
    "rE6fUsSGl": "เยื้องและปรับแต่งโค้ด Structured Query Language (SQL)",
    "rK6cx": "{0} ออกแบบและพัฒนาโดยทีมงาน LafTools",
    "rQkas": "ยินดีต้อนรับสู่ LafTools",
    "rT34qnO": "ป้อนข้อความเพื่อการประมวลผล ผลลัพธ์จะแสดงในตัวแก้ไขเอาต์พุต",
    "rVdu": "ถอดรหัส {0}",
    "rVqlu": "ถอดรหัส {0}",
    "rWF_pLlje": "พยายามแปลง hexdump กลับเป็นข้อมูลดิบ",
    "rYSpwq": "อัลกอริธึม MD2 (Message-Digest 2) เป็นฟังก์ชันแฮชการเข้ารหัสที่พัฒนาโดย Ronald Rivest ในปี 1989 อัลกอริธึมนี้ได้รับการปรับให้เหมาะสมสำหรับคอมพิวเตอร์ 8 บิต แม้ว่า MD2 จะไม่ถือว่าปลอดภัยอีกต่อไป แม้ว่าในปี 2014 แต่ก็ยังคงใช้งานอยู่ในที่สาธารณะ โครงสร้างพื้นฐานที่สำคัญซึ่งเป็นส่วนหนึ่งของใบรับรองที่สร้างด้วย MD2 และ RSA อัลกอริธึมการแยกข้อความประกอบด้วย 18 รอบตามค่าเริ่มต้น",
    "rZL0xuQu2": "ถึงเลขฐานสิบหก",
    "r_n6h": "โหมดสว่างหรือมืด",
    "raTAuBwBz": "แปลงไฟล์ CSV เป็นรูปแบบ JSON",
    "rcVSYDdBN0": "การดำเนินการด่วน: {0}",
    "remove-whitespace": "ลบช่องว่าง",
    "reverse.text": "ข้อความย้อนกลับ",
    "rf0mql3": "ธีมสว่างหรือมืด",
    "rlgb9OKEz": "มากกว่า",
    "rub76Z8zx": "พยายามพิมพ์ภาษา C-style เช่น C, C++, C#, Java, PHP, JavaScript ฯลฯ ซึ่งจะทำงานได้ไม่สมบูรณ์ และโค้ดผลลัพธ์อาจไม่ทำงานอีกต่อไป การดำเนินการนี้ได้รับการออกแบบมาเพื่อทำให้โค้ดที่สับสนหรือย่อเล็กสุดอ่านและทำความเข้าใจได้ง่ายขึ้น สิ่งที่จะทำงานไม่ถูกต้อง: สำหรับการจัดรูปแบบลูป, การจัดรูปแบบลูป Do-While, การเยื้องสวิตช์/เคส, ตัวดำเนินการกะบิตบางตัว",
    "run_text": "ก่อนที่จะเข้าสู่โต๊ะทำงานของคุณ เราต้องการโหลดทรัพยากรระบบที่จำเป็นล่วงหน้าก่อน กรุณารอสักครู่จะแล้วเสร็จเร็วๆ นี้ โดยมีรายละเอียดดังนี้",
    "rycJy": "LafTools เป็นกล่องเครื่องมืออเนกประสงค์ที่ออกแบบมาสำหรับโปรแกรมเมอร์โดยเฉพาะ มันแสดงถึงเวอร์ชันที่สองของ CodeGen Toolbox ซึ่งขณะนี้มีรันไทม์ที่เบากว่าที่เขียนใน Golang และ JavaScript",
    "ryhkqb": "บัลแกเรีย",
    "s-fxP80Dd": "LafTools IDE",
    "s0vrf9": "ภาษาฮีบรู",
    "s4OeX": "เข้าสู่ระบบสำเร็จ",
    "sO0MOe": "ทุกครั้งที่คุณอยู่ในหน้าต่างนานกว่า 5 วินาที หน้าต่างนั้นจะแสดงที่นี่",
    "sR8yc": "ปิด",
    "sUg3HK9qI": "สร้างแฮช SHA-2 จากข้อความ",
    "sc49my": "สินธี",
    "scss.format.btn": "รูปแบบ {0}",
    "scss.format.desc": "เยื้องและปรับแต่งโค้ด SCSS",
    "sd.texdqw": "หลบหนี {0}",
    "sdfk1": "เลื่อนแท็บไปทางซ้าย",
    "sdfk13": "เลื่อนแท็บไปทางขวา",
    "sdfqw": "ฐาน64",
    "seo.description.codecs": "ใช้ตัวแปลงสัญญาณออนไลน์ฟรีของเราเพื่อเข้ารหัสและถอดรหัสข้อมูลของคุณ รองรับ Base64, ตัวเข้ารหัส URL, MD5, SHA1, SHA256, SHA512",
    "seo.description.converters": "ใช้ตัวแปลงออนไลน์ฟรีของเราเพื่อแปลงข้อมูลของคุณระหว่างรูปแบบต่างๆ รองรับ JSON ถึง XML, JSON ถึง CSV, JSON ถึง YAML, XML ถึง JSON, YAML ถึง JSON",
    "seo.description.encoding": "ใช้เครื่องมือเข้ารหัสออนไลน์ฟรีของเราเพื่อเข้ารหัสและถอดรหัสข้อมูลของคุณ รองรับตัวเข้ารหัส URL, Base64, Escape, Unescape, เข้ารหัส URI, ถอดรหัส URI",
    "seo.description.format": "จัดรูปแบบโค้ดของคุณทางออนไลน์อย่างมีประสิทธิภาพด้วยเครื่องมือฟรีของเรา รองรับหลายภาษา รวมถึง JSON, JS, YAML, CSS, C# และ SQL ปรับปรุงความสามารถในการอ่านและรักษารูปแบบการเขียนโค้ดที่สอดคล้องกันทั่วทั้งโปรเจ็กต์ของคุณ",
    "seo.description.generators": "ใช้ตัวสร้างออนไลน์ฟรีของเราเพื่อสร้าง UUID, GUID และค่าสุ่มสำหรับแอปพลิเคชันของคุณ",
    "seo.description.parsers": "ใช้ตัวแยกวิเคราะห์ SQL ออนไลน์ฟรีของเราเพื่อแยกวิเคราะห์คำสั่ง SQL ของคุณและปรับปรุงประสิทธิภาพฐานข้อมูลของคุณ",
    "sglMS": "สร้างเวลา",
    "siDRGnz0u": "ถึงกรณีเคบับ",
    "sign.in": "เข้าสู่ระบบ",
    "sign.in.description": "ลงชื่อเข้าใช้บัญชีของคุณเพื่อเข้าถึงข้อมูลและการตั้งค่าที่บันทึกไว้",
    "sign.in.title": "ลงชื่อเข้าใช้บัญชีของคุณ",
    "sign.up": "ลงชื่อ",
    "sjod7G6WL": "ศูนย์ผู้ใช้",
    "sk123": "ยังไม่เสร็จ",
    "skq3i12": "ตัวอักษร",
    "slqcWD": "ส่วนลอจิกนี้ยังไม่รองรับ โปรดคอยติดตาม",
    "snakecasecon": "แปลงกรณีงู",
    "spCqEa": "ทำ",
    "spdh98": "จีนตัวย่อ",
    "sr9eCEJ0b6M": "รับทรัพยากรด้วย LafTools!",
    "srynotavai": "ขออภัย เครื่องมือนี้ไม่พร้อมใช้งานในขณะนี้",
    "ssDaOq": "ยังใหม่กับ LafTools ใช่ไหม?",
    "ssm80i": "บาสก์",
    "str.codecs": "ตัวแปลงสัญญาณ",
    "str.codecs.long": "เครื่องมือเข้ารหัสและถอดรหัส",
    "str.converters": "ตัวแปลง",
    "str.formatter": "ฟอร์แมตเตอร์",
    "str.formatters.long": "ตัวจัดรูปแบบโค้ดด่วน",
    "str.login": "เข้าสู่ระบบ",
    "str.mostused": "ใช้บ่อย",
    "str.parsers": "พาร์เซอร์",
    "str.parsers.long": "แยกวิเคราะห์และวิเคราะห์รูปแบบข้อมูลทั่วไป",
    "str.register": "ลงทะเบียน",
    "str.remarks": "รายการโปรด",
    "str.usercentre": "ศูนย์ผู้ใช้",
    "svqh06": "อาเซอร์ไบจัน",
    "sys_updates": "การอัปเดตระบบล่าสุด",
    "t6wczq": "โคซา",
    "t84q1z": "อาร์เมเนีย",
    "t8c6xc": "โซมาเลีย",
    "tBIX-d": "หน้าต่าง",
    "tIy3Q": "พบกับข้อผิดพลาด",
    "tIyq3Q": "พบกับข้อผิดพลาด",
    "tWe1yF": "ไม่มีคำสั่งเชลล์ที่ใช้ได้",
    "tY3p1": "ข้อมูลมากกว่านี้",
    "tZINaUR4b": "CSV เป็น JSON",
    "tail": "หาง",
    "thAvhgee7": "เครื่องมือสากล",
    "tiaiB": "ยกเลิก",
    "tmutZD17dx": "รูปแบบไบนารี",
    "tn7duf": "โครเอเชีย",
    "to.Jdzc-Fj9e": "ตัวแปลง MessagePack",
    "to.OIPWU3egZ": "รูปแบบเอนทิตี HTML",
    "to.camelcase.conv": "ตัวแปลงเคสอูฐ",
    "to.ch314mU8VGl": "รหัสถ่าน",
    "to.kebabcasconvee": "ตัวแปลงเคบับเคส",
    "to.lowercase": "ถึงตัวพิมพ์เล็ก",
    "to.morsecode.conve": "ตัวแปลงรหัสมอร์ส",
    "tpjs2gJDt": "แปลงอักขระทั้งหมด",
    "trywithclassicalwebui": "ลองใช้ Classical Web UI",
    "ttAre": "ป้อนรหัสผ่านธรรมดาของคุณที่นี่",
    "twamg": "ผู้ช่วย AI เสริมพลังความคิดสร้างสรรค์ของคุณ",
    "tyhgpr": "ชวา",
    "typescript.format.btn": "รูปแบบ {0}",
    "typescript.format.desc": "เยื้องและปรับแต่งโค้ด TypeScript",
    "uCTxxZbSG": "การดำเนินการค้นหาตามชื่อ",
    "uIuU_n418": "MessagePack",
    "uVF7T7TEt": "การถ่ายโอนข้อมูลแบบ Hexdump",
    "uVseB": "กด {0} เพื่อแสดงรายการฮ็อตคีย์",
    "uX0qFUazR": "ตัวแปลงทศนิยม",
    "ucDLv": "คุณได้คัดลอกบันทึกนี้มาแล้ว {0} ครั้ง",
    "ui5pZ": "คำสั่งแยกวิเคราะห์",
    "ulah0q": "ญี่ปุ่น",
    "unc9E": "ข้อความสุ่ม",
    "uraDHtTJj": "ใช้การดำเนินการใดๆ ที่คุณต้องการอย่างรวดเร็ว",
    "usr_defined": "การตั้งค่าระบบ",
    "uwqGE": "ไปที่เครื่องมือ",
    "v2YyGqwy2Yh": "ตัวจัดรูปแบบ XML",
    "v2wy2Yh": "ตัวย่อ XML",
    "v7q3db": "แบบไทย",
    "vGomqwTc": "รีเซ็ตการกำหนดค่า",
    "vI8Dqdr0T": "แปลงสตริงเป็นรหัสมอร์ส",
    "vOjNC": "ป้อนรหัสผ่านหรือรหัสความปลอดภัย",
    "vStNBMZ5t": "แปลงสตริงไบต์ฐานแปดกลับเป็นค่าดิบ<br><br>เช่น <code>316 223 316 265 316 271 316 254 40 317 203 316 277 317 205</code> กลายเป็นสตริงที่เข้ารหัส UTF-8 <code>Γειά σου</code>",
    "vTsQU": "โปรดระบุรหัสเชิญจากผู้ดูแลระบบของคุณ",
    "vU17B": "ไม่สามารถส่งคำขอได้",
    "vWqac": "ก่อนที่จะเข้าสู่โต๊ะทำงานของคุณ เราต้องการโหลดทรัพยากรระบบที่จำเป็นล่วงหน้าก่อน กรุณารอสักครู่จะแล้วเสร็จเร็วๆ นี้ โดยมีรายละเอียดดังนี้",
    "vYU1HVe-C": "แสดงการตั้งค่า",
    "vaP0vq": "ตั้งค่ารหัสผ่านภายในเครื่องสำเร็จ",
    "vci8rd": "ภาษาดัตช์",
    "vh9j4": "ป้อนข้อมูล",
    "vldqwI4": "{0} หลบหนี",
    "vo1prl": "สเปน",
    "vr93oi": "ภาษาฟินแลนด์",
    "vrfjnf": "ภาษาอิตาลี",
    "w1ANqKoBf": "ซ่อนข้อความในแถบด้านข้าง",
    "w1eV6tcKX": "การถ่ายโอนข้อมูลแบบ Hexdump",
    "w6otqn": "คอร์ซิกา",
    "w92j07": "ภาษารัสเซีย",
    "w9qudj": "ปัญจาบ",
    "wAxtg": "ในตอนแรก เราได้สร้าง UUID ให้เป็นโทเค็นที่ได้รับอนุญาตเพื่อให้คุณตั้งค่านี้ได้ จากสิ่งที่ LafTools ได้รับ โทเค็นที่คุณให้ไว้คือ {0} ซึ่งได้รับการยืนยันโดย LafTools เรียบร้อยแล้ว และด้วยเหตุนี้คุณจึงสามารถตั้งค่าแบบฟอร์มนี้ต่อไปได้",
    "wI1eh": "ต่อไป",
    "wQYoz": "ไฟล์",
    "wQdYoz": "แก้ไข",
    "wQdqwYoz": "ดู",
    "wRuF9WpU6": "วิ่งอัตโนมัติ",
    "wVApSGGdZ": "รองรับ JSON5 และ JSON พร้อมความคิดเห็น",
    "wcl1K": "การใช้งาน",
    "wgkk6y": "ภาษามอลตา",
    "wj3VS": "การดำเนินการนี้จะถอดรหัสข้อมูลจากสตริง ASCII {0} กลับเป็นรูปแบบ Raw",
    "wkMPt-ZDk": "ชื่อไฟล์ปลอดภัย",
    "wmuD_KXJ2": "ย้อนกลับสตริงอินพุต",
    "wsWcXd": "การแจ้งเตือน",
    "x009": "เพื่อเข้าถึงเอกสารการใช้งานของเรา",
    "x5alzu": "เคิร์ด (Kurmanji)",
    "x5tHV": "ภาพรวมของระบบ",
    "xMBv0": "กำลังโหลดทรัพยากรที่เกี่ยวข้อง...",
    "xOJqG1": "คำถามที่พบบ่อย",
    "xPHqP": "คำอธิบายยังไม่ได้กำหนด",
    "xQ_ls": "สำรองข้อมูล Redis",
    "x_XQ5afPY": "ถึงไบนารี่",
    "xbz0B": "ปิดแท็บทั้งหมด",
    "xbz0B2": "ปิดแท็บ",
    "xdqwe": "ยินดีต้อนรับสู่การใช้ LafTools!",
    "xeP4zV": "ดูรายการสิ่งที่ต้องทำของคุณอย่างรวดเร็ว",
    "xeP4zVd": "ค้นหาคำศัพท์ภาษาอังกฤษอย่างรวดเร็ว",
    "xml-bdeautify.desc.2a5f9": "ลดขนาดโค้ด XML",
    "xml-bdeautify.ktOtAx6Rd.2a5f9": "ลดขนาดโค้ด HTML",
    "xml-beautify.desc.2a5f9": "การดำเนินการนี้จัดรูปแบบข้อมูล XML เพื่อปรับปรุงความสามารถในการอ่านโดยการเพิ่มการเยื้อง การขึ้นบรรทัดใหม่ที่เหมาะสม และรับรองโครงสร้างที่มีรูปแบบที่ดี",
    "xml2json.t": "XML เป็น JSON",
    "xs22XLF": "ไม่มีข้อมูลสำหรับรหัสรายการนี้ โปรดพิจารณาเลือกรายการอื่น",
    "y3qjdd": "รหัสผ่านในเครื่องของคุณได้รับการยืนยันเรียบร้อยแล้ว",
    "y46w7Q9TH": "หาง",
    "y7LSbS5l4": "สลับไปที่โหมดแนวตั้ง",
    "y8Ir5": "ส่วนนี้ใช้สำหรับการเริ่มต้นบัญชีผู้ดูแลระบบของคุณ อย่างไรก็ตาม สำหรับตอนนี้ คุณยังไม่จำเป็นต้องสร้างหรือปรับเปลี่ยนใดๆ ที่นี่ เนื่องจากผู้ดูแลระบบของคุณตั้งค่าไว้ก่อนหน้านี้ โปรดละเลยส่วนนี้และดำเนินการตามขั้นตอนที่เหลือ",
    "y91lqtJbW": "แปลอักขระตัวอักษรและตัวเลขเป็นรหัสมอร์สสากล<br><br>ละเว้นอักขระที่ไม่ใช่มอร์ส<br><br>เช่น <code>SOS</code> กลายเป็น <code>... --- ...</code>",
    "yEZk8Ll0k": "จากทศนิยม",
    "yMZW-GEgf": "จัดรูปแบบ XML",
    "yMZW-figFKsdf": "รูปแบบ {0}",
    "ySVf-": "ลองคำขอนี้อีกครั้ง",
    "yTsqFO": "อัลกอริธึม MD4 (Message-Digest 4) เป็นฟังก์ชันแฮชการเข้ารหัสที่พัฒนาโดย Ronald Rivest ในปี 1990 ความยาวไดเจสต์คือ 128 บิต อัลกอริธึมมีอิทธิพลต่อการออกแบบในภายหลัง เช่น อัลกอริธึม MD5, SHA-1 และ RIPEMD ความปลอดภัยของ MD4 ถูกบุกรุกอย่างรุนแรง",
    "yVprb": "ส่วนนี้ยังอยู่ระหว่างการพัฒนา",
    "y_2Q1": "เข้ารหัสและถอดรหัส",
    "y_2Q2": "การเข้ารหัสแบบสมมาตร",
    "y_2Q3": "การเข้ารหัสแบบอสมมาตร",
    "y_2Q4": "อัลกอริทึมแห่งชาติของจีน",
    "y_2Q5": "การตรวจสอบสิทธิ์ทางเว็บ",
    "y_2Q5dqw": "ตัวจับคู่ข้อความ",
    "y_9YM": "ผลลัพธ์จะแสดงที่นี่",
    "y_BN6": "อัลกอริทึมย่อย",
    "ya0cwu": "มาเลย์",
    "yaml-beautify.desc.2a5f9": "การดำเนินการนี้จะจัดรูปแบบข้อมูล YAML เพื่อปรับปรุงให้อ่านง่ายขึ้นโดยเพิ่มการเยื้อง การขึ้นบรรทัดใหม่ที่เหมาะสม และรับรองว่าโครงสร้างมีรูปแบบที่ดี",
    "yaml.format.btn": "จัดรูปแบบ YAML",
    "yaml2json.t": "YAML เป็น JSON",
    "yc7dqiu": "จีนตัวย่อ",
    "yd-GEgf": "ย่อขนาด {0}",
    "yd-K99JOG91Z": "ย่อขนาด {0}",
    "yfYeg": "เทมเพลตข้อความ",
    "yiRso": "บันทึกเมฆ",
    "ykganl": "ภาษาเดนมาร์ก",
    "ymyfghy1r": "หมายเหตุ",
    "yqiRso": "หมายเหตุท้องถิ่น",
    "yqrxl4": "เซอร์เบีย",
    "yznU9": "ข้อมูลต้นไม้ว่างเปล่า",
    "z0j2nf": "ฮินดี",
    "z1oFn": "หลบหนีและหลบหนี",
    "z2FxMaOjF": "สู่ Hexdump",
    "z2jzej": "ภาษามราฐี",
    "z79b1a": "ภาษาอาหรับ",
    "zN2ES": "พื้นที่ทำงาน",
    "zc3Hf": "รหัสผ่าน",
    "zjDJk": "โปรดระบุเส้นทางไดเรกทอรีพื้นที่ทำงาน",
    "zkqUFa": "{0} ยังไม่ได้กำหนดค่า",
    "zkv375": "เขมร",
    "zmDWx": "ติดต่อเรา",
    "znVRwq": "ไฟล์",
    "zpyd34": "ภาษาอังกฤษ",
    "zqiIoqXw": "กำลังคำนวณ...",
    "zrovzToIM": "แปลงข้อความให้เทียบเท่ากับโค้ดอักขระยูนิโค้ด",
    "zzcepr": "เซบู"
}