{
    "R_S7_CLAo": "Contoh: Untuk mengekod 'TEST12345' dalam Base32, anda boleh menggunakan perpustakaan seperti base32-encode dalam Node.js, atau fungsi terbina dalam dalam bahasa lain seperti base64.b32encode Python.",
    "a4s6x": "Bagaimanakah Base32 berfungsi?",
    "a8b7z": "Oleh itu, padding hanya perlu jika kumpulan terakhir bit yang dikodkan tidak boleh dibahagikan dengan 40 bit (kerana 8 aksara Base32 mewakili 40 bit). Padding akan terdiri daripada sifar hingga enam aksara '=' pada penghujung rentetan yang dikodkan.",
    "b8g2k": "Senario penggunaan untuk Base32",
    "c0v2p": "Operasi biasa dengan Base32",
    "d1x7v": "Contoh lain ialah dalam Git, di mana objek cincang kadangkala disimpan dalam format Base32 untuk mengelakkan masalah dengan pengakhiran baris dan sekatan nama fail. Selain itu, HashiCorp Vault menggunakan Base32 untuk terbitan kunci.",
    "d9w7m": "Tambahan pula, kerana ia hanya menggunakan huruf besar, ia tidak boleh menggunakan semua kemungkinan kombinasi kepekaan huruf besar-besaran sebagai langkah keselamatan tambahan seperti Base64 yang kadangkala lakukan dengan lipatan huruf besar semasa penyahkodan.",
    "e5c7r": "Base32 ialah skema pengekodan binari-ke-teks yang mewakili data dalam rentetan ASCII menggunakan subset 32 ​​aksara. Ia direka bentuk supaya boleh dibaca manusia dan selamat URL.",
    "f0q4w": "Satu senario penggunaan yang popular adalah dalam menjana kunci rahsia untuk Pengesahan Dua Faktor (2FA), di mana perkhidmatan seperti Pengesah Google dan Yubikey menggunakan rahsia yang dikodkan Base32.",
    "f5a0s": "Selain itu, Base32 menghasilkan output yang lebih panjang tetapi boleh menjadi lebih sesuai untuk aplikasi tertentu seperti nama fail kerana kekurangan aksara khas yang mungkin bercanggah dengan peraturan sistem fail.",
    "g8r3e": "Kelemahan utama Base32 ialah kecekapan ruang yang agak lemah; ia mengembangkan data input sebanyak lebih kurang 25% lebih daripada Base64. Ini bermakna ia mengambil lebih banyak storan atau lebar jalur untuk jumlah data yang dikodkan yang sama.",
    "h4e1b": "Ia juga berguna untuk situasi di mana rentetan abjad angka sensitif huruf besar lebih mudah dikendalikan daripada perenambelasan atau base64, yang mungkin mengandungi aksara bukan abjad angka yang boleh menyebabkan isu dalam konteks tertentu (seperti URL atau nama fail).",
    "h9j3m": "Padding dalam Base32",
    "i9o7k": "Kelebihan Base32 berbanding Base64",
    "j1b5k": "Operasi paling biasa yang melibatkan Base32 termasuk pengekodan data binari ke dalam rentetan Base32 dan menyahkod rentetan Base32 kembali ke dalam format binari asalnya.",
    "k7g0n": "Dalam Base32, setiap 5 bit data input dipetakan kepada salah satu daripada 32 aksara daripada set 'ABCDEFGHIJKLMNOPQRSTUVWXYZ234567='.",
    "l1p9z": "Apakah itu Base32?",
    "m6d8b": "Setiap nilai 5-bit diwakili oleh satu aksara, membolehkan pengekodan dan penyahkodan yang cekap untuk sistem yang lebih suka bekerja dengan oktet (unit 8-bit).",
    "n3e7r": "Sejarah Pangkalan32",
    "p9s5t": "Base32 telah dibangunkan oleh Douglas Crockford, yang terkenal dengan sumbangannya kepada JavaScript, pada tahun 2001. Ia dicipta sebagai alternatif yang lebih dipercayai kepada pengekodan sedia ada seperti Base64, terutamanya untuk situasi yang memerlukan perwakilan berasaskan teks bagi data binari.",
    "q2w5m": "Tujuan menggunakan Base32?",
    "s5t0n": "Padding dalam Base32 melibatkan penambahan aksara '=' untuk memastikan bahagian akhir data yang dikodkan masih mengandungi gandaan 8 bit. Walau bagaimanapun, tidak seperti Base64, padding Base32 adalah minimum kerana setiap aksara Base32 sudah mengekod 5 bit.",
    "t8z1v": "Apabila tidak ada bit yang mencukupi pada penghujung untuk mengisi kumpulan 5-bit penuh, aksara padding '=' ditambah. Sebagai contoh, bait memerlukan dua aksara Base32, dan urutan 3-bait memerlukan empat aksara Base32.",
    "u3j9p": "Base32 sering digunakan apabila anda memerlukan perwakilan teks padat data binari yang boleh ditaip atau dicetak tanpa kehilangan maklumat, seperti dalam semakan integriti fail, geocaching dan penjanaan kata laluan selamat.",
    "y6t1n": "Kelemahan Base32",
    "z2x8c": "Base32 mempunyai lebih sedikit kekaburan visual kerana ia hanya menggunakan huruf besar dan digit, menjadikannya lebih mudah untuk membaca dan menyalin dengan tangan atau melalui telefon berbanding Base64 yang merangkumi '+', '/' dan huruf kecil.",
    "z6m1c": "Variasi kemudian seperti z-base-32 telah diperkenalkan untuk meningkatkan kebolehgunaan, menggantikan beberapa aksara yang kurang diingati dengan yang lain, tetapi spesifikasi asal Crockford masih digunakan secara meluas hari ini."
}