{
    "41ev7": "MD2",
    "5-S-B": "MD4 aus Datei",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) ist eine kryptografische Hash-Funktion, die eine Eingabe entgegennimmt und einen 128-Bit-Hash-Wert (16 Byte) erzeugt. Es wurde 1989 von Ronald Rivest als Nachfolger von MD1 entwickelt. MD2 ist für 8-Bit-Computer optimiert und im Vergleich zu anderen Hash-Funktionen relativ einfach. Es hat sich jedoch gezeigt, dass MD2 anfällig für Kollisionsangriffe ist und für kryptografische Zwecke nicht mehr als sicher gilt. MD2 wird immer noch in einigen Anwendungen verwendet, wird jedoch zugunsten sichererer Hash-Funktionen wie SHA-256 und SHA-3 auslaufen.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) ist eine kryptografische Hash-Funktion, die eine Eingabe entgegennimmt und einen 128-Bit-Hash-Wert (16 Byte) erzeugt. Es wurde 1990 von Ronald Rivest als Nachfolger von MD2 und MD3 entwickelt. Allerdings hat sich MD4 als anfällig für Kollisionsangriffe erwiesen und gilt für kryptografische Zwecke nicht mehr als sicher. MD4 wird in einigen Anwendungen immer noch verwendet, wird jedoch zugunsten sichererer Hash-Funktionen wie SHA-256 und SHA-3 auslaufen.",
    "AWqXD": "MD5",
    "E88Ej": "Klicken Sie hier, um Ihren Eingabetext zu verschlüsseln",
    "ECm8j": "Klicken Sie hier, um Ihren Eingabetext zu verschlüsseln",
    "IP8-V": "MD2 aus Text",
    "IPtV": "MD4 von Text",
    "P56UK": "Klicken Sie hier, um Ihren Eingabetext zu verschlüsseln",
    "PJNze": "Klicken Sie hier, um Ihren Eingabetext zu verschlüsseln",
    "REFy8": "Klicken Sie hier, um Ihren Eingabetext zu verschlüsseln",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Alle Werkzeuge",
    "eNNrM": "MD2 aus Datei",
    "g0QB9": "Der MD5-Message-Digest-Algorithmus ist eine weit verbreitete Hash-Funktion, die einen 128-Bit-Hash-Wert erzeugt. MD5 wurde 1991 von Ronald Rivest entwickelt, um eine frühere Hash-Funktion MD4 zu ersetzen,[3] und wurde 1992 als RFC 1321 spezifiziert. MD5 kann als Prüfsumme verwendet werden, um die Datenintegrität gegen unbeabsichtigte Beschädigung zu überprüfen. Historisch gesehen wurde es häufig als kryptografische Hash-Funktion verwendet. Es wurde jedoch festgestellt, dass es erhebliche Schwachstellen aufweist. Es eignet sich weiterhin für andere nichtkryptografische Zwecke, beispielsweise zur Bestimmung der Partition für einen bestimmten Schlüssel in einer partitionierten Datenbank, und kann aufgrund geringerer Rechenanforderungen als neuere sichere Hash-Algorithmen bevorzugt werden.[4]",
    "gh9zA": "SHA-1 oder Secure Hash Algorithm 1 ist ein kryptografischer Algorithmus, der eine Eingabe entgegennimmt und einen 160-Bit-Hash-Wert (20 Byte) erzeugt.",
    "gh9zA.sha224": "SHA-224 ist eine kryptografische Hash-Funktion, die eine Eingabe entgegennimmt und einen 224-Bit-Hash-Wert (28 Byte) erzeugt. Es ist Teil der SHA-2-Hash-Funktionsfamilie, zu der auch SHA-256, SHA-384 und SHA-512 gehören. SHA-224 ist sicherer als sein Vorgänger SHA-1, der nachweislich anfällig für Kollisionsangriffe ist. SHA-224 wird häufig in digitalen Signaturen, Nachrichtenauthentifizierungscodes und anderen Anwendungen verwendet, bei denen die Datenintegrität von entscheidender Bedeutung ist.",
    "gh9zA.sha256": "SHA-256 ist eine kryptografische Hash-Funktion, die eine Eingabe entgegennimmt und einen 256-Bit-Hash-Wert (32 Byte) erzeugt. Es ist Teil der SHA-2-Hash-Funktionsfamilie, zu der auch SHA-224, SHA-384 und SHA-512 gehören. SHA-256 ist sicherer als sein Vorgänger SHA-1, der nachweislich anfällig für Kollisionsangriffe ist. SHA-256 wird häufig in digitalen Signaturen, Nachrichtenauthentifizierungscodes und anderen Anwendungen verwendet, bei denen die Datenintegrität von entscheidender Bedeutung ist.",
    "gh9zA.sha384": "SHA-384 ist eine kryptografische Hash-Funktion, die eine Eingabe entgegennimmt und einen 384-Bit-Hash-Wert (48 Byte) erzeugt. Es ist Teil der SHA-2-Familie von Hash-Funktionen, zu der auch SHA-224, SHA-256, SHA-512, SHA-512/224 und SHA-512/256 gehören. SHA-384 ist sicherer als sein Vorgänger SHA-1, der nachweislich anfällig für Kollisionsangriffe ist. SHA-384 wird häufig in digitalen Signaturen, Nachrichtenauthentifizierungscodes und anderen Anwendungen verwendet, bei denen die Datenintegrität von entscheidender Bedeutung ist.",
    "gh9zA.sha512": "SHA-512 ist eine kryptografische Hash-Funktion, die eine Eingabe entgegennimmt und einen 512-Bit-Hash-Wert (64 Byte) erzeugt. Es ist Teil der SHA-2-Familie von Hash-Funktionen, zu der auch SHA-224, SHA-256, SHA-384, SHA-512/224 und SHA-512/256 gehören. SHA-512 ist sicherer als sein Vorgänger SHA-1, der nachweislich anfällig für Kollisionsangriffe ist. SHA-512 wird häufig in digitalen Signaturen, Nachrichtenauthentifizierungscodes und anderen Anwendungen verwendet, bei denen die Datenintegrität von entscheidender Bedeutung ist.",
    "gwo79": "SHA1 aus Datei",
    "gwo79.sha224": "SHA224 aus Datei",
    "gwo79.sha256": "SHA256 aus Datei",
    "gwo79.sha384": "SHA384 aus Datei",
    "gwo79.sha512": "SHA512 aus Datei",
    "jjhid": "Das ist hallo, Welt",
    "m0105": "Codec",
    "m0106": "Konverter",
    "m0107": "Generator",
    "m0108": "Formatierer",
    "m0109": "Docs Center",
    "o3poi": "SHA1 aus Text",
    "o3poi.sha224": "SHA224 aus Text",
    "o3poi.sha256": "SHA256 aus Text",
    "o3poi.sha384": "SHA384 aus Text",
    "o3poi.sha512": "SHA512 aus Text",
    "pl8S6": "Klicken Sie hier, um Ihren Eingabetext zu verschlüsseln",
    "qjQvD": "Klicken Sie hier, um Ihren Eingabetext zu verschlüsseln",
    "vQq9v": "MD5 von Text",
    "vhgr3": "Klicken Sie hier, um eine Datei auszuwählen und diese direkt zu verschlüsseln.",
    "vu10K": "MD5 aus Datei",
    "wqp_4": "Klicken Sie hier, um eine Datei auszuwählen und diese direkt zu verschlüsseln.",
    "y_2Q1": "Kodieren und dekodieren",
    "y_2Q2": "Symmetrische Krypto",
    "y_2Q3": "Asymmetrische Krypto",
    "y_2Q4": "Nationale Algorithmen Chinas",
    "y_2Q5": "Web-Auth",
    "y_BN6": "Digest-Algorithmus"
}