{
    "41ev7": "MD2",
    "5-S-B": "MD4 à partir d'un fichier",
    "6wtIW": "MD2 (Message-Digest Algorithm 2) est une fonction de hachage cryptographique qui prend une entrée et produit une valeur de hachage de 128 bits (16 octets). Il a été développé par Ronald Rivest en 1989 pour succéder au MD1. MD2 est optimisé pour les ordinateurs 8 bits et est relativement simple par rapport aux autres fonctions de hachage. Cependant, MD2 s'est révélé vulnérable aux attaques par collision et n'est plus considéré comme sécurisé à des fins cryptographiques. MD2 est toujours utilisé dans certaines applications, mais est progressivement abandonné au profit de fonctions de hachage plus sécurisées telles que SHA-256 et SHA-3.",
    "70PnM": "MD4",
    "7gKzt": "MD4 (Message-Digest Algorithm 4) est une fonction de hachage cryptographique qui prend une entrée et produit une valeur de hachage de 128 bits (16 octets). Il a été développé par Ronald Rivest en 1990 pour succéder au MD2 et au MD3. Cependant, MD4 s'est révélé vulnérable aux attaques par collision et n'est plus considéré comme sécurisé à des fins cryptographiques. MD4 est toujours utilisé dans certaines applications, mais est progressivement abandonné au profit de fonctions de hachage plus sécurisées telles que SHA-256 et SHA-3.",
    "AWqXD": "MD5",
    "E88Ej": "Cliquez ici pour crypter votre texte saisi",
    "ECm8j": "Cliquez ici pour crypter votre texte saisi",
    "IP8-V": "MD2 à partir du texte",
    "IPtV": "MD4 à partir du texte",
    "P56UK": "Cliquez ici pour crypter votre texte saisi",
    "PJNze": "Cliquez ici pour crypter votre texte saisi",
    "REFy8": "Cliquez ici pour crypter votre texte saisi",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Tous les outils",
    "eNNrM": "MD2 à partir d'un fichier",
    "g0QB9": "L'algorithme de résumé de message MD5 est une fonction de hachage largement utilisée produisant une valeur de hachage de 128 bits. MD5 a été conçu par Ronald Rivest en 1991 pour remplacer une fonction de hachage antérieure MD4,[3] et a été spécifié en 1992 sous le nom de RFC 1321. MD5 peut être utilisé comme somme de contrôle pour vérifier l'intégrité des données contre une corruption involontaire. Historiquement, il était largement utilisé comme fonction de hachage cryptographique ; cependant, il s'est avéré qu'il souffre d'importantes vulnérabilités. Il reste adapté à d'autres fins non cryptographiques, par exemple pour déterminer la partition d'une clé particulière dans une base de données partitionnée, et peut être préféré en raison de exigences de calcul inférieures à celles des algorithmes de hachage sécurisé plus récents.[4]",
    "gh9zA": "SHA-1 ou Secure Hash Algorithm 1 est un algorithme cryptographique qui prend une entrée et produit une valeur de hachage de 160 bits (20 octets).",
    "gh9zA.sha224": "SHA-224 est une fonction de hachage cryptographique qui prend une entrée et produit une valeur de hachage de 224 bits (28 octets). Il fait partie de la famille de fonctions de hachage SHA-2, qui comprend également SHA-256, SHA-384 et SHA-512. SHA-224 est conçu pour être plus sécurisé que son prédécesseur, SHA-1, qui s'est révélé vulnérable aux attaques par collision. SHA-224 est largement utilisé dans les signatures numériques, les codes d'authentification de messages et d'autres applications où l'intégrité des données est essentielle.",
    "gh9zA.sha256": "SHA-256 est une fonction de hachage cryptographique qui prend une entrée et produit une valeur de hachage de 256 bits (32 octets). Il fait partie de la famille de fonctions de hachage SHA-2, qui comprend également SHA-224, SHA-384 et SHA-512. SHA-256 est conçu pour être plus sécurisé que son prédécesseur, SHA-1, qui s'est révélé vulnérable aux attaques par collision. SHA-256 est largement utilisé dans les signatures numériques, les codes d'authentification de messages et d'autres applications où l'intégrité des données est essentielle.",
    "gh9zA.sha384": "SHA-384 est une fonction de hachage cryptographique qui prend une entrée et produit une valeur de hachage de 384 bits (48 octets). Il fait partie de la famille de fonctions de hachage SHA-2, qui comprend également SHA-224, SHA-256, SHA-512, SHA-512/224 et SHA-512/256. SHA-384 est conçu pour être plus sécurisé que son prédécesseur, SHA-1, qui s'est révélé vulnérable aux attaques par collision. SHA-384 est largement utilisé dans les signatures numériques, les codes d'authentification de messages et d'autres applications où l'intégrité des données est essentielle.",
    "gh9zA.sha512": "SHA-512 est une fonction de hachage cryptographique qui prend une entrée et produit une valeur de hachage de 512 bits (64 octets). Il fait partie de la famille de fonctions de hachage SHA-2, qui comprend également SHA-224, SHA-256, SHA-384, SHA-512/224 et SHA-512/256. SHA-512 est conçu pour être plus sécurisé que son prédécesseur, SHA-1, qui s'est révélé vulnérable aux attaques par collision. SHA-512 est largement utilisé dans les signatures numériques, les codes d'authentification de messages et d'autres applications où l'intégrité des données est essentielle.",
    "gwo79": "SHA1 à partir du fichier",
    "gwo79.sha224": "SHA224 à partir du fichier",
    "gwo79.sha256": "SHA256 à partir du fichier",
    "gwo79.sha384": "SHA384 à partir du fichier",
    "gwo79.sha512": "SHA512 à partir du fichier",
    "jjhid": "c'est bonjour le monde",
    "m0105": "Codec",
    "m0106": "Convertisseur",
    "m0107": "Générateur",
    "m0108": "Formateur",
    "m0109": "Centre de documentation",
    "o3poi": "SHA1 à partir du texte",
    "o3poi.sha224": "SHA224 à partir du texte",
    "o3poi.sha256": "SHA256 à partir du texte",
    "o3poi.sha384": "SHA384 à partir du texte",
    "o3poi.sha512": "SHA512 à partir du texte",
    "pl8S6": "Cliquez ici pour crypter votre texte saisi",
    "qjQvD": "Cliquez ici pour crypter votre texte saisi",
    "vQq9v": "MD5 à partir du texte",
    "vhgr3": "Cliquez ici pour sélectionner un fichier et le chiffrer directement.",
    "vu10K": "MD5 à partir d'un fichier",
    "wqp_4": "Cliquez ici pour sélectionner un fichier et le chiffrer directement.",
    "y_2Q1": "Encoder et décoder",
    "y_2Q2": "Crypto symétrique",
    "y_2Q3": "Crypto asymétrique",
    "y_2Q4": "Algorithmes nationaux chinois",
    "y_2Q5": "Authentification Web",
    "y_BN6": "Algorithme de résumé"
}