{
    "41ev7": "MD2",
    "5-S-B": "MD4 a fájlból",
    "6wtIW": "Az MD2 (Message-Digest Algorithm 2) egy kriptográfiai hash függvény, amely bemenetet vesz, és 128 bites (16 bájtos) hash értéket állít elő. Ronald Rivest fejlesztette ki 1989-ben az MD1 utódjaként. Az MD2 8 bites számítógépekre van optimalizálva, és viszonylag egyszerű a többi hash függvényhez képest. Az MD2 azonban sebezhetőnek bizonyult az ütközési támadásokkal szemben, és kriptográfiai szempontból már nem tekinthető biztonságosnak. Az MD2-t még mindig használják bizonyos alkalmazásokban, de fokozatosan megszüntetik a biztonságosabb hash-funkciók, például az SHA-256 és az SHA-3 javára.",
    "70PnM": "MD4",
    "7gKzt": "Az MD4 (Message-Digest Algorithm 4) egy kriptográfiai hash függvény, amely bemenetet vesz, és 128 bites (16 bájtos) hash értéket állít elő. Ronald Rivest fejlesztette ki 1990-ben az MD2 és MD3 utódjaként. Az MD4 azonban sebezhetőnek bizonyult az ütközési támadásokkal szemben, és kriptográfiai szempontból már nem tekinthető biztonságosnak. Az MD4-et még mindig használják egyes alkalmazásokban, de fokozatosan megszüntetik a biztonságosabb hash-funkciók, például az SHA-256 és az SHA-3 javára.",
    "AWqXD": "MD5",
    "E88Ej": "Kattintson ide a bevitt szöveg titkosításához",
    "ECm8j": "Kattintson ide a bevitt szöveg titkosításához",
    "IP8-V": "MD2 szövegből",
    "IPtV": "MD4 szövegből",
    "P56UK": "Kattintson ide a bevitt szöveg titkosításához",
    "PJNze": "Kattintson ide a bevitt szöveg titkosításához",
    "REFy8": "Kattintson ide a bevitt szöveg titkosításához",
    "TtyeA": "SHA1",
    "TtyeA.sha224": "SHA224",
    "TtyeA.sha256": "SHA256",
    "TtyeA.sha384": "SHA384",
    "TtyeA.sha512": "SHA512",
    "cPS6q": "Minden eszköz",
    "eNNrM": "MD2 a fájlból",
    "g0QB9": "Az MD5 üzenet-kivonatoló algoritmus egy széles körben használt hash függvény, amely 128 bites hash értéket állít elő. Az MD5-öt Ronald Rivest 1991-ben tervezte egy korábbi MD4 hash-függvény [3] helyére, és 1992-ben RFC 1321-ként határozták meg. Az MD5 ellenőrző összegként használható az adatok integritásának ellenőrzésére a nem szándékos sérülés ellen. Történelmileg széles körben használták kriptográfiai hash függvényként; azonban kiderült, hogy kiterjedt sebezhetőségekkel rendelkezik. Alkalmas marad más nem kriptográfiai célokra is, például particionált adatbázisban egy adott kulcs partíciójának meghatározására, és előnyben részesíthető az újabb Secure Hash Algorithmusoknál alacsonyabb számítási követelmények miatt.[4]",
    "gh9zA": "Az SHA-1 vagy a Secure Hash Algorithm 1 egy kriptográfiai algoritmus, amely bemenetet vesz, és 160 bites (20 bájtos) hash értéket állít elő.",
    "gh9zA.sha224": "Az SHA-224 egy kriptográfiai hash függvény, amely bemenetet vesz, és 224 bites (28 bájtos) hash értéket állít elő. Az SHA-2 hash-függvénycsalád része, amely magában foglalja az SHA-256-ot, az SHA-384-et és az SHA-512-t is. Az SHA-224 biztonságosabb, mint elődje, az SHA-1, amelyről kimutatták, hogy sebezhető az ütközési támadásokkal szemben. Az SHA-224 széles körben használatos digitális aláírásokban, üzenet-hitelesítési kódokban és más olyan alkalmazásokban, ahol az adatok integritása kritikus.",
    "gh9zA.sha256": "Az SHA-256 egy kriptográfiai hash-függvény, amely bemenetet vesz, és 256 bites (32 bájtos) hash-értéket állít elő. Az SHA-2 hash-függvénycsalád része, amely magában foglalja az SHA-224-et, az SHA-384-et és az SHA-512-t is. Az SHA-256 biztonságosabb, mint elődje, az SHA-1, amelyről bebizonyosodott, hogy sebezhető az ütközési támadásokkal szemben. Az SHA-256 széles körben használatos digitális aláírásokban, üzenet-hitelesítési kódokban és más alkalmazásokban, ahol az adatok integritása kritikus.",
    "gh9zA.sha384": "Az SHA-384 egy kriptográfiai hash függvény, amely egy bemenetet vesz fel, és 384 bites (48 bájtos) hash értéket állít elő. Az SHA-2 hash-függvénycsalád része, amely magában foglalja az SHA-224-et, az SHA-256-ot, az SHA-512-t, az SHA-512/224-et és az SHA-512/256-ot is. Az SHA-384 biztonságosabb, mint elődje, az SHA-1, amelyről bebizonyosodott, hogy sebezhető az ütközési támadásokkal szemben. Az SHA-384 széles körben használatos digitális aláírásokban, üzenet-hitelesítési kódokban és más olyan alkalmazásokban, ahol az adatok integritása kritikus.",
    "gh9zA.sha512": "Az SHA-512 egy kriptográfiai hash-függvény, amely bemenetet vesz, és 512 bites (64 bájtos) hash-értéket állít elő. Az SHA-2 hash-függvénycsalád része, amely magában foglalja az SHA-224-et, az SHA-256-ot, az SHA-384-et, az SHA-512/224-et és az SHA-512/256-ot is. Az SHA-512 biztonságosabb, mint elődje, az SHA-1, amelyről bebizonyosodott, hogy sebezhető az ütközési támadásokkal szemben. Az SHA-512-t széles körben használják digitális aláírásokban, üzenet-hitelesítési kódokban és más alkalmazásokban, ahol az adatok integritása kritikus.",
    "gwo79": "SHA1 a fájlból",
    "gwo79.sha224": "SHA224 fájlból",
    "gwo79.sha256": "SHA256 a fájlból",
    "gwo79.sha384": "SHA384 fájlból",
    "gwo79.sha512": "SHA512 fájlból",
    "jjhid": "ez helló, világ",
    "m0105": "Codec",
    "m0106": "Átalakító",
    "m0107": "Generátor",
    "m0108": "Formázó",
    "m0109": "Dokumentumközpont",
    "o3poi": "SHA1 szövegből",
    "o3poi.sha224": "SHA224 szövegből",
    "o3poi.sha256": "SHA256 szövegből",
    "o3poi.sha384": "SHA384 szövegből",
    "o3poi.sha512": "SHA512 szövegből",
    "pl8S6": "Kattintson ide a bevitt szöveg titkosításához",
    "qjQvD": "Kattintson ide a bevitt szöveg titkosításához",
    "vQq9v": "MD5 szövegből",
    "vhgr3": "Kattintson ide egy fájl kiválasztásához és közvetlen titkosításához.",
    "vu10K": "MD5 a fájlból",
    "wqp_4": "Kattintson ide egy fájl kiválasztásához és közvetlen titkosításához.",
    "y_2Q1": "Kódolás és dekódolás",
    "y_2Q2": "Szimmetrikus kriptográfia",
    "y_2Q3": "Aszimmetrikus kriptográfia",
    "y_2Q4": "Kínai nemzeti algoritmusok",
    "y_2Q5": "Web Auth",
    "y_BN6": "Digest Algorithm"
}