{
    "MySQL-Performance-Tuning": "Petua Penalaan Prestasi MySQL",
    "OWASP-SQL-Injection": "Panduan Suntikan SQL OWASP",
    "SQL-Basics-001": "Apakah SQL?",
    "SQL-Beautifier-Example": "Pemformat SQL Dalam Talian",
    "SQL-Beautify-006": "Apakah itu SQL Beautification?",
    "SQL-Beautify-Def-007": "Pengindahan SQL ialah proses pemformatan kod SQL untuk meningkatkan kebolehbacaan dengan menggunakan lekukan, jarak dan konvensyen kes yang konsisten.",
    "SQL-Beautify-Purpose-008": "Sama seperti mencantikkan kod generik, ia membantu pembangun memahami pertanyaan kompleks dengan lebih mudah dan mengekalkan konsistensi merentas skrip atau projek SQL mereka.",
    "SQL-Commands-005": "SQL merangkumi beberapa jenis arahan: DDL (Bahasa Definisi Data - CREATE, ALTER, DROP), DML (Bahasa Manipulasi Data - SELECT, INSERT, UPDATE, DELETE) dan DCL (Bahasa Kawalan Data - GRANT, REVOKE).",
    "SQL-Components-004": "Apakah komponen utama SQL?",
    "SQL-Components-Wikipedia": "Komponen SQL di Wikipedia",
    "SQL-Def-002": "SQL (Bahasa Pertanyaan Berstruktur) ialah bahasa pengaturcaraan standard untuk mengurus dan menanya pangkalan data hubungan.",
    "SQL-Indexing-016": "Apakah indeks dalam SQL dan mengapa ia penting?",
    "SQL-Indexing-Benefit-018": "Mencipta indeks pada lajur yang kerap digunakan untuk keadaan klausa WHERE dengan ketara mempercepatkan pertanyaan SELECT tetapi boleh melambatkan operasi INSERT, UPDATE dan DELETE kerana keperluan untuk mengekalkan struktur indeks.",
    "SQL-Indexing-Explanation-017": "Indeks ialah struktur data (cth., B-tree) yang meningkatkan kelajuan operasi pengambilan data dalam jadual dengan membenarkan enjin pangkalan data mencari baris dengan cepat berdasarkan nilai lajur tertentu.",
    "SQL-Indexing-MDN": "MDN Web Docs on Indexes",
    "SQL-Injection-019": "Apakah SQL Injection dan bagaimana ia boleh dicegah?",
    "SQL-Injection-Def-020": "SQL Injection ialah kelemahan keselamatan di mana penyerang boleh memasukkan kod SQL berniat jahat ke dalam medan input untuk memanipulasi atau mengekstrak data daripada pangkalan data.",
    "SQL-Injection-Prevention-021": "Kaedah pencegahan termasuk menggunakan pertanyaan berparameter, pernyataan yang disediakan atau pustaka ORM yang secara automatik melarikan diri daripada input pengguna, serta mengehadkan kebenaran pangkalan data dan menggunakan prinsip keistimewaan yang paling sedikit.",
    "SQL-Joins-011": "Apakah JOIN dalam SQL?",
    "SQL-Joins-Explanation-012": "JOIN digunakan untuk menggabungkan baris daripada dua atau lebih jadual berdasarkan lajur yang berkaitan di antara mereka. Cth., SERTAI DALAM, SERTAI KIRI, SERTAI KANAN dan SERTAI PENUH.",
    "SQL-Joins-Tutorial": "Tutorial Menyertai SQL",
    "SQL-Perf-Tuning-Methods-024": "Teknik lain termasuk membahagikan jadual besar, menggunakan jenis data yang sesuai dan keputusan caching apabila boleh.",
    "SQL-Perf-Tuning-Overview-023": "Mengoptimumkan prestasi pertanyaan SQL melibatkan menganalisis rancangan pelaksanaan, mengindeks dengan sewajarnya, meminimumkan gabungan dan subkueri yang tidak perlu, dan menulis klausa WHERE yang cekap.",
    "SQL-Performance-Tuning-022": "Bagaimanakah cara saya mengoptimumkan prestasi pertanyaan SQL?",
    "SQL-Purpose-003": "Ia digunakan untuk membuat, membaca, mengemas kini, memadam dan menanyakan data dalam jadual serta mengurus struktur pangkalan data dan kebenaran.",
    "SQL-Select-009": "Bagaimanakah saya menulis pernyataan SELECT asas?",
    "SQL-Select-Example-0210": "Pernyataan SELECT mudah mendapatkan semula data daripada jadual. Contohnya: {0}', 'PILIH lajur1, lajur2 DARI my_table;",
    "SQL-Transactions-013": "Apakah transaksi dalam SQL?",
    "SQL-Transactions-Def-014": "Transaksi ialah unit kerja logik yang mengandungi satu atau lebih pernyataan SQL. Ia memastikan bahawa semua operasi di dalamnya berjaya diselesaikan (atomicity), diasingkan daripada transaksi lain, dan tahan lama walaupun dalam kes kegagalan sistem.",
    "SQL-Transactions-Example-015": "Untuk memulakan transaksi, gunakan perintah START TRANSACTION; lakukan perubahan dengan COMMIT atau rollback ke keadaan sebelumnya dengan ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transaksi SQL di W3Schools"
}