{
    "MySQL-Performance-Tuning": "Dicas de ajuste de desempenho do MySQL",
    "OWASP-SQL-Injection": "Guia de injeção SQL OWASP",
    "SQL-Basics-001": "O que é SQL?",
    "SQL-Beautifier-Example": "Formatador SQL on-line",
    "SQL-Beautify-006": "O que é embelezamento SQL?",
    "SQL-Beautify-Def-007": "O embelezamento SQL é o processo de formatação do código SQL para melhorar a legibilidade, aplicando recuo, espaçamento e convenções de maiúsculas e minúsculas consistentes.",
    "SQL-Beautify-Purpose-008": "Assim como os embelezadores de código genéricos, ele ajuda os desenvolvedores a entender consultas complexas com mais facilidade e a manter a consistência em seus scripts ou projetos SQL.",
    "SQL-Commands-005": "SQL inclui vários tipos de comandos: DDL (Linguagem de Definição de Dados - CREATE, ALTER, DROP), DML (Linguagem de Manipulação de Dados - SELECT, INSERT, UPDATE, DELETE) e DCL (Linguagem de Controle de Dados - GRANT, REVOKE).",
    "SQL-Components-004": "Quais são os principais componentes do SQL?",
    "SQL-Components-Wikipedia": "Componentes SQL na Wikipedia",
    "SQL-Def-002": "SQL (Structured Query Language) é uma linguagem de programação padrão para gerenciar e consultar bancos de dados relacionais.",
    "SQL-Indexing-016": "O que são índices em SQL e por que são importantes?",
    "SQL-Indexing-Benefit-018": "A criação de um índice em colunas usadas com frequência para condições da cláusula WHERE acelera significativamente as consultas SELECT, mas pode retardar as operações INSERT, UPDATE e DELETE devido à necessidade de manter a estrutura do índice.",
    "SQL-Indexing-Explanation-017": "Índices são estruturas de dados (por exemplo, árvores B) que melhoram a velocidade das operações de recuperação de dados em uma tabela, permitindo que o mecanismo de banco de dados localize rapidamente linhas com base em valores de colunas específicos.",
    "SQL-Indexing-MDN": "Documentos da Web MDN sobre índices",
    "SQL-Injection-019": "O que é SQL Injection e como pode ser evitado?",
    "SQL-Injection-Def-020": "SQL Injection é uma vulnerabilidade de segurança onde um invasor pode inserir código SQL malicioso em campos de entrada para manipular ou extrair dados de um banco de dados.",
    "SQL-Injection-Prevention-021": "Os métodos de prevenção incluem o uso de consultas parametrizadas, instruções preparadas ou bibliotecas ORM que escapam automaticamente da entrada do usuário, bem como limitar as permissões do banco de dados e aplicar princípios de privilégio mínimo.",
    "SQL-Joins-011": "O que são JOINs em SQL?",
    "SQL-Joins-Explanation-012": "JOINs são usados ​​para combinar linhas de duas ou mais tabelas com base em uma coluna relacionada entre elas. Por exemplo, INNER JOIN, LEFT JOIN, RIGHT JOIN e FULL JOIN.",
    "SQL-Joins-Tutorial": "Tutorial de junções SQL",
    "SQL-Perf-Tuning-Methods-024": "Outras técnicas incluem particionar tabelas grandes, usar tipos de dados apropriados e armazenar resultados em cache quando possível.",
    "SQL-Perf-Tuning-Overview-023": "Otimizar o desempenho da consulta SQL envolve analisar planos de execução, indexar adequadamente, minimizar junções e subconsultas desnecessárias e escrever cláusulas WHERE eficientes.",
    "SQL-Performance-Tuning-022": "Como posso otimizar o desempenho da consulta SQL?",
    "SQL-Purpose-003": "É usado para criar, ler, atualizar, excluir e consultar dados em tabelas, bem como gerenciar a estrutura e as permissões do banco de dados.",
    "SQL-Select-009": "Como escrevo uma instrução SELECT básica?",
    "SQL-Select-Example-0210": "Uma instrução SELECT simples recupera dados de uma tabela. Por exemplo: {0}', 'SELECT coluna1, coluna2 FROM minha_tabela;",
    "SQL-Transactions-013": "O que são transações em SQL?",
    "SQL-Transactions-Def-014": "Uma transação é uma unidade lógica de trabalho que contém uma ou mais instruções SQL. Ele garante que todas as operações dentro dele sejam concluídas com sucesso (atomicidade), isoladas de outras transações e duráveis ​​mesmo em caso de falha do sistema.",
    "SQL-Transactions-Example-015": "Para iniciar uma transação, utilize o comando START TRANSACTION; confirme as alterações com COMMIT ou reverta para o estado anterior com ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transações SQL em W3Schools"
}