{
    "MySQL-Performance-Tuning": "MySQL Performans Ayarlama İpuçları",
    "OWASP-SQL-Injection": "OWASP SQL Enjeksiyon Kılavuzu",
    "SQL-Basics-001": "SQL nedir?",
    "SQL-Beautifier-Example": "Çevrimiçi SQL Formatlayıcı",
    "SQL-Beautify-006": "SQL Güzelleştirme nedir?",
    "SQL-Beautify-Def-007": "SQL güzelleştirme, tutarlı girinti, aralık ve büyük/küçük harf kuralları uygulayarak okunabilirliği artırmak için SQL kodunu biçimlendirme işlemidir.",
    "SQL-Beautify-Purpose-008": "Tıpkı genel kod güzelleştiriciler gibi, geliştiricilerin karmaşık sorguları daha kolay anlamalarına ve SQL komut dosyaları veya projelerinde tutarlılığı korumalarına yardımcı olur.",
    "SQL-Commands-005": "SQL çeşitli komut türlerini içerir: DDL (Veri Tanımlama Dili - CREATE, ALTER, DROP), DML (Veri İşleme Dili - SELECT, INSERT, UPDATE, DELETE) ve DCL (Veri Kontrol Dili - GRANT, REVOKE).",
    "SQL-Components-004": "SQL'in ana bileşenleri nelerdir?",
    "SQL-Components-Wikipedia": "Wikipedia'da SQL Bileşenleri",
    "SQL-Def-002": "SQL (Yapısal Sorgulama Dili), ilişkisel veritabanlarını yönetmek ve sorgulamak için kullanılan standart bir programlama dilidir.",
    "SQL-Indexing-016": "SQL'deki indeksler nelerdir ve neden önemlidir?",
    "SQL-Indexing-Benefit-018": "WHERE yan tümcesi koşulları için sık kullanılan sütunlarda dizin oluşturmak, SELECT sorgularını önemli ölçüde hızlandırır ancak dizin yapısını koruma ihtiyacı nedeniyle INSERT, UPDATE ve DELETE işlemlerini yavaşlatabilir.",
    "SQL-Indexing-Explanation-017": "Dizinler, veritabanı motorunun belirli sütun değerlerine göre satırları hızlı bir şekilde bulmasına olanak tanıyarak bir tablodaki veri alma işlemlerinin hızını artıran veri yapılarıdır (örneğin B ağaçları).",
    "SQL-Indexing-MDN": "Dizinlerdeki MDN Web Belgeleri",
    "SQL-Injection-019": "SQL Enjeksiyon nedir ve nasıl önlenebilir?",
    "SQL-Injection-Def-020": "SQL Enjeksiyonu, bir saldırganın veritabanındaki verileri değiştirmek veya çıkarmak için giriş alanlarına kötü amaçlı SQL kodu yerleştirebildiği bir güvenlik açığıdır.",
    "SQL-Injection-Prevention-021": "Önleme yöntemleri arasında parametreleştirilmiş sorguların, hazırlanmış ifadelerin veya kullanıcı girişinden otomatik olarak kaçan ORM kitaplıklarının kullanılmasının yanı sıra veritabanı izinlerinin sınırlandırılması ve en az ayrıcalık ilkelerinin uygulanması yer alır.",
    "SQL-Joins-011": "SQL'de JOIN'ler nedir?",
    "SQL-Joins-Explanation-012": "JOIN'ler, iki veya daha fazla tablodaki satırları, aralarındaki ilgili sütuna göre birleştirmek için kullanılır. Örneğin, INNER JOIN, LEFT JOIN, RIGHT JOIN ve FULL JOIN.",
    "SQL-Joins-Tutorial": "SQL Eğitime Katılıyor",
    "SQL-Perf-Tuning-Methods-024": "Diğer teknikler arasında büyük tabloların bölümlenmesi, uygun veri türlerinin kullanılması ve mümkün olduğunda sonuçların önbelleğe alınması yer alır.",
    "SQL-Perf-Tuning-Overview-023": "SQL sorgu performansını optimize etmek, yürütme planlarını analiz etmeyi, uygun şekilde indekslemeyi, gereksiz birleştirmeleri ve alt sorguları en aza indirmeyi ve etkili WHERE cümlecikleri yazmayı içerir.",
    "SQL-Performance-Tuning-022": "SQL sorgu performansını nasıl optimize edebilirim?",
    "SQL-Purpose-003": "Tablolardaki verileri oluşturmak, okumak, güncellemek, silmek ve sorgulamanın yanı sıra veritabanı yapısını ve izinlerini yönetmek için kullanılır.",
    "SQL-Select-009": "Temel bir SELECT ifadesini nasıl yazarım?",
    "SQL-Select-Example-0210": "Basit bir SELECT ifadesi bir tablodan veri alır. Örneğin: {0}', 'Tablomdan sütun1, sütun2'yi SEÇİN;",
    "SQL-Transactions-013": "SQL'de işlemler nelerdir?",
    "SQL-Transactions-Def-014": "İşlem, bir veya daha fazla SQL ifadesi içeren mantıksal bir iş birimidir. Bünyesindeki tüm işlemlerin başarıyla tamamlanmasını (atomisite), diğer işlemlerden izole edilmesini ve sistem arızası durumunda bile dayanıklı olmasını sağlar.",
    "SQL-Transactions-Example-015": "Bir işlemi başlatmak için İŞLEMİ BAŞLAT komutunu kullanın; COMMIT ile değişiklikleri gerçekleştirin veya ROLLBACK ile önceki duruma geri dönün.",
    "SQL-Transactions-W3Schools": "W3Schools'ta SQL İşlemleri"
}