{
    "BLAKE2-021": "BLAKE2 je další moderní alternativou, která poskytuje vyšší rychlosti ve srovnání s SHA-2 při zachování vysoké úrovně zabezpečení. Nabízí několik variant včetně BLAKE2b a BLAKE2s.",
    "BLAKE2_Info-023": "Informace BLAKE2",
    "MD5-Advantages-012": "Jaké jsou výhody používání MD5?",
    "MD5-AlgorithmDetails-011": "Podrobnosti algoritmu MD5",
    "MD5-Alternatives-019": "Jaké jsou některé alternativy k MD5 pro bezpečné hashování?",
    "MD5-Applications-024": "Jaké další aplikace používají nebo používaly MD5?",
    "MD5-Breakdown-017": "V průběhu času bylo v MD5 objeveno několik kryptografických slabin a výzkumníci předvedli praktické příklady vytváření kolizí, které dále ohrožují jeho integritu a bezpečnost.",
    "MD5-Collision-016": "MD5 je zranitelný vůči kolizním útokům, což znamená, že dva různé vstupy mohou produkovat stejný hash výstup. Díky tomu není bezpečný pro aplikace, jako jsou digitální podpisy nebo ukládání hesel.",
    "MD5-CollisionExample-007": "Příklad kolize MD5",
    "MD5-DataIntegrity-026": "Běžně se také používal k ověření integrity dat během přenosu a ukládání, například při použití rsync pro synchronizaci souborů nebo kontrolní součty velkých datových sad.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) je široce používaná kryptografická hašovací funkce, která přijímá vstupní zprávu a vytváří 128bitovou hašovací hodnotu pevné velikosti.",
    "MD5-DigitalSignature-Risks-027": "Rizika používání MD5 pro digitální podpisy",
    "MD5-Disadvantages-015": "Jaké jsou nevýhody a bezpečnostní problémy s MD5?",
    "MD5-FAQ-001": "Co je MD5?",
    "MD5-FileChecksum-005": "MD5 se často používá k ověření integrity souborů při stahování softwaru nebo velkých souborů. Generuje kontrolní součet, který lze porovnat se součtem poskytnutým zdrojem, aby bylo zajištěno, že stažený soubor nebyl zmanipulován.",
    "MD5-Future-028": "Je MD5 stále aktuální i dnes?",
    "MD5-InsecurityExamples-018": "Příklady rozpadu zabezpečení MD5",
    "MD5-Operation-008": "Jak funguje provoz MD5?",
    "MD5-PKI-025": "MD5 se používá v infrastruktuře veřejného klíče (PKI) pro vytváření digitálních podpisů, i když jeho použití bylo do značné míry zastaralé kvůli obavám o bezpečnost. Certifikáty podepsané pomocí MD5 již většina moderních systémů nedůvěřuje.",
    "MD5-PasswordHashing-006": "Historicky se také používal při hašování hesel, ale nyní je považován za nezabezpečený kvůli své zranitelnosti vůči kolizím a snadnému prolomení. Moderní systémy přešly na silnější alternativy jako bcrypt nebo Argon2.",
    "MD5-Process-009": "MD5 funguje tak, že rozděluje vstupní zprávu na bloky a každý blok prochází několika cykly zpracování zahrnujícími logické funkce, modulární aritmetiku a bitové operace. Výsledek je zřetězen, aby se vytvořila konečná 128bitová hodnota hash.",
    "MD5-Purpose-003": "Jeho účelem je zajistit integritu dat generováním jedinečného digitálního otisku prstu pro jakákoli daná data. Pokud se změní byť jen jediný bit v původních datech, hash MD5 bude úplně jiný.",
    "MD5-Relevance-029": "MD5 již není považován za bezpečný pro kryptografické účely, zejména pro nové aplikace, které vyžadují odolnost proti kolizi nebo silnou integritu zpráv. Stále jej však lze nalézt ve starších systémech nebo nekryptografických aplikacích, kde je rychlost prioritou před zabezpečením.",
    "MD5-Rounds-010": "Algoritmus se skládá ze čtyř hlavních fází prováděných na 128bitovém vnitřním stavu, který se inicializuje pomocí konstant. Celkem je 64 procesních kol, kde každé kolo transformuje vnitřní stav na základě vstupních bloků zpráv.",
    "MD5-Speed-013": "MD5 je relativně rychlý, díky čemuž je oblíbený pro aplikace, kde bylo rychlé hašování zásadní.",
    "MD5-Standardization-014": "Byl široce standardizován a implementován v různých programovacích jazycích a platformách, což usnadňuje integraci do stávajících systémů a nástrojů.",
    "MD5-Summary-031": "Stručně řečeno, jaké klíčové body bych si měl pamatovat o MD5?",
    "MD5-Summary-Point1-032": "MD5 je rychlá, ale nezabezpečená kryptografická hašovací funkce náchylná ke kolizním útokům.",
    "MD5-Summary-Point2-033": "Jeho primární použití bylo zajistit integritu dat a pro některé kryptografické operace, ale bylo z velké části nahrazeno silnějšími alternativami, jako jsou SHA-256 a BLAKE2.",
    "MD5-Summary-Point3-034": "I když se můžete setkat s MD5 ve starších systémech nebo scénářích, které nejsou citlivé na zabezpečení, je důležité vyhnout se jeho použití pro jakékoli nové projekty vyžadující kryptografické zabezpečení.",
    "MD5-Transition-030": "S tím, jak se novější a bezpečnější algoritmy jako SHA-256 a BLAKE2 stávají široce dostupnými a lépe srozumitelnými, je doporučeno přejít od MD5 ve všech kontextech, kde jde o bezpečnost.",
    "MD5-Usage-004": "Jak se MD5 používá v praxi?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) je široce používaná alternativa nabízející silnější zabezpečení než MD5. Generuje větší 256bitovou hodnotu hash a je součástí rodiny SHA-2.",
    "SHA-2_Info-022": "Informace o SHA-2"
}