{
    "BLAKE2-021": "A BLAKE2 egy másik modern alternatíva, amely nagyobb sebességet biztosít az SHA-2-höz képest, miközben megőrzi a magas biztonsági szintet. Több változatot kínál, beleértve a BLAKE2b-t és a BLAKE2-t.",
    "BLAKE2_Info-023": "BLAKE2 Info",
    "MD5-Advantages-012": "Milyen előnyei vannak az MD5 használatának?",
    "MD5-AlgorithmDetails-011": "MD5 algoritmus részletei",
    "MD5-Alternatives-019": "Melyek az MD5 alternatívái a biztonságos kivonatoláshoz?",
    "MD5-Applications-024": "Milyen más alkalmazások használják vagy használták az MD5-öt?",
    "MD5-Breakdown-017": "Az idők során számos kriptográfiai gyengeséget fedeztek fel az MD5-ben, és a kutatók gyakorlati példákat mutattak be az ütközések létrehozására, amelyek tovább veszélyeztetik az MD5 integritását és biztonságát.",
    "MD5-Collision-016": "Az MD5 sebezhető az ütközési támadásokkal szemben, ami azt jelenti, hogy két különböző bemenet képes ugyanazt a hash kimenetet produkálni. Ez bizonytalanná teszi az olyan alkalmazások számára, mint a digitális aláírások vagy a jelszavak tárolása.",
    "MD5-CollisionExample-007": "MD5 ütközési példa",
    "MD5-DataIntegrity-026": "Gyakran használták az adatok integritásának ellenőrzésére is az átvitel és tárolás során, például amikor az rsync-et fájlszinkronizálásra vagy nagy adathalmazok ellenőrző összegzésére használták.",
    "MD5-Def-002": "Az MD5 (Message-Digest Algorithm 5) egy széles körben használt kriptográfiai hash függvény, amely bemeneti üzenetet vesz fel, és rögzített méretű, 128 bites hash értéket állít elő.",
    "MD5-DigitalSignature-Risks-027": "Az MD5 digitális aláírásra való használatának kockázatai",
    "MD5-Disadvantages-015": "Melyek az MD5 hátrányai és biztonsági aggályai?",
    "MD5-FAQ-001": "Mi az MD5?",
    "MD5-FileChecksum-005": "Az MD5-öt gyakran használják a fájlok integritásának ellenőrzésére szoftverek vagy nagy fájlok letöltésekor. Létrehoz egy ellenőrző összeget, amely összehasonlítható a forrás által megadottal, hogy megbizonyosodjon arról, hogy a letöltött fájlt nem módosították.",
    "MD5-Future-028": "Az MD5 még ma is aktuális?",
    "MD5-InsecurityExamples-018": "MD5 biztonsági bontási példák",
    "MD5-Operation-008": "Hogyan működik az MD5 működése?",
    "MD5-PKI-025": "Az MD5-öt a nyilvános kulcsú infrastruktúrában (PKI) használták digitális aláírások létrehozására, bár a használatát biztonsági megfontolások miatt nagyrészt elavulttá vált. A legtöbb modern rendszer már nem bízik az MD5-tel aláírt tanúsítványokban.",
    "MD5-PasswordHashing-006": "Történelmileg a jelszavak kivonatolásában is használták, de ma már nem biztonságosnak tartják az ütközésekkel szembeni sebezhetőség és a könnyű feltörhetőség miatt. A modern rendszerek olyan erősebb alternatívák felé mozdultak el, mint a bcrypt vagy az Argon2.",
    "MD5-Process-009": "Az MD5 úgy működik, hogy a bemeneti üzenetet darabokra bontja, és az egyes darabokat több feldolgozási körön halad át, amelyek logikai függvényeket, moduláris aritmetikát és bitenkénti műveleteket foglalnak magukban. Az eredményt összefűzzük a végső 128 bites hash érték létrehozásához.",
    "MD5-Purpose-003": "Célja az adatok integritásának biztosítása azáltal, hogy egyedi digitális ujjlenyomatot generál bármely adott adathoz. Ha az eredeti adatok egyetlen bitje is megváltozik, az MD5 hash teljesen más lesz.",
    "MD5-Relevance-029": "Az MD5 már nem tekinthető biztonságosnak kriptográfiai célokra, különösen az ütközésállóságot vagy erős üzenetintegritást igénylő új alkalmazások esetében. Azonban továbbra is megtalálható a régi rendszerekben vagy nem kriptográfiai alkalmazásokban, ahol a sebesség elsőbbséget élvez a biztonsággal szemben.",
    "MD5-Rounds-010": "Az algoritmus négy fő szakaszból áll, amelyeket egy 128 bites belső állapoton hajtanak végre, amelyet konstansokkal inicializálnak. Összesen 64 feldolgozási kör van, ahol minden kör átalakítja a belső állapotot a bemeneti üzenetblokkok alapján.",
    "MD5-Speed-013": "Az MD5 viszonylag gyors, ami népszerűvé tette azokban az alkalmazásokban, ahol elengedhetetlen volt a gyors hash.",
    "MD5-Standardization-014": "Széles körben szabványosították és különféle programozási nyelveken és platformokon implementálták, így könnyen integrálható a meglévő rendszerekbe és eszközökbe.",
    "MD5-Summary-031": "Összefoglalva, milyen kulcsfontosságú pontokat kell megjegyeznem az MD5-tel kapcsolatban?",
    "MD5-Summary-Point1-032": "Az MD5 egy gyors, de nem biztonságos kriptográfiai hash funkció, amely érzékeny az ütközési támadásokra.",
    "MD5-Summary-Point2-033": "Elsődleges felhasználása az adatok integritásának biztosítása és néhány kriptográfiai művelet volt, de nagyrészt erősebb alternatívák váltották fel, mint például az SHA-256 és a BLAKE2.",
    "MD5-Summary-Point3-034": "Noha előfordulhat, hogy az MD5-öt régebbi rendszerekben vagy nem biztonsági szempontból érzékeny forgatókönyvekben találja meg, kulcsfontosságú, hogy elkerülje a kriptográfiai biztonságot igénylő új projekteknél.",
    "MD5-Transition-030": "Ahogy az újabb, biztonságosabb algoritmusok, például az SHA-256 és a BLAKE2 egyre szélesebb körben elérhetővé és jobban megérthetővé válnak, javasolt az MD5-ről való átállás minden olyan környezetben, ahol a biztonság aggályos.",
    "MD5-Usage-004": "Hogyan használják az MD5-öt a gyakorlatban?",
    "SHA-256-020": "Az SHA-256 (Secure Hash Algorithm) egy széles körben használt alternatíva, amely erősebb biztonságot kínál, mint az MD5. Nagyobb, 256 bites hash értéket generál, és az SHA-2 család része.",
    "SHA-2_Info-022": "SHA-2 Info"
}