{
    "BLAKE2-021": "BLAKE2 adalah alternatif modern lainnya yang memberikan kecepatan lebih cepat dibandingkan SHA-2 dengan tetap menjaga tingkat keamanan yang tinggi. Ia menawarkan beberapa varian termasuk BLAKE2b dan BLAKE2s.",
    "BLAKE2_Info-023": "Informasi BLAKE2",
    "MD5-Advantages-012": "Apa keuntungan menggunakan MD5?",
    "MD5-AlgorithmDetails-011": "Detail Algoritma MD5",
    "MD5-Alternatives-019": "Apa sajakah alternatif selain MD5 untuk hashing yang aman?",
    "MD5-Applications-024": "Aplikasi lain apa yang menggunakan atau pernah menggunakan MD5?",
    "MD5-Breakdown-017": "Beberapa kelemahan kriptografi telah ditemukan di MD5 dari waktu ke waktu, dan para peneliti telah menunjukkan contoh praktis yang menciptakan tabrakan, yang selanjutnya membahayakan integritas dan keamanannya.",
    "MD5-Collision-016": "MD5 rentan terhadap serangan tabrakan, artinya dua masukan berbeda dapat menghasilkan keluaran hash yang sama. Hal ini membuatnya tidak aman untuk aplikasi seperti tanda tangan digital atau penyimpanan kata sandi.",
    "MD5-CollisionExample-007": "Contoh Tabrakan MD5",
    "MD5-DataIntegrity-026": "Itu juga biasa digunakan untuk memverifikasi integritas data selama transmisi dan penyimpanan, seperti saat menggunakan rsync untuk sinkronisasi file atau memeriksa kumpulan data besar.",
    "MD5-Def-002": "MD5 (Message-Digest Algorithm 5) adalah fungsi hash kriptografi yang banyak digunakan yang mengambil pesan masukan dan menghasilkan nilai hash 128-bit berukuran tetap.",
    "MD5-DigitalSignature-Risks-027": "Resiko Penggunaan MD5 untuk Tanda Tangan Digital",
    "MD5-Disadvantages-015": "Apa saja kelemahan dan masalah keamanan MD5?",
    "MD5-FAQ-001": "Apa itu MD5?",
    "MD5-FileChecksum-005": "MD5 sering digunakan untuk memverifikasi integritas file saat mengunduh perangkat lunak atau file besar. Ini menghasilkan checksum yang dapat dibandingkan dengan yang disediakan oleh sumber untuk memastikan file yang diunduh tidak dirusak.",
    "MD5-Future-028": "Apakah MD5 masih relevan saat ini?",
    "MD5-InsecurityExamples-018": "Contoh Kerusakan Keamanan MD5",
    "MD5-Operation-008": "Bagaimana cara kerja operasi MD5?",
    "MD5-PKI-025": "MD5 telah digunakan dalam Infrastruktur Kunci Publik (PKI) untuk membuat tanda tangan digital, meskipun penggunaannya sebagian besar sudah tidak digunakan lagi karena masalah keamanan. Sertifikat yang ditandatangani dengan MD5 tidak lagi dipercaya oleh sebagian besar sistem modern.",
    "MD5-PasswordHashing-006": "Itu juga secara historis digunakan dalam hashing kata sandi tetapi sekarang dianggap tidak aman karena kerentanannya terhadap tabrakan dan kemudahan retak. Sistem modern telah beralih ke alternatif yang lebih kuat seperti bcrypt atau Argon2.",
    "MD5-Process-009": "MD5 beroperasi dengan memecah pesan masukan menjadi beberapa bagian dan meneruskan setiap bagian melalui beberapa putaran pemrosesan yang melibatkan fungsi logika, aritmatika modular, dan operasi bitwise. Hasilnya digabungkan untuk menghasilkan nilai hash akhir 128-bit.",
    "MD5-Purpose-003": "Tujuannya adalah untuk memastikan integritas data dengan menghasilkan sidik jari digital unik untuk setiap data tertentu. Jika bahkan satu bit pun pada data asli berubah, hash MD5 akan sangat berbeda.",
    "MD5-Relevance-029": "MD5 tidak lagi dianggap aman untuk tujuan kriptografi, terutama untuk aplikasi baru yang memerlukan ketahanan tabrakan atau integritas pesan yang kuat. Namun, hal ini masih dapat ditemukan pada sistem lama atau aplikasi non-kriptografi yang mengutamakan kecepatan dibandingkan keamanan.",
    "MD5-Rounds-010": "Algoritme ini terdiri dari empat tahapan utama yang dilakukan pada keadaan internal 128-bit yang diinisialisasi dengan konstanta. Ada total 64 putaran pemrosesan, di mana setiap putaran mengubah keadaan internal berdasarkan blok pesan masukan.",
    "MD5-Speed-013": "MD5 relatif cepat, sehingga membuatnya populer untuk aplikasi yang memerlukan hashing cepat.",
    "MD5-Standardization-014": "Ini telah distandarisasi secara luas dan diimplementasikan dalam berbagai bahasa pemrograman dan platform, sehingga mudah untuk diintegrasikan ke dalam sistem dan alat yang ada.",
    "MD5-Summary-031": "Singkatnya, poin penting apa yang harus saya ingat tentang MD5?",
    "MD5-Summary-Point1-032": "MD5 adalah fungsi hash kriptografi yang cepat namun tidak aman yang rentan terhadap serangan tabrakan.",
    "MD5-Summary-Point2-033": "Kegunaan utamanya adalah untuk memastikan integritas data dan untuk beberapa operasi kriptografi, namun sebagian besar telah digantikan oleh alternatif yang lebih kuat seperti SHA-256 dan BLAKE2.",
    "MD5-Summary-Point3-034": "Meskipun Anda mungkin menemukan MD5 dalam sistem lama atau skenario yang tidak sensitif terhadap keamanan, sangat penting untuk menghindari penggunaannya untuk proyek baru yang memerlukan keamanan kriptografi.",
    "MD5-Transition-030": "Karena algoritme yang lebih baru dan lebih aman seperti SHA-256 dan BLAKE2 tersedia secara luas dan lebih dipahami, disarankan untuk beralih dari MD5 dalam semua konteks yang mengutamakan keamanan.",
    "MD5-Usage-004": "Bagaimana MD5 digunakan dalam praktik?",
    "SHA-256-020": "SHA-256 (Secure Hash Algorithm) adalah alternatif yang banyak digunakan dan menawarkan keamanan yang lebih kuat daripada MD5. Ini menghasilkan nilai hash 256-bit yang lebih besar dan merupakan bagian dari keluarga SHA-2.",
    "SHA-2_Info-022": "Informasi SHA-2"
}