{
    "CSS-Advantages-010": "Jaké jsou výhody používání CSS?",
    "CSS-Advantages-Customization-012": "Další výhodou je jeho schopnost přizpůsobit vzhled a chování více stránek najednou, což šetří čas a úsilí při aktualizaci stylů pro celý web.",
    "CSS-Advantages-Separation-011": "Jednou z výhod je oddělení zájmů mezi obsahem a prezentací, což zlepšuje udržovatelnost a škálovatelnost webových stránek.",
    "CSS-Animations-Transitions-019": "Animace a přechody CSS umožňují plynulé vizuální efekty bez nutnosti JavaScriptu.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) je jazyk stylů používaný k popisu prezentace dokumentu napsaného v HTML nebo XML.",
    "CSS-Disadvantages-013": "Jaké jsou některé nevýhody CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Dalším problémem je kompatibilita mezi různými prohlížeči, protože různé prohlížeče mohou pravidla CSS interpretovat odlišně. To vyžaduje, aby vývojáři používali předpony dodavatele nebo techniky detekce funkcí pro konzistentní vykreslování napříč prohlížeči.",
    "CSS-Disadvantages-Cascade-014": "Jedním z problémů je řízení kaskádové povahy stylů, což může někdy vést k neočekávaným problémům s dědičností a specifičností.",
    "CSS-Evolution-006": "Od té doby se vyvíjel prostřednictvím CSS2 (1998), CSS2.1 (2007), CSS3 (probíhající vývoj), zaváděním funkcí, jako jsou selektory, animace, responzivní design a další.",
    "CSS-Future-020": "Jaká je budoucnost technologie CSS?",
    "CSS-Future-Houdini-022": "Houdini se například zaměřuje na poskytování nízkoúrovňových rozhraní API pro přizpůsobení procesu vykreslování prohlížeče a dává vývojářům bezprecedentní kontrolu nad stylem a rozložením.",
    "CSS-Future-Progress-021": "Pracovní skupina CSS pokračuje v práci na nových modulech, jako jsou proměnné CSS (vlastní vlastnosti), Houdini a dotazy na kontejnery.",
    "CSS-Hist-Origin-005": "CSS byl poprvé navržen Håkonem Wium Lie v říjnu 1994 a stal se oficiálním doporučením W3C v prosinci 1996 s CSS1.",
    "CSS-History-004": "Jaká je historie CSS?",
    "CSS-History-W3C": "Časová osa doporučení W3C CSS",
    "CSS-Key-Features-016": "Jaké jsou některé klíčové funkce CSS?",
    "CSS-Layouts-018": "Systémy rozvržení Flexbox a Grid poskytují výkonné nástroje pro vytváření citlivých a flexibilních rozvržení stránek.",
    "CSS-MDN-Animations": "Průvodce MDN po animacích CSS",
    "CSS-MDN-Flexbox": "Průvodce MDN pro Flexbox",
    "CSS-MDN-Grid": "Průvodce MDN po mřížce CSS",
    "CSS-MDN-Houdini": "MDN Úvod do Houdini",
    "CSS-Purpose-003": "Umožňuje vývojářům oddělit obsah od prezentace, definovat styly, jako je rozvržení, barvy a písma, díky čemuž jsou webové stránky vizuálně přitažlivé a konzistentní na různých zařízeních a obrazovkách.",
    "CSS-Selectors-017": "Selektory umožňují cílení na konkrétní prvky HTML na základě jejich typu, třídy, ID, atributů a dalších.",
    "CSS-Tech-History-001": "Co je CSS?",
    "CSS-Usage-007": "Jak mohu používat CSS ve svých webových projektech?",
    "CSS-Usage-Basics-008": "Chcete-li použít CSS, vytvořte samostatný soubor (např. style.css) obsahující vaše styly a poté jej propojte se svým souborem HTML pomocí prvku <link> v sekci <head>.",
    "CSS-Usage-Inline-009": "Případně můžete zahrnout vložené styly přímo do prvků HTML pomocí atributu 'style' nebo vložit CSS do tagu <style> v sekci <head>.",
    "CSS-Vendor-Prefixes": "Průvodce MDN pro předpony dodavatele",
    "CSS-W3C-Selectors": "W3C Selectors Level 4 Spec",
    "CSS-WG-Future-Modules": "Aktuální práce W3C CSS"
}