{
    "CSS-Advantages-010": "Quali sono i vantaggi dell’utilizzo dei CSS?",
    "CSS-Advantages-Customization-012": "Un altro vantaggio è la capacità di personalizzare l'aspetto di più pagine contemporaneamente, risparmiando tempo e fatica durante l'aggiornamento degli stili a livello di sito.",
    "CSS-Advantages-Separation-011": "Un vantaggio è la separazione tra contenuto e presentazione, che migliora la manutenibilità e la scalabilità dei siti web.",
    "CSS-Animations-Transitions-019": "Le animazioni e le transizioni CSS consentono effetti visivi fluidi senza richiedere JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) è un linguaggio di fogli di stile utilizzato per descrivere la presentazione di un documento scritto in HTML o XML.",
    "CSS-Disadvantages-013": "Quali sono alcuni svantaggi dei CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Un altro problema è la compatibilità tra browser, poiché browser diversi potrebbero interpretare le regole CSS in modo diverso. Ciò richiede agli sviluppatori di utilizzare prefissi dei fornitori o tecniche di rilevamento delle funzionalità per un rendering coerente tra i browser.",
    "CSS-Disadvantages-Cascade-014": "Una sfida è gestire la natura a cascata degli stili, che a volte può portare a problemi di ereditarietà e specificità inaspettati.",
    "CSS-Evolution-006": "Da allora, si è evoluto attraverso CSS2 (1998), CSS2.1 (2007), CSS3 (sviluppo in corso), introducendo funzionalità come selettori, animazioni, design reattivo e altro ancora.",
    "CSS-Future-020": "Qual è il futuro della tecnologia CSS?",
    "CSS-Future-Houdini-022": "Houdini, ad esempio, mira a fornire API di basso livello per personalizzare il processo di rendering del browser, consentendo agli sviluppatori un controllo senza precedenti su stile e layout.",
    "CSS-Future-Progress-021": "Il gruppo di lavoro CSS continua a lavorare su nuovi moduli come Variabili CSS (Proprietà personalizzate), Houdini e Query contenitore.",
    "CSS-Hist-Origin-005": "I CSS furono proposti per la prima volta da Håkon Wium Lie nell'ottobre 1994 e divennero una raccomandazione ufficiale del W3C nel dicembre 1996 con CSS1.",
    "CSS-History-004": "Qual è la storia dei CSS?",
    "CSS-History-W3C": "Cronologia delle raccomandazioni CSS del W3C",
    "CSS-Key-Features-016": "Quali sono alcune caratteristiche chiave dei CSS?",
    "CSS-Layouts-018": "I sistemi di layout Flexbox e Grid forniscono strumenti potenti per creare layout di pagina reattivi e flessibili.",
    "CSS-MDN-Animations": "Guida MDN alle animazioni CSS",
    "CSS-MDN-Flexbox": "Guida MDN a Flexbox",
    "CSS-MDN-Grid": "Guida MDN alla griglia CSS",
    "CSS-MDN-Houdini": "MDN Introduzione a Houdini",
    "CSS-Purpose-003": "Consente agli sviluppatori di separare il contenuto dalla presentazione, definendo stili come layout, colori e caratteri, rendendo le pagine Web visivamente accattivanti e coerenti su diversi dispositivi e schermi.",
    "CSS-Selectors-017": "I selettori consentono di scegliere come target elementi HTML specifici in base al tipo, alla classe, all'ID, agli attributi e altro ancora.",
    "CSS-Tech-History-001": "Cos'è il CSS?",
    "CSS-Usage-007": "Come utilizzo i CSS nei miei progetti web?",
    "CSS-Usage-Basics-008": "Per utilizzare i CSS, crea un file separato (ad esempio style.css) contenente i tuoi stili, quindi collegalo al tuo file HTML utilizzando l'elemento <link> all'interno della sezione <head>.",
    "CSS-Usage-Inline-009": "In alternativa, puoi includere stili in linea direttamente negli elementi HTML utilizzando l'attributo 'style' o incorporare CSS nel tag <style> all'interno della sezione <head>.",
    "CSS-Vendor-Prefixes": "Guida MDN sui prefissi dei fornitori",
    "CSS-W3C-Selectors": "Selettori W3C Livello 4 Spec",
    "CSS-WG-Future-Modules": "Lavoro attuale sui CSS del W3C"
}