{
    "CSS-Advantages-010": "Wat zijn de voordelen van het gebruik van CSS?",
    "CSS-Advantages-Customization-012": "Een ander voordeel is de mogelijkheid om het uiterlijk van meerdere pagina's tegelijk aan te passen, waardoor u tijd en moeite bespaart bij het bijwerken van stijlen voor de hele site.",
    "CSS-Advantages-Separation-011": "Eén voordeel is de scheiding van de zorgen tussen inhoud en presentatie, wat de onderhoudbaarheid en schaalbaarheid van websites verbetert.",
    "CSS-Animations-Transitions-019": "CSS-animaties en -overgangen maken vloeiende visuele effecten mogelijk zonder dat JavaScript nodig is.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) is een stijlbladtaal die wordt gebruikt voor het beschrijven van de presentatie van een document geschreven in HTML of XML.",
    "CSS-Disadvantages-013": "Wat zijn enkele nadelen van CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Een ander probleem is de compatibiliteit tussen browsers, omdat verschillende browsers CSS-regels verschillend kunnen interpreteren. Dit vereist dat ontwikkelaars leveranciersvoorvoegsels of functiedetectietechnieken gebruiken voor consistente weergave in alle browsers.",
    "CSS-Disadvantages-Cascade-014": "Eén uitdaging is het beheersen van de trapsgewijze aard van stijlen, wat soms kan leiden tot onverwachte overervings- en specificiteitsproblemen.",
    "CSS-Evolution-006": "Sindsdien is het geëvolueerd via CSS2 (1998), CSS2.1 (2007), CSS3 (voortdurende ontwikkeling), waarbij functies zijn geïntroduceerd zoals selectors, animaties, responsief ontwerp en meer.",
    "CSS-Future-020": "Wat is de toekomst van CSS-technologie?",
    "CSS-Future-Houdini-022": "Houdini wil bijvoorbeeld API's op laag niveau bieden voor het aanpassen van het weergaveproces van de browser, waardoor ontwikkelaars ongekende controle krijgen over stijl en lay-out.",
    "CSS-Future-Progress-021": "De CSS-werkgroep blijft werken aan nieuwe modules zoals CSS-variabelen (aangepaste eigenschappen), Houdini en Containerquery's.",
    "CSS-Hist-Origin-005": "CSS werd voor het eerst voorgesteld door Håkon Wium Lie in oktober 1994 en werd in december 1996 een officiële W3C-aanbeveling met CSS1.",
    "CSS-History-004": "Wat is de geschiedenis van CSS?",
    "CSS-History-W3C": "W3C CSS-aanbevelingen tijdlijn",
    "CSS-Key-Features-016": "Wat zijn enkele belangrijke functies in CSS?",
    "CSS-Layouts-018": "Flexbox- en Grid-opmaaksystemen bieden krachtige hulpmiddelen voor het creëren van responsieve en flexibele pagina-indelingen.",
    "CSS-MDN-Animations": "MDN-gids voor CSS-animaties",
    "CSS-MDN-Flexbox": "MDN-gids voor Flexbox",
    "CSS-MDN-Grid": "MDN-gids voor CSS-raster",
    "CSS-MDN-Houdini": "MDN Inleiding tot Houdini",
    "CSS-Purpose-003": "Het stelt ontwikkelaars in staat inhoud van presentatie te scheiden en stijlen zoals lay-out, kleuren en lettertypen te definiëren, waardoor webpagina's visueel aantrekkelijk en consistent worden op verschillende apparaten en schermen.",
    "CSS-Selectors-017": "Met selectors kunt u specifieke HTML-elementen targeten op basis van hun type, klasse, ID, attributen en meer.",
    "CSS-Tech-History-001": "Wat is CSS?",
    "CSS-Usage-007": "Hoe gebruik ik CSS in mijn webprojecten?",
    "CSS-Usage-Basics-008": "Om CSS te gebruiken, maakt u een apart bestand (bijvoorbeeld style.css) met uw stijlen en koppelt u dit vervolgens aan uw HTML-bestand met behulp van het <link>-element in de <head>-sectie.",
    "CSS-Usage-Inline-009": "Als alternatief kunt u inline-stijlen rechtstreeks in HTML-elementen opnemen met behulp van het 'style'-attribuut of CSS insluiten in de <style>-tag in de <head>-sectie.",
    "CSS-Vendor-Prefixes": "MDN-gids over leveranciersvoorvoegsels",
    "CSS-W3C-Selectors": "W3C-kiezers Niveau 4 Spec",
    "CSS-WG-Future-Modules": "W3C CSS huidig ​​werk"
}