{
    "CSS-Advantages-010": "Quais são as vantagens de usar CSS?",
    "CSS-Advantages-Customization-012": "Outra vantagem é a capacidade de personalizar a aparência de várias páginas ao mesmo tempo, economizando tempo e esforço ao atualizar estilos em todo o site.",
    "CSS-Advantages-Separation-011": "Uma vantagem é a separação de preocupações entre conteúdo e apresentação, o que melhora a manutenção e escalabilidade dos sites.",
    "CSS-Animations-Transitions-019": "Animações e transições CSS permitem efeitos visuais suaves sem a necessidade de JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) é uma linguagem de folha de estilo usada para descrever a apresentação de um documento escrito em HTML ou XML.",
    "CSS-Disadvantages-013": "Quais são algumas desvantagens do CSS?",
    "CSS-Disadvantages-Browser-Compat-015": "Outro problema é a compatibilidade entre navegadores, pois diferentes navegadores podem interpretar as regras CSS de maneira diferente. Isso exige que os desenvolvedores usem prefixos de fornecedores ou técnicas de detecção de recursos para renderização consistente em todos os navegadores.",
    "CSS-Disadvantages-Cascade-014": "Um desafio é gerenciar a natureza em cascata dos estilos, o que às vezes pode levar a problemas inesperados de herança e especificidade.",
    "CSS-Evolution-006": "Desde então, evoluiu através de CSS2 (1998), CSS2.1 (2007), CSS3 (desenvolvimento contínuo), introduzindo recursos como seletores, animações, design responsivo e muito mais.",
    "CSS-Future-020": "Qual é o futuro da tecnologia CSS?",
    "CSS-Future-Houdini-022": "Houdini, por exemplo, visa fornecer APIs de baixo nível para personalizar o processo de renderização do navegador, capacitando os desenvolvedores com um controle sem precedentes sobre estilo e layout.",
    "CSS-Future-Progress-021": "O Grupo de Trabalho CSS continua trabalhando em novos módulos, como Variáveis ​​CSS (Propriedades Personalizadas), Houdini e Consultas de Contêiner.",
    "CSS-Hist-Origin-005": "CSS foi proposto pela primeira vez por Håkon Wium Lie em outubro de 1994 e tornou-se uma recomendação oficial do W3C em dezembro de 1996 com CSS1.",
    "CSS-History-004": "Qual é a história do CSS?",
    "CSS-History-W3C": "Cronograma de recomendações CSS do W3C",
    "CSS-Key-Features-016": "Quais são alguns dos principais recursos do CSS?",
    "CSS-Layouts-018": "Os sistemas de layout Flexbox e Grid fornecem ferramentas poderosas para criar layouts de página responsivos e flexíveis.",
    "CSS-MDN-Animations": "Guia MDN para animações CSS",
    "CSS-MDN-Flexbox": "Guia MDN para Flexbox",
    "CSS-MDN-Grid": "Guia MDN para grade CSS",
    "CSS-MDN-Houdini": "Introdução do MDN a Houdini",
    "CSS-Purpose-003": "Ele permite que os desenvolvedores separem o conteúdo da apresentação, definindo estilos como layout, cores e fontes, tornando as páginas da web visualmente atraentes e consistentes em diferentes dispositivos e telas.",
    "CSS-Selectors-017": "Os seletores permitem direcionar elementos HTML específicos com base em seu tipo, classe, ID, atributos e muito mais.",
    "CSS-Tech-History-001": "O que é CSS?",
    "CSS-Usage-007": "Como uso CSS em meus projetos web?",
    "CSS-Usage-Basics-008": "Para usar CSS, você cria um arquivo separado (por exemplo, style.css) contendo seus estilos e, em seguida, vincula-o ao seu arquivo HTML usando o elemento <link> na seção <head>.",
    "CSS-Usage-Inline-009": "Alternativamente, você pode incluir estilos embutidos diretamente em elementos HTML usando o atributo 'style' ou incorporar CSS na tag <style> dentro da seção <head>.",
    "CSS-Vendor-Prefixes": "Guia MDN sobre prefixos de fornecedores",
    "CSS-W3C-Selectors": "Especificações de nível 4 dos seletores W3C",
    "CSS-WG-Future-Modules": "Trabalho atual de CSS do W3C"
}