{
    "CSS-Advantages-010": "Ưu điểm của việc sử dụng CSS là gì?",
    "CSS-Advantages-Customization-012": "Một ưu điểm khác là khả năng tùy chỉnh giao diện của nhiều trang cùng một lúc, tiết kiệm thời gian và công sức khi cập nhật kiểu trên toàn trang web.",
    "CSS-Advantages-Separation-011": "Một lợi thế là sự tách biệt giữa nội dung và cách trình bày, giúp cải thiện khả năng bảo trì và khả năng mở rộng của trang web.",
    "CSS-Animations-Transitions-019": "Hoạt ảnh và chuyển tiếp CSS cho phép hiệu ứng hình ảnh mượt mà mà không cần JavaScript.",
    "CSS-Def-002": "CSS (Cascading Style Sheets) là ngôn ngữ biểu định kiểu được sử dụng để mô tả cách trình bày tài liệu được viết bằng HTML hoặc XML.",
    "CSS-Disadvantages-013": "Một số nhược điểm của CSS là gì?",
    "CSS-Disadvantages-Browser-Compat-015": "Một vấn đề khác là khả năng tương thích giữa nhiều trình duyệt, vì các trình duyệt khác nhau có thể diễn giải các quy tắc CSS khác nhau. Điều này yêu cầu các nhà phát triển phải sử dụng tiền tố của nhà cung cấp hoặc kỹ thuật phát hiện tính năng để hiển thị nhất quán trên các trình duyệt.",
    "CSS-Disadvantages-Cascade-014": "Một thách thức là quản lý tính chất xếp tầng của các kiểu, điều này đôi khi có thể dẫn đến các vấn đề về tính đặc hiệu và kế thừa không mong muốn.",
    "CSS-Evolution-006": "Kể từ đó, nó đã phát triển thông qua CSS2 (1998), CSS2.1 (2007), CSS3 (đang phát triển), giới thiệu các tính năng như bộ chọn, hoạt ảnh, thiết kế đáp ứng, v.v.",
    "CSS-Future-020": "Tương lai của công nghệ CSS là gì?",
    "CSS-Future-Houdini-022": "Ví dụ: Houdini nhằm mục đích cung cấp các API cấp thấp để tùy chỉnh quy trình kết xuất của trình duyệt, trao quyền cho các nhà phát triển khả năng kiểm soát chưa từng có đối với kiểu dáng và bố cục.",
    "CSS-Future-Progress-021": "Nhóm làm việc CSS tiếp tục làm việc trên các mô-đun mới như Biến CSS (Thuộc tính tùy chỉnh), Houdini và Truy vấn vùng chứa.",
    "CSS-Hist-Origin-005": "CSS lần đầu tiên được Håkon Wium Lie đề xuất vào tháng 10 năm 1994 và trở thành Khuyến nghị chính thức của W3C vào tháng 12 năm 1996 với CSS1.",
    "CSS-History-004": "Lịch sử của CSS là gì?",
    "CSS-History-W3C": "Dòng thời gian đề xuất CSS của W3C",
    "CSS-Key-Features-016": "Một số tính năng chính trong CSS là gì?",
    "CSS-Layouts-018": "Hệ thống bố cục Flexbox và Grid cung cấp các công cụ mạnh mẽ để tạo bố cục trang linh hoạt và linh hoạt.",
    "CSS-MDN-Animations": "Hướng dẫn MDN về Hoạt ảnh CSS",
    "CSS-MDN-Flexbox": "Hướng dẫn MDN về Flexbox",
    "CSS-MDN-Grid": "Hướng dẫn MDN về lưới CSS",
    "CSS-MDN-Houdini": "Giới thiệu MDN về Houdini",
    "CSS-Purpose-003": "Nó cho phép các nhà phát triển tách nội dung khỏi bản trình bày, xác định các kiểu như bố cục, màu sắc và phông chữ, làm cho các trang web trở nên hấp dẫn về mặt trực quan và nhất quán trên các thiết bị và màn hình khác nhau.",
    "CSS-Selectors-017": "Bộ chọn cho phép nhắm mục tiêu các phần tử HTML cụ thể dựa trên loại, lớp, ID, thuộc tính, v.v. của chúng.",
    "CSS-Tech-History-001": "CSS là gì?",
    "CSS-Usage-007": "Làm cách nào để sử dụng CSS trong các dự án web của tôi?",
    "CSS-Usage-Basics-008": "Để sử dụng CSS, bạn tạo một tệp riêng biệt (ví dụ: style.css) chứa các kiểu của bạn, sau đó liên kết nó với tệp HTML bằng phần tử <link> trong phần <head>.",
    "CSS-Usage-Inline-009": "Ngoài ra, bạn có thể đưa trực tiếp các kiểu nội tuyến vào các phần tử HTML bằng cách sử dụng thuộc tính 'style' hoặc nhúng CSS vào thẻ <style> bên trong phần <head>.",
    "CSS-Vendor-Prefixes": "Hướng dẫn MDN về tiền tố nhà cung cấp",
    "CSS-W3C-Selectors": "Thông số kỹ thuật cấp 4 của bộ chọn W3C",
    "CSS-WG-Future-Modules": "Công việc hiện tại của CSS W3C"
}