{
    "15424": "Na tym polega cały problem nauki. Masz grupę empirystów próbujących opisać rzeczy stanowiące niewyobrażalną cudowność. – Billa Wattersona",
    "15999": "Innowacja to proces wprowadzania zmian w czymś ustalonym. -Zespół ds. definicji innowacji",
    "16987": "Czasami opłaca się zostać w poniedziałek w łóżku, zamiast spędzać resztę tygodnia na debugowaniu poniedziałkowego kodu. – Dane Salomona",
    "19775": "Nauka jest sposobem na życie. To jest perspektywa. Nauka to proces, który prowadzi nas od zamętu do zrozumienia w sposób precyzyjny, przewidywalny i niezawodny – transformacja, która dla tych, którzy mają szczęście jej doświadczyć, daje siłę i emocje. – Briana Greena",
    "38127": "Testowanie to proces próby złamania kodu - Anonimowy",
    "42641": "Tworzenie stron internetowych jest trudne, ale tylko wtedy sprawia przyjemność. Musisz po prostu ustalić swoje standardy. Gdyby to miało być łatwe, czy ktoś by to zrobił? – Olawale Daniel",
    "46367": "Innowacja jest kluczem do uwolnienia potencjału wzrostu. -Omar Ishrak",
    "57225": "Innowacja jest siłą napędową dobrze prosperującego biznesu. -Michaela Della",
    "63470": "Prawdziwy naukowiec rozwiązuje problemy, a nie lamentuje, że są nierozwiązywalne. – Anna McCaffrey",
    "66187": "Rozmowa jest tania. Pokaż mi kod. - Linus Torvalds",
    "68518": "Oprogramowanie i katedry są w dużej mierze takie same — najpierw je budujemy, a potem się modlimy.",
    "77528": "Innowacja jest siłą napędową postępu. -Johna F.Kennedy'ego",
    "80972": "Oczywiście zły kod można wyczyścić. Ale to jest bardzo drogie. — Robert C. Martin",
    "85805": "Ekspert to osoba, która popełniła wszystkie błędy, jakie można popełnić w bardzo wąskiej dziedzinie. – Neils Bohr",
    "92941": "W prawdziwym świecie istnieje prawdziwa poezja. Nauka jest poezją rzeczywistości. - Richard dawkins",
    "-wHWkv2OC": "Dlaczego nie mogę się zalogować?",
    "-wdkeq": "Czy ta społeczność jest organizacją non-profit?",
    "00d36": "Najlepszym sposobem przewidzenia przyszłości jest jej wymyślenie. -Alan Kay",
    "09m6vG51A": "w rozwoju",
    "0a310": "Do nauki nie ma królewskiej drogi i tylko ci, którzy nie boją się męczącej wspinaczki po jej stromych ścieżkach, mają szansę zdobyć jej świetliste szczyty. – Karol Marks",
    "0a710": "Innowacyjność jest siłą napędową każdej organizacji. -Dr. R. L. Bhatia",
    "0ba15": "Udana innowacja wymaga podjęcia skalkulowanego ryzyka. -Harvard Pruden",
    "0e299": "Wszystko jest teoretycznie niemożliwe, dopóki nie zostanie zrobione. – Roberta A. Heinleina",
    "114ee": "Kodowanie niczym poezja powinno być krótkie i zwięzłe. – Santosh Kalwar",
    "13pmE": "Wesprzyj nas",
    "149c0": "W kwestiach nauki autorytet tysiąca nie jest wart pokornego rozumowania pojedynczej osoby. – Galileo Galilei",
    "1883d": "Nauka znacznie bardziej pobudza wyobraźnię niż klasyka. – J. B. S. Haldane",
    "188cd": "Programowania uczy się poprzez pisanie programów. – Briana Kernighana",
    "18f46": "Rakiety są fajne. Nie da się tego obejść. – Elona Muska",
    "1a8b9": "Naukowiec nie jest osobą, która daje właściwe odpowiedzi, lecz tym, który zadaje właściwe pytania. – Claude Levi-Strauss",
    "1d71a": "Rodzimy się w danym momencie, w danym miejscu i niczym roczniki wina, mamy cechy roku i pory roku, w których się urodziliśmy. Astrologia nie rości sobie pretensji do niczego więcej. – Karol Jung",
    "1da5a": "Innowacyjność jest podstawą postępu i sukcesu we współczesnym świecie biznesu. -Larry'ego Page'a",
    "1ff27": "Naukę rozumiemy na tyle dobrze, że możemy ją wyjaśnić komputerowi; sztuka to wszystko inne. – Donald E. Knuth",
    "22f3a": "Innowacyjność jest kluczową kwestią dobrobytu gospodarczego. – Michał Porter",
    "23f61": "Innowacja to nie tylko dobry pomysł; chodzi o urzeczywistnienie tego pomysłu. -Eryk Qualman",
    "277a9": "Nauka nie jest w stanie rozwiązać ostatecznej tajemnicy natury. A dzieje się tak dlatego, że w ostatecznym rozrachunku sami jesteśmy częścią tajemnicy, którą staramy się rozwiązać. – Maks Planck",
    "27ef9": "Innowacja to umiejętność przekształcania pomysłów w faktury. -L. Duncana",
    "2S_7EVIsK": "Walidator JSON",
    "2b7f7": "Jestem pewien, że wszechświat jest pełen inteligentnego życia. To było po prostu zbyt inteligentne, żeby tu przyjść. – Arthur C. Clarke",
    "321e0": "Debugowanie jest dwa razy trudniejsze niż pisanie kodu. Dlatego jeśli napiszesz kod tak sprytnie, jak to możliwe, z definicji nie jesteś wystarczająco mądry, aby go debugować – Brian W. Kernighan",
    "32c8d": "Jeśli debugowanie to proces usuwania błędów, programowanie musi polegać na ich wprowadzaniu. – Sam Redwine",
    "33aa4": "Nauka jest po prostu czystym empiryzmem i ze względu na swoją metodę wyklucza metafizykę. – Steve’a Martina",
    "380da": "Dzisiejsze programowanie to wyścig pomiędzy inżynierami oprogramowania starającymi się tworzyć większe i lepsze, idiotoodporne programy, a Wszechświatem próbującym produkować większych i lepszych idiotów. Jak na razie Wszechświat wygrywa. – Ricka Cooka",
    "394b6": "Jeśli myślałeś, że nauka jest pewna? cóż, to po prostu błąd z Twojej strony. – Richarda Feynmana",
    "398cc": "Wygląda na to, że programiści zmieniają świat. Byłoby ulgą dla nich i dla nas wszystkich, gdyby coś o tym wiedzieli. – Ellen Ullman",
    "3I-dkqkwr": "Należy pamiętać, że na tej stronie NIE zapewniamy żadnych komercyjnych kursów przygotowujących do egzaminów z języka angielskiego ani egzaminów z innych przedmiotów i nie planujemy tego robić w przyszłości.",
    "3d297": "To, co kocham w nauce, to to, że gdy się uczysz, tak naprawdę nie otrzymujesz odpowiedzi. Po prostu dostajesz lepsze pytania. – Johna Greena",
    "40b7f": "Innowacje to jedyny sposób na zwycięstwo w dłuższej perspektywie. -Jeffa Immelta",
    "420b0": "Udana innowacja wymaga zaangażowania we współpracę i otwartą komunikację. -Rachel D. Ellison",
    "43be5": "Dziennik",
    "43e45": "Nie ma innego prawa, jak tylko to, że nie ma prawa. – Johna Archibalda Wheelera",
    "45cb0": "Innowacja to nie tylko tworzenie nowych pomysłów, ale także ich skuteczna realizacja. -Arun Pandit",
    "4N79HNWiA": "Aby mieć pewność, że jest to społeczność non-profit, otwieramy również cały jej kod źródłowy na GitHubie, który można znaleźć w stopce tej strony.",
    "4PIqD": "Przegląd kodu",
    "4cf03": "Właściwie wszystko, co można nazwać liczbą; bez tego bowiem nie da się niczego uchwycić umysłem ani rozpoznać. – Filolaos",
    "4d389": "Innowacja jest sposobem na życie odnoszącego sukcesy przedsiębiorcy. -Johna Ramptona",
    "4da84": "Być może nie myślisz, że programiści to artyści, ale programowanie to niezwykle kreatywny zawód. To kreatywność oparta na logice. – Jan Romero",
    "4sQWoTgfr": "Kod weryfikacyjny wygasł. Odśwież stronę i spróbuj ponownie",
    "4sdQWoTgfr": "Kod weryfikacyjny wygasł. Odśwież stronę i spróbuj ponownie.",
    "4vdfwf": "OK",
    "532fd": "Innowacja to umiejętność postrzegania zmiany jako szansy, a nie zagrożenia. -Steve'a Jobsa",
    "57eaa": "Jesteśmy po prostu zaawansowaną rasą małp na małej planecie bardzo przeciętnej gwiazdy. Ale możemy zrozumieć Wszechświat. To czyni nas czymś wyjątkowym. – Stephena Hawkinga",
    "58c03": "Innowacyjność jest kluczowym czynnikiem sukcesu każdego przedsiębiorstwa. -Ravi Venkatesan",
    "58c5f": "Jeżeli na początku Ci się nie uda, nazwij ją wersją 1.0. – Khayri R.R. Woulfe",
    "59f7d": "Innowacje są katalizatorem postępu i wzrostu. -Johna Donahoe",
    "5a8a1": "Innowacja to proces wpadania na pomysł i przekształcania go w rzeczywistość. -Kevin O'Leary",
    "5db54": "Nauka jest doskonałym antidotum na truciznę entuzjazmu i przesądów. - Adam Smith",
    "5qPOJL": "Aby wesprzeć LafTools, rozważ przyznanie gwiazdki naszemu repozytorium w GitHub lub uaktualnienie do naszej wersji profesjonalnej w ramach miesięcznej subskrypcji. Będziemy bardzo wdzięczni za Twoją pomoc i obiecujemy, że dzięki zebranym środkom LafTools stanie się jeszcze lepsze.",
    "626bf": "Gdybyśmy wiedzieli, co robimy, nie nazwalibyśmy tego badaniami, prawda? – Alberta Einsteina",
    "63d47": "Jakość jest efektem konfliktu pomiędzy programistami i testerami. – Jegor Bugajenk",
    "662f9": "Żyje się tylko raz, ale jeśli zrobisz to dobrze, raz wystarczy. — Mae West",
    "66ef1": "Dobry kod to najlepsza dokumentacja sama w sobie. Kiedy masz zamiar dodać komentarz, zadaj sobie pytanie: „Jak mogę ulepszyć kod, aby ten komentarz nie był potrzebny?”. – Steve McConnell",
    "66f12": "Nauka to zorganizowana wiedza. Mądrość to zorganizowane życie. – Willa Duranta",
    "6a0da": "Sztuka i nauka zadawania pytań jest źródłem wszelkiej wiedzy. – Tomasz Berger",
    "6hsnqWe": "Chociaż LafTools jest darmowym i otwartym oprogramowaniem, jego utrzymanie nadal wymaga znacznej ilości czasu i energii. W szczególności potrzebujemy środków na opłacenie niektórych interfejsów API w chmurze. Jeśli cenisz LafTools, rozważ wsparcie nas.",
    "71L3OI9T7": "Poznawanie pokoju, promowanie współpracy i dążenie do rozwoju stało się tematem obecnej epoki.",
    "72bee": "Nie jestem świetnym programistą; Jestem po prostu dobrym programistą ze świetnymi nawykami. – Kenta Becka",
    "74a91": "Testowanie prowadzi do porażki, a porażka do zrozumienia – Burt Rutan",
    "74f90": "Dzisiejsza nauka jest technologią jutra. – Edward Teller",
    "7714b": "Innowacja jest kluczem do odblokowania nowych możliwości i napędzania wzrostu.",
    "79f2d": "Większość dobrych programistów zajmuje się programowaniem nie dlatego, że spodziewają się zapłaty lub uznania publiczności, ale dlatego, że programowanie sprawia przyjemność. - Linus Torvalds",
    "7affb": "Świat nie będzie na nas czekać. Rewolucja technologiczna pozostawi nas w tyle, jeśli nie nadrobimy zaległości. – Kofiego Annana",
    "7c59e": "Doświadczenie to nazwa, którą każdy nadaje swoim błędom. – Oskar Wilde",
    "7d4e4": "Innowacja polega na znajdowaniu nowych i lepszych sposobów działania. -Jim Rohn",
    "7e19d": "Zamieszanie jest częścią programowania. – Felienne Hermans",
    "7flKa": "LafTools - Wszechmocny dla wszystkich profesjonalistów i inżynierów",
    "7zqdufsdddJ": "Tak, na pewno. Witryna ELB3.com wywodzi się z grupy dyskusyjnej WeChat o charakterze non-profit, {0}, której celem jest stworzenie przyjaznej, wolnej od reklam i komfortowej atmosfery do nauki języka angielskiego.",
    "8259a": "Programista: Maszyna, która zamienia kawę w kod. – Anonimowy",
    "850c1": "Naukowiec narzuca tylko dwie rzeczy, mianowicie prawdę i szczerość, narzuca je sobie i innym naukowcom. - Erwin Schrödinger",
    "8582b": "Jeśli chcemy, aby użytkownicy lubili nasze oprogramowanie, powinniśmy zaprojektować je tak, aby zachowywało się jak sympatyczna osoba. – Alana Coopera",
    "8692e": "Jest wielu bełkotów, całkowicie nie znających matematyki, którzy ośmielają się potępiać moją hipotezę, opierając się na autorytecie jakiejś części Biblii przekręconej dla ich celów. Nie cenię ich i gardzę ich bezpodstawnymi osądami. – Mikołaj Kopernik",
    "886d1": "Uważamy, że nawet jeśli udzielono odpowiedzi na wszystkie możliwe pytania naukowe, problemy życia nadal nie zostały w ogóle poruszone. – Ludwiga Wittgensteina",
    "8HcQxKgho": "Szybki dostęp",
    "8c224": "Bez względu na to, w jakim zawodzie chcesz pracować, bardzo ważne jest, aby nauczyć się przynajmniej jednego języka programowania. – Ram Ray",
    "8e5d0": "Innowacja jest wezwaniem przyszłości. – Kofiego Annana",
    "90b5e": "To nie jest błąd; to nieudokumentowana funkcja. – Anonimowy",
    "91f08": "Najlepszą rzeczą w technologii jest to, że pozwala skoncentrować się na wizji i zapomnieć o maszynach. – Johna Landisa",
    "9251d": "Innowacyjność jest kluczowym czynnikiem wpływającym na zdolność każdej firmy do odniesienia długoterminowego sukcesu. -Elona Muska",
    "92b29": "Innowacja to proces przyjęcia twórczego pomysłu i przekształcenia go w sukces komercyjny. -Richarda Bransona",
    "9334e": "Największą chwałą w życiu nie jest to, że nigdy nie upadamy, ale to, że podnosimy się za każdym razem, gdy upadniemy. - Nelson Mandela",
    "9412b": "Najpierw rozwiąż problem. Następnie napisz kod. – Johna Johnsona",
    "9469a": "Każdy powinien nauczyć się programować komputer, ponieważ uczy on myślenia. – Steve’a Jobsa",
    "98d3f": "Nauka to magia, która działa. – Kurta Vonneguta",
    "9YPgsPid2M": "Kod SMS",
    "9b_7a0fdf": "SHA256",
    "9b_7a0feb": "MD5",
    "9b_7a0fqwe": "Koder Base64",
    "9b_7a0sdf": "Dekoder Base64",
    "9cb71": "Innowacja polega na tworzeniu wartości dla klientów i poprawie ich życia. -Reed Hastings",
    "9d18a": "Oprogramowanie pochodzi z nieba, jeśli masz dobry sprzęt. – Kena Olsena",
    "Abi2k2cP7": "Przepraszamy, ta strona nie jest jeszcze ukończona.",
    "BP2jBlIE0": "Niektóre linki są nadal niedostępne, ponieważ LafTools jest wciąż w fazie rozwoju. Daj nam gwiazdkę, aby zasubskrybować najnowszą aktualizację w GitHub.",
    "BQs6go-dk": "Pobierz bezpłatnie LafTools na Windows, Linux i macOS.",
    "Bz_WdwvAPn": "Sprawdź, czy CAPTCHA jest poprawnie podany.",
    "C_qzLO7yw": "Aby uzyskać najlepszą jakość, użyj przeglądarki Chrome, Firefox lub Edge.",
    "CidOqAZ": "Jako twórca LafTools jestem wzruszony, że chcesz nas wspierać. W naszym zespole mamy dobrych ludzi, którzy ciężko pracują, aby stale ulepszać LafTools.",
    "CqFdiBu6M": "Pogląd",
    "CuHqw9m": "{0} nie jest prawidłowym numerem telefonu, obecnie system akceptuje tylko 11-cyfrowy numer telefonu.",
    "Ezsn81tfc": "Pogląd",
    "GaySMPQHo": "Trendy",
    "H39ddc0df": "Spróbuj zalogować się później, jeśli nie powiodło się zbyt wiele razy.",
    "HaU4NMabv": "Kod weryfikacyjny jest nieprawidłowy. Wprowadź ponownie lub odśwież obraz.",
    "HckK__LH2": "Więcej",
    "Ibzs2-Ho1": "Narzędzia CSV",
    "IugAFc4OT": "Wystąpił problem podczas przesyłania danych.",
    "Jbor69IBw": "Formatery",
    "N9bCERU1Q": "Wewnętrzna strona operacji dla LafTools",
    "NdqZcRL2QN": "Jeśli zapomniałeś hasła, możesz je zresetować, klikając link „Zapomniałem hasła”.",
    "OBjaZqTvx": "Dom",
    "OQWm4": "Zgłoś błąd",
    "TET4xnxBT": "Jajko wielkanocne",
    "TmvHUnZzQ": "Skopiowano adres URL strony do schowka",
    "UED59zbd-": "LafTools",
    "UjkOS50wO": "Dom",
    "V6U_f": "Warunki usługi",
    "WKG7e": "Zasady",
    "ZCzH8": "Najnowsza",
    "ZaS8MP8cr": "Uwaga: kod weryfikacyjny został odświeżony. Aby kontynuować, dostosuj wartości w formularzu i wprowadź kod ponownie.",
    "ZbD3F": "{0}, stworzony przez zespół LafTools",
    "a0ab0": "Sztuka jest drzewem życia. Nauka jest drzewem śmierci. – Williama Blake’a",
    "a2849": "Nauka to akceptacja tego, co działa, i odrzucenie tego, co nie. To wymaga więcej odwagi, niż mogłoby się wydawać. – Jakub Bronowski",
    "a3508": "Wyposażony w pięć zmysłów człowiek eksploruje otaczający go wszechświat i nazywa przygodę Nauką. – Edwina Hubble’a",
    "a5354": "To dziwne, że tylko niezwykłe, dokonane przez człowieka odkrycia drgnęły później, wydają się tak łatwe i proste. – George C. Lichtenberg",
    "a7062": "Innowacja jest iskrą, która rozpala postęp. -Robyn M. D’Angelo",
    "a8a34": "Innowacja jest wizytówką przyszłości. -Anna Eshoo",
    "a8dd9": "Życie nie może mieć przypadkowego początku… problem w tym, że istnieje około 2000 enzymów, a szansa uzyskania ich wszystkich w losowej próbie to tylko jedna część na 10^40 000. Jest to skandalicznie małe prawdopodobieństwo, któremu nie dałoby się sprostać nawet cały wszechświat. składał się z organicznej zupy. – Freda Hoyle’a",
    "aUdtds_qwY": "Zwykle możesz pomyślnie zalogować się przy użyciu swojego identyfikatora użytkownika lub numeru telefonu, nawet jeśli naruszyłeś zasady obowiązujące w tej społeczności.",
    "aa2f1": "Eksploracja to coś, co robisz, gdy nie wiesz, co robisz. To właśnie robią naukowcy na co dzień. Gdyby naukowiec wiedział już, co robi, niczego by nie odkrył, ponieważ już wiedział, co robi. – Neila deGrasse’a Tysona",
    "aa3a4": "Kod jest jak humor. Kiedy trzeba to wyjaśniać, jest źle. – Dom Cory’ego",
    "ab5f7": "Najsmutniejszym aspektem życia jest obecnie to, że nauka gromadzi wiedzę szybciej niż społeczeństwo mądrość. – Izaak Asimov",
    "ac615": "Spraw, żeby to działało, zrób to dobrze, zrób to szybko. – Kenta Becka",
    "adcca": "Każdy głupiec może napisać kod zrozumiały dla komputera. Dobrzy programiści piszą kod zrozumiały dla ludzi. – Martina Fowlera",
    "af3158": "Wszystko jest zdeterminowane... siłami, nad którymi nie mamy kontroli. -Alberta Einsteina",
    "afcb9": "Nic nie ma takiej mocy poszerzania umysłu, jak umiejętność systematycznego i prawdziwego badania wszystkiego, co spotyka Cię w życiu. – Marek Aureliusz",
    "afe52": "Zawsze jest jeszcze jeden błąd do naprawienia. – Ellen Ullman",
    "announcement": "Ogłoszenie",
    "b194e": "Innowacja pochodzi od producenta – nie od klienta. -W. Edwardsa Deminga",
    "b19bb": "W dniu, w którym nauka zacznie badać zjawiska niefizyczne, w ciągu jednej dekady poczyni większy postęp niż we wszystkich poprzednich wiekach swojego istnienia. - Nikola Tesla",
    "b2724": "Programowanie to sztuka mówienia drugiemu człowiekowi, czego oczekuje się od komputera. – Donalda Ervina Knutha",
    "b4603": "Życie jest tym, co dzieje się, gdy jesteś zajęty tworzeniem innych planów. — Johna Lennona",
    "b5014": "Wiele życiowych porażek to ludzie, którzy się poddali, nie zdając sobie sprawy, jak blisko byli sukcesu. – Thomas A. Edison",
    "b7wgrhuXl": "Tech",
    "bc574": "Innowacyjność jest siłą napędową zdrowego biznesu. -Marek Kubańczyk",
    "bc92f": "Udana innowacja zaczyna się od potrzeby klienta. -Michaela Della",
    "beb6e": "Pomysły są łatwe. Wdrożenie jest trudne. -Gość Kawasaki",
    "bfb8e": "Innowacyjność jest kluczem do utrzymania aktualności i konkurencyjności na rynku. -Marka Zuckerberga",
    "bjaEuT-cU": "Hostowane w {0}",
    "c7cfc": "Dobry test to taki, który ma duże prawdopodobieństwo złamania kodu w przypadku wystąpienia problemu – Michael Bolton",
    "cae2c": "Innowacja to proces przyjmowania pomysłów i przekształcania ich w rzeczywistość. -Neila Lawrence'a",
    "cd4d1": "Innowacyjność jest kluczem do rozwoju biznesu. -Andrzej R. Steinberg",
    "d0624": "Innowacja nie polega tylko na wymyślaniu nowych pomysłów, ale na ich skutecznej realizacji. -Jeff Bezos",
    "d10c9": "Innowacja jest kluczem do odblokowania nowego potencjału i odblokowania nowych rynków. -Tim gotuje",
    "d1820": "Dopóki człowiek nie powieli źdźbła trawy, natura może śmiać się z jego tak zwanej wiedzy naukowej. - Tomasz Edison",
    "d366a": "Innowacja jest kluczem do odblokowania nowego wzrostu. -Philip Kotler",
    "d5LAU": "Licencja na podstawie AGPLv3",
    "d7dc4": "Testowanie to proces oceny systemu lub jego komponentów w celu ustalenia, czy spełnia on określone wymagania, czy nie - Anonimowy",
    "dO6b2Tkqwe": "Ostatnio używane narzędzia",
    "da74c": "Spekulacje i eksploracja pomysłów wykraczających poza to, co wiemy na pewno, prowadzą do postępu. – Lisa Randall",
    "dc662": "Jedynym prawdziwym błędem jest ten, z którego niczego się nie nauczymy – John Powell",
    "dcebe": "Jeśli debugowanie to proces usuwania błędów oprogramowania, to programowanie musi polegać na ich wprowadzaniu – Edsger Dijkstra",
    "ddcc7": "Innowacyjność jest kluczem do sukcesu we współczesnej gospodarce. -Satya Nadella",
    "ddsdf3159": "Fizyka to tak naprawdę nic innego jak poszukiwanie ostatecznej prostoty, ale jak dotąd jedyne, co mamy, to rodzaj eleganckiego bałaganu. -Billa Brysona",
    "de47c": "Testowanie to sztuka znalezienia czarnej skrzynki i sprawienia, by śpiewała – James Bach",
    "dldeoeqwc": "Przyjazne przypomnienia",
    "dnsz7fwNx": "W identyfikatorze użytkownika rozróżniana jest wielkość liter.",
    "e097e": "Innowacja polega na tworzeniu nowych możliwości, a nie tylko nowych produktów. -Tony'ego Robbinsa",
    "e2379": "Żyjemy w społeczeństwie znakomicie uzależnionym od nauki i technologii, w którym prawie nikt nie ma pojęcia o nauce i technologii. – Carl Sagan",
    "e984f": "Czysty kod zawsze wygląda, jakby został napisany przez kogoś, komu na tym zależy. — Robert C. Martin",
    "ea227": "Najlepszym sposobem przewidywania przyszłości jest jej tworzenie. -Peter Drucker",
    "ee7d0": "Poczucie zachwytu, jakie może nam dać nauka, jest jednym z najwyższych doświadczeń, do jakich zdolna jest ludzka psychika. - Richard dawkins",
    "englishcorner": "język angielski",
    "f0d15": "Komputery są szybkie; programiści dbają o to, aby były powolne. – Anonimowy",
    "f12bb": "Innowacyjność jest siłą napędową postępu w świecie biznesu. Jest to proces generowania nowych pomysłów i przekształcania ich w namacalne produkty, usługi lub procesy, które dostarczają wartość klientom.",
    "f23c2": "Innowacja odróżnia lidera od naśladowcy. -Steve'a Jobsa",
    "f29b1": "Postęp osiąga się metodą prób i porażek; niepowodzeń jest na ogół sto razy więcej niż sukcesów, a mimo to zwykle pozostają one bez kroniki. – Williama Ramsaya",
    "f3151": "Największym ryzykiem jest niepodejmowanie żadnego ryzyka. -Marka Zuckerberga",
    "f3159": "Matematyka to gra, w którą gra się według pewnych prostych zasad, z bezsensownymi znakami na papierze. -Dawid Hilbert",
    "f315e7": "Matematyka nie zna ras ani granic geograficznych. -Dawid Hilbert",
    "f3160": "Matematyka jest najwyższym sędzią; od jego decyzji nie przysługuje odwołanie. -Tobiasz Dantzig",
    "f3161": "W matematyce sztuka stawiania pytań musi mieć większą wartość niż jego rozwiązywanie. -Georg Cantor",
    "f3162": "Matematyka to miejsce, w którym możesz robić rzeczy, których nie możesz zrobić w prawdziwym świecie. -Marcus du Sautoy",
    "f3163": "Rozwój i doskonalenie matematyki są ściśle związane z dobrobytem państwa. -Napoleon Bonaparte",
    "f3164": "Istota matematyki leży w jej wolności. -Georg Cantor",
    "f3165": "Matematyka jest nauką o tym, co samo w sobie jest jasne. -Carla Jacobiego",
    "f3166": "Matematyka, właściwie postrzegana, posiada nie tylko prawdę, ale także najwyższe piękno. -Bertranda Russella",
    "f3167": "Matematyka jest narzędziem specjalnie przystosowanym do zajmowania się wszelkiego rodzaju pojęciami abstrakcyjnymi. -P. Diraca",
    "f3168": "Matematyka odkrywa swoje tajemnice tylko tym, którzy podchodzą do niej z czystą miłością, dla jej piękna. -Archimedes",
    "f3169": "Matematyka jest najpiękniejszym i najpotężniejszym tworem ludzkiego ducha. -Stefan Banach",
    "f3170": "Matematyk nie studiuje czystej matematyki dlatego, że jest przydatna; studiuje ją, ponieważ sprawia mu to przyjemność i zachwyca się nią, ponieważ jest piękna. -Henri Poincaré",
    "f3171": "Studiowanie matematyki, podobnie jak Nilu, zaczyna się od drobiazgowości, ale kończy się wspaniałością. -Charlesa Caleba Coltona",
    "f318e4": "Biologia to najpotężniejsza technologia, jaką kiedykolwiek stworzono. DNA to oprogramowanie, białko to sprzęt, komórki to fabryki. -Arvind Gupta",
    "f31d71": "Fizyka jest, miejmy nadzieję, prosta. Fizycy nie. -Edwarda Tellera",
    "f31d75": "Fizyka to tak naprawdę nic innego jak poszukiwanie ostatecznej prostoty, ale jak dotąd jedyne, co mamy, to rodzaj eleganckiego bałaganu. -Billa Brysona",
    "f31e53": "Matematyka jest królową nauk. -Carla Friedricha Gaussa",
    "f31q52": "Czysta matematyka jest na swój sposób poezją logicznych idei. -Alberta Einsteina",
    "f31q54": "Księga natury napisana jest językiem matematyki. -Galileo Galilei",
    "f31q56": "Matematyka jest muzyką rozumu. -James Joseph Sylwester",
    "f31q58": "Matematyka nie dotyczy liczb, równań, obliczeń czy algorytmów: chodzi o zrozumienie. -Williama Paula Thurstona",
    "f31q70": "Biologia jest nauką. Ewolucja to koncepcja, która czyni biologię wyjątkową. -Jareda Diamonda",
    "f31q72": "Biologia jest poezją świata fizycznego, a biologia człowieka jest poezją naszego wszechświata. -Julian Casablancas",
    "f31q74": "Biologia to po prostu fizyka, która zaczęła brzydko pachnieć. -Nigel Calder",
    "f31q81": "Fizyka jest nauką o ruchach i działaniu ciał fizycznych pojmowaną w kategoriach przyczyny i skutku. -Arthur Compton",
    "f31qe82": "Biologia to proces programowy. Nasze ciała składają się z bilionów komórek, z których każda podlega temu procesowi. Ty i ja chodzimy z przestarzałym oprogramowaniem działającym w naszych ciałach, które ewoluowało w zupełnie innej epoce. - Raya Kurzweila",
    "f31r83": "Fizyka staje się dla fizyków zbyt trudna. -Dawid Hilbert",
    "f31sq66": "Biologia to tak naprawdę chemia, chemia to naprawdę fizyka, fizyka to naprawdę matematyka. -Matta Ridleya",
    "f31x76": "Biologia to nauka o złożonych rzeczach we Wszechświecie. Fizyka to nauka rzeczy prostych. -Richard dawkins",
    "f31x77": "Fizyka to doświadczenie, ułożone w ekonomicznym porządku. -Ernsta Macha",
    "f3d169": "Fizyka jest jedyną prawdziwą nauką. Reszta to tylko zbieranie znaczków. -Ernest Rutherford",
    "f3d179": "Fizyka staje się tak niewiarygodnie złożona, że ​​kształcenie fizyka zajmuje coraz więcej czasu. W rzeczywistości przygotowanie fizyka do poziomu, w którym rozumie on naturę problemów fizycznych, zajmuje tak dużo czasu, że jest już za stary, aby je rozwiązywać. -Eugeniusz Wigner",
    "f3d180": "Biologia jest nauką o życiu, jednak wielu z nas nie rozumie podstaw naszego własnego ciała. -Kathy Reichs",
    "f3e155": "Matematyka jest bramą i kluczem do nauk ścisłych. -Rogera Bacona",
    "f3q178": "Biologia nie jest przeznaczeniem. To nigdy nie było nic więcej niż tendencja. To był po prostu pierwszy szybki i brudny sposób natury na obliczenia z mięsem. Chipsy to przeznaczenie. -Bart Kosko",
    "f3sd162": "Biologia to nauka o skomplikowanych rzeczach, które sprawiają wrażenie zaprojektowanych w określonym celu. -Richard dawkins",
    "f3sd164": "Biologia daje mózg. Życie zamienia to w umysł. -Jeffrey Eugenides",
    "f3sd165": "W fizyce nie musisz sam sobie sprawiać kłopotów – natura robi to za ciebie. -Frank Wilczek",
    "f3sq167": "Dobrą rzeczą w nauce jest to, że jest ona prawdziwa niezależnie od tego, czy w nią wierzysz, czy nie. -Neil deGrasse Tyson",
    "f477b": "Programowanie to sztuka projektowania algorytmów i sztuka debugowania błędnego kodu. – Ellen Ullman",
    "f7cf7": "W rzeczywistości są dwie rzeczy: nauka i opinia; pierwsza rodzi wiedzę, druga ignorancję. – Hipokrates",
    "f814a": "Kiedy pisałem ten kod, tylko Bóg i ja zrozumieliśmy, co zrobiłem. Teraz tylko Bóg się kłóci. – Anonimowy",
    "f96ff": "Innowacyjność jest motorem postępu i sukcesu w biznesie. -Satya Nadella",
    "fa94e": "Innowacja jest kluczem do utrzymania przewagi w wyścigu konkurencyjnym. -Paula Sloane'a",
    "fc805": "Innowacja to kreatywność z zadaniem do wykonania. – Tomek Peters.",
    "fd3173": "Fizyka to wyobraźnia w prostej marynarce. -Johna Moffata",
    "fdd2b": "Nauka to zorganizowana wiedza. Mądrość to zorganizowane życie. – Immanuel Kant",
    "forever-foss": "Na zawsze FOSS!",
    "giveas3tar": "Jeśli podoba Ci się LafTools, daj nam gwiazdkę na GitHubie.",
    "groupnote": "Notatka",
    "hbvxdivMHi": "Łącznie {0} narzędzi",
    "iZXig7E2JF": "LafTools oferuje kompleksowy zestaw narzędzi programistycznych, w tym kodeki, formatery, narzędzia do przetwarzania obrazu i rozwiązania do zarządzania zasobami komputerowymi. Zaprojektowane, aby usprawnić i usprawnić przepływ prac programistycznych, LafTools to podstawowe źródło informacji umożliwiające wydajne tworzenie oprogramowania o wysokiej jakości.",
    "jRFk519Bj-": "Społeczność ta opiera się na w pełni międzynarodowym projekcie darmowego kodu źródłowego.",
    "jr_7Y98yZ": "LafTools",
    "kUSuP_S-Y": "Spróbuj z interfejsem klienta",
    "lWqYc": "Ta strona internetowa udostępnia narzędzia JSON, w tym JSON do XML, JSON do CSV, JSON do YAML.",
    "laftoolstitle": "Bezpłatne internetowe narzędzia LafTools",
    "lu2T6idPY": "Jeśli uważasz, że wystąpił problem z Twoim kontem, skontaktuj się z webmasterem.",
    "nh1W-": "Testowanie może jedynie wykazać obecność błędów, a nie ich brak – Edsger Dijkstra",
    "nncQE": "Życie",
    "o1ikM3T4c": "Pomocnicy programisty",
    "ob1q-I7s-": "Informacje o LafTools",
    "pNwe3": "Inny",
    "q0zA1kML_": "Internetowy zestaw narzędzi",
    "q3VjkLMsP": "Przyjaźń, wymiana, współpraca i rozwój",
    "qHoktx": "Dziękuję!",
    "qWemXE4": "1 stycznia 2024 r",
    "quality-first": "Jakość na pierwszym miejscu",
    "rK6cx": "{0}, zaprojektowany i opracowany przez zespół LafTools",
    "rzoFmjStq": "Odpowiednie narzędzia",
    "sdf3160": "Zadaniem teoretyków, zwłaszcza biologii, jest proponowanie nowych eksperymentów. Dobra teoria tworzy nie tylko przewidywania, ale zaskakujące przewidywania, które następnie okazują się prawdziwe. -Francis Crick",
    "t8DUz20a-": "Formater JSON",
    "title-laftools": "LafTools — wiodący, wszechstronny zestaw narzędzi dla programistów",
    "wCcPJZK": "{0} nie jest prawidłowym adresem e-mail",
    "wCctGPJZK": "{0} nie powinien być pusty",
    "wYsKTq7nK": "Kliknij mnie, aby zobaczyć kod źródłowy",
    "wi28h5_S2": "Kodeki",
    "yCsTC": "Przedwczesna optymalizacja jest źródłem wszelkiego zła.",
    "zmDWx": "Skontaktuj się z nami",
    "zuxd0y-kmA": "Identyfikator użytkownika lub numer telefonu nie zawiera białych znaków."
}