{
    "MySQL-Performance-Tuning": "Tipps zur MySQL-Leistungsoptimierung",
    "OWASP-SQL-Injection": "OWASP SQL-Injection-Handbuch",
    "SQL-Basics-001": "Was ist SQL?",
    "SQL-Beautifier-Example": "Online-SQL-Formatierer",
    "SQL-Beautify-006": "Was ist SQL-Verschönerung?",
    "SQL-Beautify-Def-007": "Bei der SQL-Verschönerung handelt es sich um den Prozess der Formatierung von SQL-Code, um die Lesbarkeit durch die Anwendung einheitlicher Einrückungs-, Abstands- und Groß-/Kleinschreibungskonventionen zu verbessern.",
    "SQL-Beautify-Purpose-008": "Genau wie generische Codeverschönerer hilft es Entwicklern, komplexe Abfragen einfacher zu verstehen und die Konsistenz in ihren SQL-Skripten oder -Projekten aufrechtzuerhalten.",
    "SQL-Commands-005": "SQL umfasst mehrere Arten von Befehlen: DDL (Data Definition Language – CREATE, ALTER, DROP), DML (Data Manipulation Language – SELECT, INSERT, UPDATE, DELETE) und DCL (Data Control Language – GRANT, REVOKE).",
    "SQL-Components-004": "Was sind die Hauptkomponenten von SQL?",
    "SQL-Components-Wikipedia": "SQL-Komponenten auf Wikipedia",
    "SQL-Def-002": "SQL (Structured Query Language) ist eine Standardprogrammiersprache zum Verwalten und Abfragen relationaler Datenbanken.",
    "SQL-Indexing-016": "Was sind Indizes in SQL und warum sind sie wichtig?",
    "SQL-Indexing-Benefit-018": "Das Erstellen eines Indexes für häufig verwendete Spalten für WHERE-Klauselbedingungen beschleunigt SELECT-Abfragen erheblich, kann jedoch INSERT-, UPDATE- und DELETE-Vorgänge verlangsamen, da die Indexstruktur beibehalten werden muss.",
    "SQL-Indexing-Explanation-017": "Indizes sind Datenstrukturen (z. B. B-Bäume), die die Geschwindigkeit von Datenabrufvorgängen in einer Tabelle verbessern, indem sie es der Datenbank-Engine ermöglichen, Zeilen basierend auf bestimmten Spaltenwerten schnell zu finden.",
    "SQL-Indexing-MDN": "MDN-Webdokumente zu Indizes",
    "SQL-Injection-019": "Was ist SQL-Injection und wie kann es verhindert werden?",
    "SQL-Injection-Def-020": "SQL-Injection ist eine Sicherheitslücke, bei der ein Angreifer bösartigen SQL-Code in Eingabefelder einfügen kann, um Daten aus einer Datenbank zu manipulieren oder zu extrahieren.",
    "SQL-Injection-Prevention-021": "Zu den Präventionsmethoden gehören die Verwendung parametrisierter Abfragen, vorbereiteter Anweisungen oder ORM-Bibliotheken, die Benutzereingaben automatisch entziehen, sowie die Einschränkung von Datenbankberechtigungen und die Anwendung des Prinzips der geringsten Rechte.",
    "SQL-Joins-011": "Was sind JOINs in SQL?",
    "SQL-Joins-Explanation-012": "JOINs werden verwendet, um Zeilen aus zwei oder mehr Tabellen basierend auf einer zugehörigen Spalte zwischen ihnen zu kombinieren. Zum Beispiel INNER JOIN, LEFT JOIN, RIGHT JOIN und FULL JOIN.",
    "SQL-Joins-Tutorial": "Tutorial zu SQL-Joins",
    "SQL-Perf-Tuning-Methods-024": "Andere Techniken umfassen die Partitionierung großer Tabellen, die Verwendung geeigneter Datentypen und das Zwischenspeichern von Ergebnissen, sofern möglich.",
    "SQL-Perf-Tuning-Overview-023": "Zur Optimierung der SQL-Abfrageleistung gehören die Analyse von Ausführungsplänen, die entsprechende Indizierung, die Minimierung unnötiger Verknüpfungen und Unterabfragen sowie das Schreiben effizienter WHERE-Klauseln.",
    "SQL-Performance-Tuning-022": "Wie optimiere ich die SQL-Abfrageleistung?",
    "SQL-Purpose-003": "Es wird zum Erstellen, Lesen, Aktualisieren, Löschen und Abfragen von Daten in Tabellen sowie zum Verwalten der Datenbankstruktur und -berechtigungen verwendet.",
    "SQL-Select-009": "Wie schreibe ich eine einfache SELECT-Anweisung?",
    "SQL-Select-Example-0210": "Eine einfache SELECT-Anweisung ruft Daten aus einer Tabelle ab. Zum Beispiel: {0}', 'SELECT Spalte1, Spalte2 FROM my_table;",
    "SQL-Transactions-013": "Was sind Transaktionen in SQL?",
    "SQL-Transactions-Def-014": "Eine Transaktion ist eine logische Arbeitseinheit, die eine oder mehrere SQL-Anweisungen enthält. Es stellt sicher, dass alle darin enthaltenen Vorgänge erfolgreich abgeschlossen werden (Atomarität), von anderen Transaktionen isoliert und auch im Falle eines Systemausfalls dauerhaft sind.",
    "SQL-Transactions-Example-015": "Um eine Transaktion zu starten, verwenden Sie den Befehl START TRANSACTION. Übernehmen Sie Änderungen mit COMMIT oder kehren Sie mit ROLLBACK zum vorherigen Status zurück.",
    "SQL-Transactions-W3Schools": "SQL-Transaktionen auf W3Schools"
}