{
    "MySQL-Performance-Tuning": "Tip Penyetelan Kinerja MySQL",
    "OWASP-SQL-Injection": "Panduan Injeksi SQL OWASP",
    "SQL-Basics-001": "Apa itu SQL?",
    "SQL-Beautifier-Example": "Pemformat SQL Online",
    "SQL-Beautify-006": "Apa itu Kecantikan SQL?",
    "SQL-Beautify-Def-007": "Kecantikan SQL adalah proses memformat kode SQL untuk meningkatkan keterbacaan dengan menerapkan indentasi, spasi, dan konvensi huruf yang konsisten.",
    "SQL-Beautify-Purpose-008": "Sama seperti penghias kode umum, ini membantu pengembang memahami kueri kompleks dengan lebih mudah dan menjaga konsistensi di seluruh skrip atau proyek SQL mereka.",
    "SQL-Commands-005": "SQL mencakup beberapa jenis perintah: DDL (Data Definition Language - CREATE, ALTER, DROP), DML (Data Manipulation Language - SELECT, INSERT, UPDATE, DELETE), dan DCL (Data Control Language - GRANT, REVOKE).",
    "SQL-Components-004": "Apa saja komponen utama SQL?",
    "SQL-Components-Wikipedia": "Komponen SQL di Wikipedia",
    "SQL-Def-002": "SQL (Structured Query Language) adalah bahasa pemrograman standar untuk mengelola dan menanyakan database relasional.",
    "SQL-Indexing-016": "Apa itu indeks dalam SQL dan mengapa itu penting?",
    "SQL-Indexing-Benefit-018": "Membuat indeks pada kolom yang sering digunakan untuk kondisi klausa WHERE secara signifikan mempercepat kueri SELECT tetapi dapat memperlambat operasi INSERT, UPDATE, dan DELETE karena kebutuhan untuk mempertahankan struktur indeks.",
    "SQL-Indexing-Explanation-017": "Indeks adalah struktur data (misalnya, pohon-B) yang meningkatkan kecepatan operasi pengambilan data dalam tabel dengan memungkinkan mesin basis data menemukan baris dengan cepat berdasarkan nilai kolom tertentu.",
    "SQL-Indexing-MDN": "Dokumen Web MDN tentang Indeks",
    "SQL-Injection-019": "Apa itu SQL Injection dan bagaimana cara mencegahnya?",
    "SQL-Injection-Def-020": "SQL Injection adalah kerentanan keamanan di mana penyerang dapat memasukkan kode SQL berbahaya ke dalam kolom input untuk memanipulasi atau mengekstrak data dari database.",
    "SQL-Injection-Prevention-021": "Metode pencegahan mencakup penggunaan kueri berparameter, pernyataan yang disiapkan, atau pustaka ORM yang secara otomatis menghindari input pengguna, serta membatasi izin database dan menerapkan prinsip hak istimewa paling rendah.",
    "SQL-Joins-011": "Apa itu GABUNG di SQL?",
    "SQL-Joins-Explanation-012": "JOIN digunakan untuk menggabungkan baris dari dua tabel atau lebih berdasarkan kolom terkait di antara keduanya. Misalnya, INNER JOIN, LEFT JOIN, RIGHT JOIN, dan FULL JOIN.",
    "SQL-Joins-Tutorial": "Tutorial Gabung SQL",
    "SQL-Perf-Tuning-Methods-024": "Teknik lainnya termasuk mempartisi tabel besar, menggunakan tipe data yang sesuai, dan menyimpan hasil dalam cache jika memungkinkan.",
    "SQL-Perf-Tuning-Overview-023": "Mengoptimalkan kinerja kueri SQL melibatkan analisis rencana eksekusi, pengindeksan yang tepat, meminimalkan gabungan dan subkueri yang tidak perlu, dan menulis klausa WHERE yang efisien.",
    "SQL-Performance-Tuning-022": "Bagaimana cara mengoptimalkan kinerja kueri SQL?",
    "SQL-Purpose-003": "Ini digunakan untuk membuat, membaca, memperbarui, menghapus, dan mengkueri data dalam tabel serta mengelola struktur dan izin database.",
    "SQL-Select-009": "Bagaimana cara menulis pernyataan SELECT dasar?",
    "SQL-Select-Example-0210": "Pernyataan SELECT sederhana mengambil data dari tabel. Misalnya: {0}', 'PILIH kolom1, kolom2 DARI tabel_saya;",
    "SQL-Transactions-013": "Apa itu transaksi di SQL?",
    "SQL-Transactions-Def-014": "Transaksi adalah unit kerja logis yang berisi satu atau lebih pernyataan SQL. Ini memastikan bahwa semua operasi di dalamnya diselesaikan dengan sukses (atomisitas), terisolasi dari transaksi lain, dan tahan lama bahkan jika terjadi kegagalan sistem.",
    "SQL-Transactions-Example-015": "Untuk memulai transaksi, gunakan perintah MULAI TRANSAKSI; melakukan perubahan dengan COMMIT atau kembalikan ke keadaan sebelumnya dengan ROLLBACK.",
    "SQL-Transactions-W3Schools": "Transaksi SQL di W3Schools"
}