{
    "MD4-Advantages-011": "Каковы преимущества использования MD4?",
    "MD4-AlgorithmDetails-010": "Подробности алгоритма MD4",
    "MD4-Applications-018": "Какие приложения использовали или до сих пор используют MD4?",
    "MD4-Breakdown-016": "Недостатки конструкции алгоритма привели к практическим атакам, допускающим легкие коллизии хэшей и даже частичные атаки прообразов, что делает MD4 непригодным для любого безопасного криптографического использования сегодня.",
    "MD4-CollisionSecurity-015": "MD4 имеет несколько криптографических недостатков, в том числе подверженность атакам с коллизиями. Это означает, что два разных входа могут выдавать один и тот же результат хэширования, что делает его небезопасным для приложений, требующих устойчивости к коллизиям или строгой целостности сообщений.",
    "MD4-Def-002": "MD4 (алгоритм дайджеста сообщений 4) — это криптографическая хеш-функция, разработанная Рональдом Ривестом в 1990 году. Она создает 128-битное хэш-значение для любого заданного входного сообщения.",
    "MD4-DigitalSignature-Risks-021": "Риски использования MD4 для цифровых подписей",
    "MD4-Disadvantages-014": "Каковы недостатки и проблемы безопасности MD4?",
    "MD4-FAQ-001": "Что такое МД4?",
    "MD4-HistoricalUse-019": "Исторически MD4 использовался для цифровых подписей, проверки целостности файлов и обновлений программного обеспечения. Однако из-за своих уязвимостей эти приложения в значительной степени перешли на более безопасные альтернативы, такие как SHA-256 и SHA-3.",
    "MD4-History-004": "Как был разработан MD4 и каково его историческое значение?",
    "MD4-Implementation-013": "Он широко реализован и стандартизирован на различных платформах и языках, обеспечивая простоту интеграции в существующие системы, хотя в современных контекстах это преимущество перевешивается проблемами безопасности.",
    "MD4-InsecurityExamples-017": "Примеры нарушения безопасности MD4",
    "MD4-LegacySystems-020": "MD4 все еще может существовать в устаревших системах, но его использование не рекомендуется во всех контекстах, где безопасность является проблемой. Современные стандарты больше не рекомендуют MD4 для каких-либо криптографических целей.",
    "MD4-Operation-007": "Как работает операция MD4?",
    "MD4-Origin-005": "MD4 был развитием MD2 и MD3, предназначенным для обеспечения более высокой производительности при сохранении свойств безопасности. Однако стало очевидно, что MD4 имеет несколько слабых мест в безопасности.",
    "MD4-Process-008": "MD4 обрабатывает входное сообщение, дополняя его до кратного 512 битам и разделяя на блоки по 16 слов. Затем алгоритм работает с этими блоками, используя четыре раунда обработки, включающие побитовые операции, модульные сложения и нелинейные функции.",
    "MD4-Purpose-003": "Цель MD4 — обеспечить целостность данных путем создания цифрового отпечатка пальца фиксированного размера, который можно использовать для проверки подлинности и целостности исходных данных.",
    "MD4-Rounds-009": "После обработки всех блоков полученное внутреннее состояние преобразуется в окончательное 128-битное значение хеш-функции.",
    "MD4-Speed-012": "Изначально MD4 разрабатывался как более быстрый, чем его предшественники, что сделало его популярным для приложений, требующих быстрого хеширования на момент его появления.",
    "MD4-Successors-006": "Несмотря на свои недостатки, MD4 заложил основу для последующих хэш-функций, таких как MD5 и SHA-1, которые улучшили его конструкцию, но также со временем унаследовали некоторые его уязвимости."
}