{
    "MD4-Advantages-011": "ข้อดีของการใช้ MD4 คืออะไร?",
    "MD4-AlgorithmDetails-010": "รายละเอียดอัลกอริทึม MD4",
    "MD4-Applications-018": "แอปพลิเคชันใดบ้างที่เคยใช้หรือยังคงใช้ MD4",
    "MD4-Breakdown-016": "ข้อบกพร่องด้านการออกแบบของอัลกอริธึมได้นำไปสู่การโจมตีในทางปฏิบัติ ทำให้เกิดการชนกันของแฮชได้ง่าย และแม้แต่การโจมตีพรีอิมเมจบางส่วน ส่งผลให้ MD4 ไม่เหมาะสมกับกรณีการใช้งานการเข้ารหัสที่ปลอดภัยใดๆ ในปัจจุบัน",
    "MD4-CollisionSecurity-015": "MD4 มีจุดอ่อนด้านการเข้ารหัสหลายประการ รวมถึงความอ่อนแอต่อการโจมตีแบบชนกัน ซึ่งหมายความว่าอินพุตที่แตกต่างกันสองรายการสามารถสร้างเอาต์พุตแฮชเดียวกันได้ ทำให้ไม่ปลอดภัยสำหรับแอปพลิเคชันที่ต้องการความต้านทานการชนกันหรือความสมบูรณ์ของข้อความที่แข็งแกร่ง",
    "MD4-Def-002": "MD4 (อัลกอริธึมการแยกข้อความ 4) เป็นฟังก์ชันแฮชสำหรับการเข้ารหัสที่ออกแบบโดย Ronald Rivest ในปี 1990 สร้างค่าแฮช 128 บิตสำหรับข้อความอินพุตที่กำหนด",
    "MD4-DigitalSignature-Risks-021": "ความเสี่ยงของการใช้ MD4 สำหรับลายเซ็นดิจิทัล",
    "MD4-Disadvantages-014": "ข้อเสียและข้อกังวลด้านความปลอดภัยของ MD4 คืออะไร",
    "MD4-FAQ-001": "MD4 คืออะไร?",
    "MD4-HistoricalUse-019": "ในอดีต MD4 ถูกใช้ในลายเซ็นดิจิทัล การตรวจสอบความสมบูรณ์ของไฟล์ และการอัพเดตซอฟต์แวร์ อย่างไรก็ตาม เนื่องจากช่องโหว่ แอปพลิเคชันเหล่านี้จึงเปลี่ยนไปใช้ทางเลือกอื่นที่ปลอดภัยมากขึ้น เช่น SHA-256 และ SHA-3 เป็นส่วนใหญ่",
    "MD4-History-004": "MD4 ได้รับการพัฒนาอย่างไร และมีความสำคัญทางประวัติศาสตร์อย่างไร",
    "MD4-Implementation-013": "มีการนำไปใช้อย่างกว้างขวางและเป็นมาตรฐานในแพลตฟอร์มและภาษาต่างๆ ทำให้ง่ายต่อการรวมเข้ากับระบบที่มีอยู่ แม้ว่าข้อได้เปรียบนี้จะมีมากกว่าข้อกังวลด้านความปลอดภัยในบริบทสมัยใหม่ก็ตาม",
    "MD4-InsecurityExamples-017": "ตัวอย่างรายละเอียดการรักษาความปลอดภัย MD4",
    "MD4-LegacySystems-020": "MD4 อาจยังคงอยู่ในระบบเดิม แต่ไม่สนับสนุนการใช้งานในทุกบริบทที่คำนึงถึงความปลอดภัย มาตรฐานสมัยใหม่ไม่แนะนำ MD4 สำหรับวัตถุประสงค์ในการเข้ารหัสอีกต่อไป",
    "MD4-Operation-007": "การทำงานของ MD4 ทำงานอย่างไร?",
    "MD4-Origin-005": "MD4 เป็นวิวัฒนาการของ MD2 และ MD3 โดยมีจุดประสงค์เพื่อให้ประสิทธิภาพที่เร็วขึ้นในขณะที่ยังคงคุณสมบัติด้านความปลอดภัยไว้ อย่างไรก็ตาม เห็นได้ชัดว่า MD4 มีจุดอ่อนด้านความปลอดภัยหลายประการ",
    "MD4-Process-008": "MD4 ประมวลผลข้อความอินพุตโดยขยายให้เป็นทวีคูณของ 512 บิต และแบ่งออกเป็นบล็อก 16 คำ จากนั้นอัลกอริธึมจะดำเนินการกับบล็อกเหล่านี้โดยใช้การประมวลผลสี่รอบที่เกี่ยวข้องกับการดำเนินการระดับบิต การเพิ่มโมดูลาร์ และฟังก์ชันที่ไม่ใช่เชิงเส้น",
    "MD4-Purpose-003": "วัตถุประสงค์ของ MD4 คือการรับรองความสมบูรณ์ของข้อมูลโดยการสร้างลายนิ้วมือดิจิทัลขนาดคงที่ซึ่งสามารถใช้เพื่อตรวจสอบความถูกต้องและความสมบูรณ์ของข้อมูลต้นฉบับ",
    "MD4-Rounds-009": "หลังจากประมวลผลบล็อกทั้งหมดแล้ว สถานะภายในที่เป็นผลลัพธ์จะถูกแปลงเป็นค่าแฮช 128 บิตสุดท้าย",
    "MD4-Speed-012": "ในตอนแรก MD4 ได้รับการออกแบบมาให้เร็วกว่ารุ่นก่อน ซึ่งทำให้ได้รับความนิยมสำหรับแอปพลิเคชันที่ต้องใช้การแฮชอย่างรวดเร็วในขณะที่เปิดตัว",
    "MD4-Successors-006": "แม้จะมีข้อบกพร่อง MD4 ก็วางรากฐานสำหรับฟังก์ชันแฮชที่ตามมา เช่น MD5 และ SHA-1 ซึ่งได้รับการปรับปรุงตามการออกแบบ แต่ยังสืบทอดช่องโหว่บางส่วนเมื่อเวลาผ่านไป"
}