{
    "MD6-AlgorithmDetails-010": "Podrobnosti algoritmu MD6",
    "MD6-ComparisonSHA3-020": "Jak si stojí MD6 ve srovnání s SHA-3 (Keccak)?",
    "MD6-Def-002": "MD6 (Message-Digest Algorithm 6) je kryptografická hašovací funkce navržená Ronaldem Rivestem v roce 2008. Jde o evoluci rodiny MD, která nabízí variabilní výstupní velikosti v rozsahu od 128 do 512 bitů.",
    "MD6-FAQ-001": "Co je MD6?",
    "MD6-FutureDevelopments-028": "Plánuje se pro MD6 nějaký budoucí vývoj nebo vylepšení?",
    "MD6-FutureUnknown-029": "V tuto chvíli nejsou žádné veřejně dostupné informace o probíhajícím vývoji nebo plánech na vylepšení algoritmu MD6. Kryptografický výzkum se neustále vyvíjí a mohou se objevit nové algoritmy, které budou řešit vznikající hrozby nebo požadavky.",
    "MD6-History-004": "Jak byl MD6 vyvinut a co vedlo k jeho vytvoření?",
    "MD6-Operation-007": "Jak funguje provoz MD6?",
    "MD6-Origin-005": "MD6 byl vytvořen jako reakce na zranitelnosti nalezené v MD5 a SHA-1, které byly v té době široce používány. Jeho cílem bylo poskytnout bezpečnější alternativu se zvýšenou flexibilitou, pokud jde o velikost výstupu.",
    "MD6-PKI-Alternatives-027": "Pro aplikace PKI a digitálního podpisu se místo toho běžně používají standardy jako RSA/SHA-256 nebo ECDSA s variantami SHA-2 nebo SHA-3. Ty prošly rozsáhlou analýzou a vybudovaly si důvěru v kryptografické komunitě.",
    "MD6-PKI-Considerations-026": "Zatímco MD6 měl poskytovat silnější zabezpečení než dřívější hashovací funkce jako MD5, nebyl široce přijat pro PKI nebo schémata digitálního podpisu kvůli jeho relativní novosti a nedostatku širokého přijetí kryptografické komunity.",
    "MD6-Process-008": "MD6 zpracovává vstupní zprávy prostřednictvím řady kompresních funkcí, které jsou aplikovány ve stromové struktuře. Algoritmus může pracovat paralelně, což přispívá k jeho výkonu pro větší vstupy.",
    "MD6-Purpose-003": "MD6 si klade za cíl poskytovat robustní bezpečnostní funkce a lepší výkon ve srovnání se svými předchůdci, díky čemuž je vhodný pro různé aplikace vyžadující hašování odolné proti kolizi a kontroly integrity zpráv.",
    "MD6-Rounds-009": "Každý uzel ve stromu MD6 prochází několika koly směšovacích operací zahrnujících modulární sčítání, bitové XOR a nelineární permutace. Konečná hodnota kořenového uzlu představuje hash digest vstupní zprávy.",
    "MD6-SecurityUpgrade-006": "Návrh MD6 je postaven na koncepci stromového hašování, což mu umožňuje nabídnout lepší ochranu proti preimage a kolizním útokům než předchozí algoritmy MD a zároveň poskytuje vyšší propustnost pro velké soubory dat.",
    "MD6-StayingCurrent-030": "Při výběru hašovací funkce pro jakoukoli aplikaci je nezbytné mít aktuální informace o nejnovějších zjištěních výzkumu a doporučeních od odborníků na kryptografii, zvláště když se prostředí kryptografické bezpečnosti v průběhu času vyvíjí.",
    "MD6-UseInPKI-025": "Lze MD6 použít pro infrastrukturu veřejného klíče (PKI) nebo digitální podpisy?",
    "MD6-vs-SHA3-Adoption-023": "SHA-3 byl přijat jako oficiální standard NIST a získal široké použití díky svému robustnímu zabezpečení a výkonu. MD6, přestože je teoreticky bezpečný, nezaznamenal stejnou úroveň přijetí nebo standardizace.",
    "MD6-vs-SHA3-DiffDesign-021": "MD6 a SHA-3 jsou navrženy s ohledem na bezpečnost, ale používají různé hashovací techniky. MD6 používá stromový design pro vylepšený paralelismus, zatímco SHA-3 je založen na konstrukci houby.",
    "MD6-vs-SHA3-Flexibility-022": "MD6 nabízí variabilní výstupní délky, což může být výhodné pro aplikace, které vyžadují vlastní velikosti hash. SHA-3 také podporuje proměnné délky výstupu, ačkoli jeho nejběžnější varianta, SHAKE, poskytuje ještě větší flexibilitu s výstupy libovolné délky.",
    "SHA3-NISTStandard-024": "Standardizace SHA-3"
}