{
    "c2tpr": "Apache Commons Codec kitaplığı, Java'da Base32 kodlama ve kod çözme işlevselliği sağlar.",
    "c9j5k": "'base32.h' başlığını ve ilgili uygulamasını indirip projenize ekleyin.",
    "c9j5v": "Projenize 'besteci gerektirir christian-riesen/base32' ifadesini ekleyerek Composer aracılığıyla yükleyin.",
    "d6g0w": "Bu kod parçası, komut dosyaları, etkileşimli oturumlar da dahil olmak üzere herhangi bir Python ortamında veya daha büyük bir uygulama içinde çalıştırılabilir.",
    "f8wne": "Paket Yönetici Konsolu'nda 'Install-Package BouncyCastle'ı çalıştırarak veya .csproj dosyanıza ekleyerek paketi dahil edin.",
    "g5ybh": "Bağımlılığı projenize ekleyin (Maven: 'org.Apache.commons:commons-codec').",
    "g6f0r": "Ruby'nin çekirdek kütüphaneleri için ek kuruluma gerek yoktur. 'TEST12345'i istediğiniz değerle değiştirmeniz yeterlidir.",
    "g6f0t": "Bağımlılığı projenize eklemek için 'go get github.com/mitchellh/go-base32' komutunu çalıştırın.",
    "k7d9f": "Ruby'nin yerleşik 'base32' kitaplığı, Base32 kodlama ve kod çözme için yöntemler sağlar.",
    "k7d9r": "'go-base32' paketi, Go'da Base32 kodlama ve kod çözme yetenekleri sağlar.",
    "k9jtr": "Node.js'de Base32 kodlama ve kod çözme için 'base32-encoding' npm paketi kullanılır.",
    "m6t1b": "Daniel R. Collins'in 'base32' kitaplığı, C++'da Base32 kodlama ve kod çözme işlevselliği sağlar.",
    "r8c6z": "'TEST12345'i kendi dizenizle değiştirin ve sonuçları görmek için bu sınıfı bir Java programı olarak çalıştırın.",
    "r8y2w": "'Base32' PHP kütüphanesi burada Base32 kodlama ve kod çözme için kullanılır.",
    "s5b8m": "'TEST12345'i kendi verilerinizle değiştirin ve Base32 işlemlerini gerçekleştirmek için bu betiği bir PHP ortamında çalıştırın.",
    "s5e8r": "'TEST12345'i gerçek verilerinizle değiştirin ve Base32 işlemlerini gerçekleştirmek için bu pasajı Swift uygulama bağlamında çalıştırın.",
    "s7e9r": "Harici kütüphanelere ihtiyaç yoktur. Kodlamak/kodunu çözmek için 'b'TEST12345''i gerçek bayt benzeri nesnenizle değiştirmeniz yeterlidir.",
    "t7m4g": "'base32' sandığı, Rust'ta Base32 kodlama ve kod çözme için kullanılır.",
    "t9m3g": "CryptoSwift, Base32 kodlama ve kod çözme işlevini içeren popüler bir Swift paketidir.",
    "v6qkl": "BouncyCastle NuGet paketi, C# dilinde Base32 kodlama ve kod çözme sağlar.",
    "v9b7t": "'TEST12345'i kendi dizenizle değiştirin ve Base32 kodlama ve kod çözme işlemlerini gerçekleştirmek için bu konsol uygulamasını çalıştırın.",
    "x6v2w": "C'de standart bir Base32 kitaplığı yoktur, dolayısıyla burada varsayımsal bir 'libbase32' kitaplığı kullanıyoruz.",
    "x8mdg": "Python'un yerleşik 'base64' modülü, 'b32encode' ve 'b32decode' işlevleri aracılığıyla Base32 kodlama ve kod çözme sağlar.",
    "x9g7e": "Kaynak kodunu GitHub'dan (https://github.com/dankamongmen/libbase32) indirin veya platformunuz için mevcutsa paket olarak yükleyin.",
    "y5nne": "Bu kod doğrudan Node.js ortamında veya Base32 işlevselliğine ihtiyaç duyduğunuz daha büyük bir projenin parçası olarak çalıştırılabilir.",
    "y8b1m": "'TEST12345'i kendi verilerinizle değiştirin ve kitaplık işlevlerinin doğru şekilde uygulandığından ve Base32 işlemleri için bu programı derlemek ve yürütmek üzere bağlandığından emin olun.",
    "y9z2e": "'TEST12345'i gerçek bayt diliminizle değiştirin ve Base32 standart kodlamayı kullanarak kodlamak ve kod çözmek için bu Go programını çalıştırın.",
    "y9z2t": "Bu betiği IRB gibi bir Ruby ortamında yürütün veya bir .rb dosyası olarak kaydedin ve 'Ruby dosyaadı.rb' ile çalıştırın.",
    "z5bvb": "'Npm install base32-encoding' komutunu çalıştırarak yükleyin. Kod pasajında ​​'TEST12345'i istediğiniz giriş verileriyle değiştirin.",
    "z8n6k": "'TEST12345'i istediğiniz dizeyle değiştirin, Base32 kodlama ve kod çözme sonuçlarını görmek için bu programı derleyin ve çalıştırın.",
    "z9b6n": "Bağımlılığı Swift Paket Yöneticisi ('https://github.com/krzyzanowskim/CryptoSwift') aracılığıyla Xcode projenize ekleyin."
}